using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class AddSchoolsKrasnoyarsk : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 244047, 73, "Межшкольный учебный комбинат № 1" },
                    { 1723479, 73, "Школа № 152" },
                    { 1671422, 73, "Школа № 151" },
                    { 526419, 73, "Школа № 150" },
                    { 1338, 73, "Школа № 149" },
                    { 43711, 73, "Школа № 148" },
                    { 30116, 73, "Школа № 147" },
                    { 1020, 73, "Школа № 146" },
                    { 199143, 73, "Школа № 145" },
                    { 2148, 73, "Школа № 144" },
                    { 5688, 73, "Школа № 143" },
                    { 1752246, 73, "Школа № 153" },
                    { 120208, 73, "Лицей № 142" },
                    { 17540, 73, "Школа № 140" },
                    { 26920, 73, "Школа № 139" },
                    { 12368, 73, "Школа № 138" },
                    { 57106, 73, "Школа № 137" },
                    { 62037, 73, "Школа № 135" },
                    { 207635, 73, "Школа № 134" },
                    { 103773, 73, "Школа № 133" },
                    { 78447, 73, "Школа № 132" },
                    { 327948, 73, "Гимназия № 131" },
                    { 134153, 73, "Школа № 130" },
                    { 168177, 73, "Школа № 141" },
                    { 1777849, 73, "Школа № 154" },
                    { 216749, 73, "Гимназия № 155" },
                    { 169522, 73, "Школа № 161" },
                    { 135131, 73, "Авиационный технический колледж гражданской авиации (КАТК ГА)" },
                    { 1776218, 73, "IT школа Samsung" },
                    { 1454572, 73, "Детский сад № 307" },
                    { 95263, 73, "Школа № 257" },
                    { 96410, 73, "Школа № 254" },
                    { 758179, 73, "Детский сад № 220" },
                    { 1507972, 73, "Детский сад № 190" },
                    { 53799, 73, "Школа № 182" },
                    { 228839, 73, "Лицей № 180" },
                    { 62687, 73, "Школа № 178" },
                    { 197880, 73, "Школа № 176" },
                    { 66301, 73, "Школа № 175" },
                    { 323874, 73, "Лицей № 174" },
                    { 95314, 73, "Школа № 172" },
                    { 71475, 73, "Школа № 170" },
                    { 196150, 73, "Школа № 169" },
                    { 118336, 73, "Школа № 167" },
                    { 812943, 73, "Детский сад № 166" },
                    { 266704, 73, "Детский сад № 165" },
                    { 274379, 73, "Школа № 165" },
                    { 210503, 73, "Гимназия № 164" },
                    { 89895, 73, "Школа № 164" },
                    { 262973, 73, "Школа № 163" },
                    { 55490, 73, "Школа № 129" },
                    { 258502, 73, "Автотранспортный техникум (КАТТ)" },
                    { 70845, 73, "Школа № 128" },
                    { 163707, 73, "Вечерняя школа № 125" },
                    { 53795, 73, "Лицей № 102" },
                    { 103786, 73, "Школа № 102" },
                    { 47242, 73, "Школа № 101" },
                    { 21639, 73, "Школа № 100" },
                    { 151054, 73, "Школа № 99" },
                    { 42371, 73, "Школа № 98" },
                    { 16318, 73, "Школа № 97" },
                    { 170413, 73, "Гимназия № 96" },
                    { 25045, 73, "Школа № 96" },
                    { 18299, 73, "Школа № 95" },
                    { 207038, 73, "Музыкальная школа № 102" },
                    { 39558, 73, "Школа № 94" },
                    { 14528, 73, "Школа № 92" },
                    { 176388, 73, "Гимназия № 91" },
                    { 15927, 73, "Школа № 91" },
                    { 224596, 73, "Школа № 90" },
                    { 30229, 73, "Школа № 89" },
                    { 41041, 73, "Школа № 88" },
                    { 99955, 73, "Профессиональное училище № 87" },
                    { 203849, 73, "Школа № 87" },
                    { 230441, 73, "Профессиональное училище № 86" },
                    { 39849, 73, "Школа № 86" },
                    { 221761, 73, "Школа № 93" },
                    { 105006, 73, "Школа № 103" },
                    { 53796, 73, "Лицей № 103" },
                    { 130290, 73, "Школа-интернат № 103" },
                    { 177344, 73, "Школа № 124" },
                    { 293271, 73, "Лицей № 123" },
                    { 99255, 73, "Школа № 122" },
                    { 17473, 73, "Школа № 121" },
                    { 340264, 73, "Школа № 120" },
                    { 216401, 73, "Центр образования 120" },
                    { 100655, 73, "Школа № 119" },
                    { 113190, 73, "Школа № 118" },
                    { 133865, 73, "Школа № 117" },
                    { 324013, 73, "Гимназия № 116" },
                    { 280738, 73, "Центр образования 116" },
                    { 39718, 73, "Школа № 115" },
                    { 743968, 73, "Детский сад № 114" },
                    { 206906, 73, "Школа № 114" },
                    { 92378, 73, "Школа № 113" },
                    { 117325, 73, "Школа № 112" },
                    { 204220, 73, "Школа № 111" },
                    { 222698, 73, "Гимназия № 110" },
                    { 88093, 73, "Школа № 110" },
                    { 1353, 73, "Школа № 108" },
                    { 177784, 73, "Школа № 106" },
                    { 53797, 73, "Школа № 105" },
                    { 20269, 73, "Школа № 104" },
                    { 62402, 73, "Школа № 127" },
                    { 517333, 73, "Профессиональное училище № 85" },
                    { 1705594, 73, "Автошкола ДОСААФ" },
                    { 240830, 73, "Академический лицей им. Н. И. Лобачевского при КГУ" },
                    { 1773527, 73, "Спортивная школа олимпийского резерва «Здоровый мир»" },
                    { 1747270, 73, "Сибирский корпоративный энергетический учебный центр (СибКЭУЦ)" },
                    { 357475, 73, "Сельскохозяйственный техникум (КСХТ)" },
                    { 292299, 73, "Региональный колледж (СРК)" },
                    { 138582, 73, "Промышленно-коммерческий техникум (КЗПКТ)" },
                    { 1660227, 73, "Православная школа" },
                    { 236172, 73, "Политехнический техникум" },
                    { 389977, 73, "Отделение среднего профессионального образования КГТЭИ" },
                    { 148741, 73, "Музыкальный областной колледж им. Рахманинова" },
                    { 241111, 73, "Музыкальный лицей при КГИИ" },
                    { 148154, 73, "Строительный техникум (КСТ)" },
                    { 88466, 73, "Музыкальный колледж при КГАМиТ" },
                    { 145523, 73, "Музыкальная школа при Краевом музыкальном обществе" },
                    { 165155, 73, "Музыкальная школа Института искусств" },
                    { 177005, 73, "Музыкальная школа «Орленок»" },
                    { 175311, 73, "Музыкальная школа «Классика» (при Доме учителя)" },
                    { 266296, 73, "Музыкальная школа «Гармония»" },
                    { 60722, 73, "Монтажный колледж" },
                    { 345979, 73, "Механический техникум" },
                    { 69509, 73, "Межрегиональный правовой колледж (МПК СФУ)" },
                    { 158791, 73, "Медицинское училище" },
                    { 1761482, 73, "Медицинский техникум" },
                    { 314532, 73, "Музыкальная школа при КУИ" },
                    { 167663, 73, "Технико-экономический колледж (КТЭК)" },
                    { 320408, 73, "Техникум железнодорожного транспорта (КТЖТ)" },
                    { 1780538, 73, "Техникум индустрии гостеприимства и сервиса" },
                    { 114535, 73, "Школа спортивного бального танца" },
                    { 160071, 73, "Школа космонавтики (ШК)" },
                    { 1771970, 73, "Школа дистанционного образования" },
                    { 403543, 73, "Школа гуманитарного образования (ШГО)" },
                    { 176925, 73, "Школа Ворожейкина «Эрудит»" },
                    { 190213, 73, "Школа «Знание»" },
                    { 136027, 73, "Художественное училище им. В. И. Сурикова (КГХУ)" },
                    { 38888, 73, "Художественная школа им. В. И. Сурикова" },
                    { 195580, 73, "Художественная школа «Кедровые орешки»" },
                    { 17406, 73, "Хореографическое училище" },
                    { 127364, 73, "Финансово-экономический колледж (КФЭК)" },
                    { 95368, 73, "Училище олимпийского резерва (КУОР)" },
                    { 157076, 73, "Учебный центр МВД" },
                    { 801502, 73, "Учебно-производственный цех «Прогресс»" },
                    { 253865, 73, "Торговое училище" },
                    { 188836, 73, "Торгово-экономический техникум (КТЭТ)" },
                    { 175202, 73, "Технологический техникум пищевой промышленности (КТТПП)" },
                    { 198906, 73, "Технологический колледж (КТК)" },
                    { 257652, 73, "Техникум физической культуры и спорта (КТФКиС)" },
                    { 1723103, 73, "Техникум социальных технологий (КТСТ)" },
                    { 1718686, 73, "Техникум промышленного сервиса (КТПС)" },
                    { 230054, 73, "Техникум космического машиностроения (КТКМ)" },
                    { 274456, 73, "Техникум информатики и вычислительной техники (КТИиВТ)" },
                    { 119711, 73, "Медицинский базовый колледж им. Крутовского (КБМК)" },
                    { 220742, 73, "Аграрный колледж" },
                    { 334534, 73, "Медико-фармацевтический колледж (КМФК)" },
                    { 231406, 73, "Мариинская женская гимназия (КЖМГ)" },
                    { 1730968, 73, "Детско-юношеская спортивная школа олимпийского резерва «Спутник»" },
                    { 157546, 73, "Детско-юношеская спортивная школа «Юность»" },
                    { 262522, 73, "Детско-юношеская спортивная школа «Строитель»" },
                    { 324918, 73, "Детско-юношеская спортивная школа «Спартак»" },
                    { 215685, 73, "Детско-юношеская спортивная школа «Сокол»" },
                    { 318797, 73, "Детско-юношеская спортивная школа «Локомотив»" },
                    { 359394, 73, "Детско-юношеская спортивная школа «Кентавр»" },
                    { 339697, 73, "Детско-юношеская спортивная школа «Кадеты Красноярья»" },
                    { 214628, 73, "Детско-юношеская спортивная школа «Енисей»" },
                    { 185316, 73, "Детский сад «Золотая рыбка»" },
                    { 175442, 73, "Детско-юношеская спортивная школа по горным лыжам" },
                    { 114537, 73, "Детский образовательный центр (ДОЦ)" },
                    { 1698217, 73, "Гуманитарно-экономический техникум" },
                    { 130558, 73, "Гуманитарно-правовой лицей" },
                    { 280640, 73, "Высшая школа милиции (СибЮИ)" },
                    { 97104, 73, "Высшая школа закройщиков-модельеров (ВШЗМ)" },
                    { 1718091, 73, "Восточно-Сибирский колледж туризма и сервиса" },
                    { 213350, 73, "Воскресная школа" },
                    { 174374, 73, "Аэрокосмический лицей" },
                    { 1630008, 73, "Аэрокосмический колледж (АК СибГАУ)" },
                    { 1700079, 73, "Аэрокосмическая школа" },
                    { 193564, 73, "Академия спорта" },
                    { 197508, 73, "Дворец спорта им. И. Ярыгина" },
                    { 107087, 73, "Детско-юношеская спортивная школа по дзюдо" },
                    { 62077, 73, "Детско-юношеская спортивная школа по летним видам спорта" },
                    { 148469, 73, "Детско-юношеская спортивная школа по спортивной гимнастике" },
                    { 160451, 73, "Малая медицинская академия" },
                    { 255416, 73, "Малая инженерная академия" },
                    { 80711, 73, "Литературный лицей им. В. П. Астафьева" },
                    { 275338, 73, "Летняя школа (КЛШ)" },
                    { 1766294, 73, "Красноярский аграрный техникум" },
                    { 81824, 73, "Краевой медицинский колледж" },
                    { 171198, 73, "Краевой дворец пионеров и школьников (КДПиШ)" },
                    { 1779585, 73, "Краевая автошкола «Движение»" },
                    { 146542, 73, "Кооперативный техникум экономики, коммерции и права (КТЭКП)" },
                    { 246638, 73, "Кооперативный техникум (ККТ)" },
                    { 169667, 73, "Командное речное училище (ККРУ)" },
                    { 1744214, 73, "Колледж сферы услуг и предпринимательства" },
                    { 57289, 73, "Колледж СИБУП" },
                    { 1676037, 73, "Колледж РАП" },
                    { 228434, 73, "Колледж радиоэлектроники и информационных технологий (Колледж радиоэлектроники, экономики и управления, ККРЭУ)" },
                    { 60084, 73, "Колледж искусств им. П.И. Иванова-Радкевича (ККИ, бывш. КУИ)" },
                    { 196369, 73, "Колледж деревообрабатывающей промышленности" },
                    { 239717, 73, "Кадетский корпус им. А. И. Лебедя" },
                    { 252160, 73, "Индустриально-металлургический техникум (КрИМТ)" },
                    { 1781791, 73, "Заочная естественно-научная школа при СФУ" },
                    { 345161, 73, "Детское речное пароходство (КДРП)" },
                    { 129586, 73, "Детско-юношеская спортивная школа по художественной гимнастике" },
                    { 1295115, 73, "Детско-юношеская спортивная школа по хоккею" },
                    { 154707, 73, "Машиностроительный колледж (КМсК)" },
                    { 1658756, 73, "Школа-интернат для глухих детей" },
                    { 260849, 73, "Школа-интернат № 85" },
                    { 42318, 73, "Школа № 84" },
                    { 49717, 73, "Гимназия № 10" },
                    { 161586, 73, "Школа № 10" },
                    { 155306, 73, "Школа искусств № 9" },
                    { 311806, 73, "Красноярский колледж отраслевых технологий и предпринимательства (бывш. ПЛ № 9)" },
                    { 133229, 73, "Художественная школа № 9" },
                    { 267154, 73, "Музыкальная школа № 9" },
                    { 154989, 73, "Школа-интернат № 9" },
                    { 73466, 73, "Лицей № 9" },
                    { 34222, 73, "Гимназия № 9" },
                    { 163829, 73, "Школа № 9" },
                    { 37131, 73, "Лицей № 10" },
                    { 81078, 73, "Школа искусств № 8" },
                    { 51979, 73, "Лицей № 8" },
                    { 6628, 73, "Гимназия № 8" },
                    { 173498, 73, "Школа № 8" },
                    { 360892, 73, "Детский сад № 7" },
                    { 429306, 73, "Техническое училище № 7" },
                    { 148046, 73, "Музыкальная школа № 7" },
                    { 106195, 73, "Лицей № 7" },
                    { 139345, 73, "Гимназия № 7" },
                    { 233471, 73, "Школа № 7" },
                    { 78448, 73, "Школа искусств № 6" },
                    { 177288, 73, "Музыкальная школа № 8" },
                    { 105353, 73, "Музыкальная школа № 10" },
                    { 121159, 73, "Школа искусств № 10" },
                    { 55430, 73, "Школа № 11" },
                    { 294346, 73, "Профессиональный лицей № 16 (до 2009 г.)" },
                    { 73707, 73, "Музыкальная школа № 16" },
                    { 1662568, 73, "Гимназия № 16" },
                    { 58570, 73, "Школа № 16" },
                    { 110505, 73, "Школа искусств № 15" },
                    { 73916, 73, "Художественная школа № 15" },
                    { 1305317, 73, "Гимназия № 15" },
                    { 69595, 73, "Школа № 15" },
                    { 131969, 73, "Школа искусств № 14" },
                    { 165026, 73, "Гимназия № 14" },
                    { 24242, 73, "Школа № 14" },
                    { 208097, 73, "Школа искусств № 13" },
                    { 74771, 73, "Музыкальная школа № 13" },
                    { 172275, 73, "Гимназия № 13 «Академ»" },
                    { 210403, 73, "Школа № 13" },
                    { 136078, 73, "Музыкальная школа № 12" },
                    { 1656550, 73, "Лицей № 12" },
                    { 185097, 73, "Гимназия № 12" },
                    { 194016, 73, "Школа № 12" },
                    { 349950, 73, "Художественная школа № 11" },
                    { 61393, 73, "Музыкальная школа № 11" },
                    { 218517, 73, "Лицей № 11" },
                    { 18731, 73, "Гимназия № 11" },
                    { 113601, 73, "Музыкальная школа № 6" },
                    { 193611, 73, "Профессионально-техническое училище № 16" },
                    { 49926, 73, "Гимназия № 6" },
                    { 24620, 73, "Лицей № 6" },
                    { 22525, 73, "Музыкальная школа № 2" },
                    { 110633, 73, "Школа-интернат № 2" },
                    { 57700, 73, "Лицей № 2" },
                    { 184023, 73, "Гимназия № 2" },
                    { 280617, 73, "Школа рабочей молодежи № 2" },
                    { 211909, 73, "Центр образования 2" },
                    { 215374, 73, "Межшкольный учебный комбинат № 2" },
                    { 116093, 73, "Школа № 2" },
                    { 148477, 73, "Школа искусств № 1" },
                    { 133989, 73, "Училище № 1" },
                    { 141111, 73, "Детско-юношеская спортивная школа № 2" },
                    { 241645, 73, "Профессиональный лицей № 1" },
                    { 224243, 73, "Художественная школа № 1" },
                    { 565776, 73, "Детско-юношеская спортивная школа № 1" },
                    { 117051, 73, "Музыкальная школа при ДК им. 1 Мая" },
                    { 196487, 73, "Музыкальная школа № 1" },
                    { 347621, 73, "Вечерняя школа № 1" },
                    { 177795, 73, "Школа-интернат № 1 им. В. П. Синякова" },
                    { 69385, 73, "Лицей № 1" },
                    { 53833, 73, "Гимназия № 1 «Универс»" },
                    { 90808, 73, "Центр образования 1" },
                    { 239718, 73, "Школа № 1 им. В. И. Сурикова" },
                    { 167031, 73, "Педагогический колледж № 1 им. Горького" },
                    { 48550, 73, "Художественная школа № 2" },
                    { 291546, 73, "Педагогический колледж № 2" },
                    { 822229, 73, "Профессионально-техническое училище № 2 Речное" },
                    { 126476, 73, "Школа искусств № 5" },
                    { 48522, 73, "Музыкальная школа № 5" },
                    { 58127, 73, "Вечерняя школа № 5" },
                    { 175543, 73, "Лицей № 5 музыкальный" },
                    { 53258, 73, "Гимназия № 5" },
                    { 43515, 73, "Школа № 5" },
                    { 177727, 73, "Центр образования 5" },
                    { 293042, 73, "Художественная школа № 4" },
                    { 66902, 73, "Музыкальная школа № 4 им. Д. Хворостовского" },
                    { 232108, 73, "Школа-интернат № 4" },
                    { 53792, 73, "Лицей № 4" },
                    { 114477, 73, "Гимназия № 4" },
                    { 154742, 73, "Центр образования 4" },
                    { 269980, 73, "Межшкольный учебный комбинат № 4" },
                    { 192954, 73, "Школа № 4" },
                    { 112084, 73, "Школа искусств № 3" },
                    { 127909, 73, "Музыкальная школа № 3" },
                    { 251785, 73, "Школа-интернат № 3" },
                    { 79719, 73, "Лицей № 3" },
                    { 20297, 73, "Гимназия № 3" },
                    { 133861, 73, "Центр образования 3" },
                    { 67865, 73, "Школа № 3" },
                    { 71237, 73, "Школа искусств 2" },
                    { 56644, 73, "Школа № 6" },
                    { 21810, 73, "Школа № 85" },
                    { 115904, 73, "Школа искусств № 16" },
                    { 252483, 73, "Лицей № 17" },
                    { 102979, 73, "Гимназия № 60" },
                    { 169212, 73, "Школа № 60" },
                    { 131968, 73, "Школа-интернат № 59" },
                    { 71817, 73, "Школа № 58" },
                    { 138989, 73, "Профессионально-техническое училище № 57" },
                    { 163549, 73, "Школа № 57" },
                    { 170054, 73, "Лицей № 56" },
                    { 64822, 73, "Школа № 56" },
                    { 225579, 73, "Техникум транспорта и сервиса (бывш. Профессиональный лицей № 56)" },
                    { 26022, 73, "Школа № 55" },
                    { 43836, 73, "Школа № 61" },
                    { 280396, 73, "Сварочных технологий и энергетики (бывш. ПЛ № 54, ПУ № 1)" },
                    { 78853, 73, "Школа № 53" },
                    { 258310, 73, "Школа-интернат № 52" },
                    { 238508, 73, "Профессионально-техническое училище № 52" },
                    { 175114, 73, "Профессиональный лицей № 52" },
                    { 1340, 73, "Школа № 52" },
                    { 12377, 73, "Школа № 51" },
                    { 1627981, 73, "Профессиональное училище № 50" },
                    { 56827, 73, "Школа № 50" },
                    { 5112, 73, "Школа № 49" },
                    { 1703522, 73, "Детский сад № 48" },
                    { 21405, 73, "Школа № 54" },
                    { 37869, 73, "Школа № 62" },
                    { 173073, 73, "Школа № 63" },
                    { 56064, 73, "Школа № 64" },
                    { 52374, 73, "Школа № 83" },
                    { 469, 73, "Школа № 82" },
                    { 1051918, 73, "Профессиональное училище № 81" },
                    { 110365, 73, "Музыкальная школа № 81" },
                    { 18911, 73, "Школа № 81" },
                    { 11490, 73, "Школа № 80" },
                    { 57607, 73, "Школа № 79" },
                    { 60987, 73, "Школа № 78" },
                    { 37481, 73, "Лицей № 77" },
                    { 90053, 73, "Школа № 77" },
                    { 22386, 73, "Школа № 76" },
                    { 6901, 73, "Школа № 75" },
                    { 21138, 73, "Школа № 74" },
                    { 40659, 73, "Школа № 73" },
                    { 1055, 73, "Школа № 72" },
                    { 40805, 73, "Школа № 71" },
                    { 335437, 73, "Профессионально-техническое училище № 70" },
                    { 47178, 73, "Школа № 70" },
                    { 857, 73, "Школа № 69" },
                    { 21406, 73, "Школа № 68" },
                    { 6201, 73, "Школа № 67" },
                    { 46877, 73, "Школа № 66" },
                    { 78754, 73, "Школа № 65" },
                    { 27807, 73, "Школа № 48" },
                    { 41395, 73, "Школа № 17" },
                    { 47524, 73, "Школа № 47" },
                    { 22011, 73, "Школа № 45" },
                    { 206656, 73, "Лицей № 28" },
                    { 200837, 73, "Школа № 28" },
                    { 344048, 73, "Школа искусств № 27" },
                    { 105023, 73, "Школа № 27" },
                    { 256305, 73, "Профессионально-техническое училище № 26" },
                    { 190122, 73, "Школа № 26" },
                    { 250945, 73, "Лицей № 25" },
                    { 127110, 73, "Гимназия № 25" },
                    { 115670, 73, "Школа № 25" },
                    { 319590, 73, "Профессиональное училище № 24" },
                    { 17897, 73, "Школа № 29" },
                    { 20699, 73, "Школа № 24" },
                    { 39954, 73, "Школа № 22" },
                    { 140302, 73, "Профессионально-техническое училище № 21" },
                    { 13743, 73, "Школа № 21" },
                    { 115953, 73, "Профессиональное училище № 20" },
                    { 6217, 73, "Школа № 20" },
                    { 198791, 73, "Красноярский многопрофильный техникум им. В. П. Астафьева (бывш. ПУ № 19 им. Астафьева)" },
                    { 27830, 73, "Школа № 19" },
                    { 248325, 73, "Профессиональный лицей № 18" },
                    { 107467, 73, "Сибирский коммерческий лицей № 18 (СКЛ)" },
                    { 22104, 73, "Школа № 18" },
                    { 36458, 73, "Школа № 23" },
                    { 61396, 73, "Школа № 30" },
                    { 95481, 73, "Школа № 31" },
                    { 287001, 73, "Профессиональный лицей № 31 (до 2009 г.)" },
                    { 1341, 73, "Школа № 44" },
                    { 1341723, 73, "Профессиональный лицей № 43" },
                    { 354860, 73, "Гимназия № 43" },
                    { 83530, 73, "Школа № 43" },
                    { 13393, 73, "Школа № 42" },
                    { 324583, 73, "Профессиональный лицей № 41" },
                    { 203276, 73, "Лицей № 41" },
                    { 848, 73, "Школа № 41" },
                    { 13099, 73, "Школа № 40" },
                    { 145675, 73, "Международная детская школа (Children's International School)" },
                    { 36138, 73, "Школа № 39" },
                    { 62044, 73, "Школа № 38" },
                    { 219342, 73, "Школа-интернат № 37" },
                    { 210300, 73, "Школа № 37" },
                    { 1612689, 73, "Профессиональное училище № 36" },
                    { 76927, 73, "Школа № 36" },
                    { 282239, 73, "Лицей № 35" },
                    { 34063, 73, "Школа № 35" },
                    { 39499, 73, "Школа № 34" },
                    { 861340, 73, "Профессиональное училище № 33" },
                    { 26180, 73, "Гимназия № 33" },
                    { 247954, 73, "Школа № 33" },
                    { 10045, 73, "Школа № 32" },
                    { 11507, 73, "Школа № 46" },
                    { 98908, 73, "Юридический техникум (КЮТ)" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16318);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20269);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20297);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42318);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53797);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79719);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90053);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163549);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165155);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173498);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190122);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190213);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221761);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232108);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244047);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318797);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 319590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 323874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 327948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 340264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 345161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 345979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 347621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 349950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 354860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 357475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 359394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 389977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 403543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 429306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 517333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 526419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 565776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 758179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 801502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 812943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 822229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 861340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1051918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1295115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1305317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1341723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1454572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1507972);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1612689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1627981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1630008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1658756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1676037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1700079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1703522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723103);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1730968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1747270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781791);
        }
    }
}
