using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class NovgorodSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 1751878, 95, "Школа-интернат №1" },
                    { 263355, 95, "Школа №290" },
                    { 107734, 95, "Школа №289" },
                    { 146289, 95, "Школа №281" },
                    { 202900, 95, "Школа №278" },
                    { 252148, 95, "Школа №272" },
                    { 246787, 95, "Школа №269" },
                    { 217500, 95, "Школа №266" },
                    { 236104, 95, "Гимназия №256" },
                    { 58066, 95, "Школа №244" },
                    { 241638, 95, "Школа №242" },
                    { 190730, 95, "Лицей №238" },
                    { 200462, 95, "Школа №233" },
                    { 54079, 95, "Школа №232" },
                    { 198268, 95, "Школа №230" },
                    { 228835, 95, "Школа №228" },
                    { 226171, 95, "Школа №222" },
                    { 280574, 95, "Школа №212" },
                    { 242001, 95, "Школа №207" },
                    { 310766, 95, "Школа №206" },
                    { 165928, 95, "Школа №204" },
                    { 153500, 95, "Школа №196" },
                    { 8777, 95, "Школа №190" },
                    { 41756, 95, "Школа №188" },
                    { 124436, 95, "Школа №187" },
                    { 5828, 95, "Школа №186 «Авторская академическая школа» (НААШ)" },
                    { 19795, 95, "Школа №185" },
                    { 21244, 95, "Гимназия №184 (бывш. шк. 184)" },
                    { 252491, 95, "Школа №293" },
                    { 249540, 95, "Школа №300" },
                    { 267765, 95, "Школа №301" },
                    { 213383, 95, "Школа №307" },
                    { 1766856, 95, "Автошкола «АвтоАкадемия»" },
                    { 1522453, 95, "Автошкола «Авто-Профи»" },
                    { 233160, 95, "Автотранспортный техникум (НАТТ)" },
                    { 80160, 95, "Автомеханический техникум (НАМТ)" },
                    { 281677, 95, "Авиационный технический колледж (НАТК)" },
                    { 179104, 95, "Авиационный техникум им. Баранова" },
                    { 1106638, 95, "Детский сад №452 «Родничок»" },
                    { 67171, 95, "Школа №421" },
                    { 212636, 95, "Школа №411" },
                    { 198030, 95, "Школа №403" },
                    { 278254, 95, "Школа №396" },
                    { 225040, 95, "Школа №393" },
                    { 230783, 95, "Школа №374" },
                    { 3955, 95, "Школа №183" },
                    { 218640, 95, "Школа №369" },
                    { 64721, 95, "Гимназия №356" },
                    { 105813, 95, "Школа №353" },
                    { 294342, 95, "Школа №352" },
                    { 218332, 95, "Школа №349" },
                    { 213771, 95, "Школа №335" },
                    { 214662, 95, "Школа №332" },
                    { 312117, 95, "Школа №330" },
                    { 218308, 95, "Школа №329" },
                    { 124764, 95, "Школа №325" },
                    { 73397, 95, "Школа №324" },
                    { 207305, 95, "Школа №319" },
                    { 263548, 95, "Школа №313" },
                    { 114502, 95, "Школа №312" },
                    { 239852, 95, "Школа №368" },
                    { 210697, 95, "Школа №182" },
                    { 14257, 95, "Школа №181" },
                    { 296261, 95, "Лицей №180 (бывш. шк. 180)" },
                    { 64854, 95, "Школа №144" },
                    { 15098, 95, "Школа №143" },
                    { 231858, 95, "Школа №142" },
                    { 28510, 95, "Школа №141" },
                    { 38314, 95, "Школа №140" },
                    { 8505, 95, "Школа №139" },
                    { 98649, 95, "Школа №138" },
                    { 63410, 95, "Школа №137" },
                    { 44252, 95, "Гимназия №136" },
                    { 85361, 95, "Детско-юношеская спортивная школа №135" },
                    { 14068, 95, "Школа №135" },
                    { 188654, 95, "Школа №134" },
                    { 22348, 95, "Школа №133" },
                    { 80586, 95, "Школа №145" },
                    { 15636, 95, "Школа №130" },
                    { 35188, 95, "Школа №128" },
                    { 239860, 95, "Школа искусств №127" },
                    { 15287, 95, "Школа №127" },
                    { 121050, 95, "Школа №126" },
                    { 7508, 95, "Школа №125" },
                    { 30145, 95, "Школа №124" },
                    { 33992, 95, "Школа №123" },
                    { 37224, 95, "Школа №122" },
                    { 13127, 95, "Школа №121" },
                    { 268683, 95, "Школа искусств №120" },
                    { 13051, 95, "Школа №120" },
                    { 14947, 95, "Школа №119" },
                    { 86094, 95, "Школа №118" },
                    { 6585, 95, "Школа №129" },
                    { 286633, 95, "Автошкола «Автомагистраль-НН»" },
                    { 93825, 95, "Школа №146" },
                    { 31423, 95, "Школа №149" },
                    { 65443, 95, "Школа №179" },
                    { 176144, 95, "Школа №178" },
                    { 43126, 95, "Школа №177" },
                    { 88157, 95, "Музыкальная школа №176" },
                    { 175454, 95, "Школа №176" },
                    { 39910, 95, "Школа №175" },
                    { 105283, 95, "Школа №174" },
                    { 14942, 95, "Школа №173" },
                    { 156013, 95, "Школа №172" },
                    { 179809, 95, "Школа №171" },
                    { 253442, 95, "Школа №170" },
                    { 134019, 95, "Школа №169" },
                    { 31860, 95, "Школа №168" },
                    { 219233, 95, "Школа №148" },
                    { 56079, 95, "Школа №167" },
                    { 195162, 95, "Лицей №165" },
                    { 164069, 95, "Школа №164" },
                    { 1733671, 95, "Школа-интернат №162" },
                    { 48716, 95, "Школа №161" },
                    { 20039, 95, "Школа №160" },
                    { 171370, 95, "Школа №157" },
                    { 22887, 95, "Школа №156" },
                    { 123413, 95, "Школа №155" },
                    { 19449, 95, "Школа №154" },
                    { 70501, 95, "Школа №153" },
                    { 8903, 95, "Лицей №151" },
                    { 1633407, 95, "Школа №151" },
                    { 55410, 95, "Школа №150" },
                    { 131976, 95, "Школа №166" },
                    { 143927, 95, "Автошкола «Автомастер»" },
                    { 180627, 95, "Автошкола «Автопилот»" },
                    { 149919, 95, "Автошкола «Вираж»" },
                    { 1626652, 95, "Факультет среднего профессионального образования (колледж) НКИ" },
                    { 97581, 95, "Факультет довузовской подготовки при ННГУ им. Лобачевского" },
                    { 189767, 95, "Учебно-курсовой комбинат «Возрождение»" },
                    { 1775088, 95, "Учебно-кадровый центр «Бизнес-Образование»" },
                    { 136736, 95, "Торговый техникум (НТТ)" },
                    { 621271, 95, "Технологический техникум" },
                    { 113493, 95, "Технический колледж (НТК)" },
                    { 228345, 95, "Техникум советской торговли" },
                    { 145328, 95, "Техникум пищевой промышленности (НТПП)" },
                    { 67657, 95, "Техникум бытового обслуживания (НТБО)" },
                    { 59985, 95, "Театральное училище им. Евстигнеева" },
                    { 1780601, 95, "Ступени образования" },
                    { 159793, 95, "Студия развития способностей «Петушок»" },
                    { 220536, 95, "Фармацевтическое училище" },
                    { 145079, 95, "Строительный техникум (НСТ)" },
                    { 79730, 95, "Специализированная детско-юношеская школа олимпийского резерва по конному спорту" },
                    { 287691, 95, "Специализированная детско-юношеская школа олимпийского резерва по академической гребле" },
                    { 109344, 95, "Специализированная детско-юношеская школа олимпийского резерва «Дельфин»" },
                    { 1660236, 95, "Сормовский механический техникум им. П. А. Семенова" },
                    { 1704079, 95, "Сормовская православная гимназия" },
                    { 1675511, 95, "Санаторно-лесная школа" },
                    { 87797, 95, "Речное училище им. И. П. Кулибина (НРУ, НКРУ, ГКРУ)" },
                    { 180058, 95, "Республиканский заочный автотранспортный колледж (РЗАТТ)" },
                    { 99904, 95, "Радиоэлектротехнический колледж (НРЭТК)" },
                    { 248551, 95, "Промышленно-экономический колледж (НПЭК)" },
                    { 139608, 95, "Политехнический колледж" },
                    { 156811, 95, "Первая национальная школа телевидения" },
                    { 276780, 95, "Педагогический колледж им. К. Д. Ушинского (НПК)" },
                    { 193249, 95, "Специализированная детско-юношеская школа олимпийского резерва по фехтованию" },
                    { 99727, 95, "Педагогическая гимназия  (НГПГ)" },
                    { 174845, 95, "Финансовый колледж при ННГУ им. Лобачевского" },
                    { 231781, 95, "Хореографический ансамбль «Калинка»" },
                    { 139043, 95, "Юридический колледж при ННГУ им. Лобачевского" },
                    { 1692811, 95, "Юридический колледж (ФСПО МЮИ ННФ)" },
                    { 39219, 95, "Экономический техникум (НЭТ)" },
                    { 74946, 95, "Экономико-правовой колледж (НЭПК)" },
                    { 75072, 95, "Школа-интернат спортивного профиля" },
                    { 1025190, 95, "Школа-интернат им. Островского" },
                    { 189201, 95, "Школа языков «Language Peak»" },
                    { 120692, 95, "Школа при НА МВД РФ" },
                    { 507854, 95, "Школа п. Селекция" },
                    { 1775796, 95, "Школа искусств и ремесел им. А. С. Пушкина «Изограф»" },
                    { 201882, 95, "Школа иностранных языков LADC" },
                    { 258645, 95, "Школа им. С. В. Михалкова" },
                    { 1129837, 95, "Школа им. А.П. Гайдара" },
                    { 163779, 95, "Хореографическая студия «Щелкунчик»" },
                    { 153226, 95, "Школа английского языка «English First»" },
                    { 111883, 95, "Школа «Счастливое детство»" },
                    { 164286, 95, "Школа «Ретро»" },
                    { 270273, 95, "Школа «Радость»" },
                    { 137738, 95, "Школа «Ор Авнер»" },
                    { 201367, 95, "Школа «Foundation»" },
                    { 53974, 95, "Центр развития творчества детей и юношества Приокского района" },
                    { 203103, 95, "Центр одаренных детей (ЦОД)" },
                    { 82371, 95, "Художественное училище (НХУ)" },
                    { 187817, 95, "Хоровой колледж им. Л. К. Сивухина" },
                    { 135188, 95, "Хоровая капелла мальчиков (НХКМ)" },
                    { 212255, 95, "Хореографический ансамбль «Фантазия»" },
                    { 164274, 95, "Хореографический ансамбль «Пионерия»" },
                    { 286604, 95, "Хореографический ансамбль «Машенька»" },
                    { 162687, 95, "Школа «Эрудит»" },
                    { 114736, 95, "Гимназия №117" },
                    { 1776780, 95, "Нижегородское училище-интернат" },
                    { 1771129, 95, "Нижегородский колледж малого бизнеса" },
                    { 98201, 95, "Детско-юношеская спортивная школа «Торпедо»" },
                    { 105828, 95, "Детско-юношеская спортивная школа «Олимп»" },
                    { 228400, 95, "Детско-юношеская спортивная школа «Динамо»" },
                    { 255109, 95, "Детско-юношеская спортивная школа «Водник»" },
                    { 185230, 95, "Детский сад «Якорек»" },
                    { 280334, 95, "Детский сад «Бемби»" },
                    { 139449, 95, "Дворец пионеров им. Чкалова" },
                    { 127272, 95, "Гуманитарный колледж «Ключ»" },
                    { 103526, 95, "Гуманитарно-художественная школа им. Ломоносова" },
                    { 161408, 95, "Гнилицкая православная гимназия" },
                    { 103415, 95, "Гимназия им. А. С. Пушкина" },
                    { 53751, 95, "Воскресная церковно-приходская школа" },
                    { 219306, 95, "Военная академия" },
                    { 112405, 95, "Детско-юношеская спортивная школа СК «Локомотив»" },
                    { 1770796, 95, "Вечерняя школа «Центр образования Приокского района»" },
                    { 241652, 95, "Бизнес-колледж (НБК)" },
                    { 195396, 95, "Ансамбль современного танца «Ракета»" },
                    { 181153, 95, "Автошкола при НГТУ" },
                    { 205305, 95, "Автошкола ННГАСУ" },
                    { 1705595, 95, "Автошкола ДОСААФ" },
                    { 199179, 95, "Автошкола АНО Центр «Образование»" },
                    { 291024, 95, "Автошкола «Экспресс-авто-плюс-НН»" },
                    { 1727483, 95, "Автошкола «Центр-А»" },
                    { 249851, 95, "Автошкола «Фристайл-НН»" },
                    { 1762423, 95, "Автошкола «Форвард-НН»" },
                    { 256064, 95, "Автошкола «Такт»" },
                    { 186266, 95, "Автошкола «Станкоинформ»" },
                    { 1633752, 95, "Автошкола «Вояж НН»" },
                    { 1767392, 95, "Бизнес-школа EMAS" },
                    { 1764311, 95, "Нижегородское индустриальное училище (НИУ)" },
                    { 85637, 95, "Дом творчества детей и юношества (Дом детского творчества)" },
                    { 1662099, 95, "Железнодорожный техникум (НЖТ (ф) МИИТ, бывш. НТЖТ)" },
                    { 1779679, 95, "Нижегородский гуманитарно-технический колледж (НГТК)" },
                    { 1775229, 95, "Нижегородский Губернский колледж" },
                    { 1772698, 95, "Нижегородская православная гимназия им. преподобного Сергия Радонежского" },
                    { 120862, 95, "Нагорный дворец спорта" },
                    { 284051, 95, "Музыкальное училище (колледж) им. Балакирева" },
                    { 117551, 95, "Музыкально-хоровая школа «Жаворонок»" },
                    { 143242, 95, "Музыкальная школа при МУ им. М. Балакирева" },
                    { 169825, 95, "Музыкальная школа «Подснежник»" },
                    { 1720378, 95, "Межшкольный учебный комбинат (МОУ МУК)" },
                    { 287428, 95, "Медицинский колледж Росздрава (НМК МЗ РФ)" },
                    { 126434, 95, "Медицинский базовый колледж (НМБК)" },
                    { 132129, 95, "Машиностроительный техникум (НМТ)" },
                    { 68359, 95, "Кулинарное училище" },
                    { 167948, 95, "Епархиальное духовное училище (НЕДУ)" },
                    { 140946, 95, "Колледж экономики, статистики и права (НКЭСП, НТЭСИ Госкомтата РФ)" },
                    { 201990, 95, "Колледж теплоснабжения и автоматических систем управления (НКТАСУ)" },
                    { 1737675, 95, "Колледж СПО ННГУ им. Лобачевского" },
                    { 134545, 95, "Колледж НГЛУ им. Н. А. Добролюбова" },
                    { 253423, 95, "Колледж культуры (НОКК)" },
                    { 163599, 95, "Колледж искусств (НКИ)" },
                    { 72051, 95, "Колледж ВВАГС ФСПОиДП" },
                    { 161439, 95, "Колледж бытового сервиса (НКБС)" },
                    { 1662771, 95, "Колледж безопасности (ВВКБ)" },
                    { 237948, 95, "Классическая философская школа" },
                    { 514953, 95, "Кадетский корпус ВДВ" },
                    { 1762357, 95, "Институт повышения квалификации «Эксперт»" },
                    { 203082, 95, "Индустриальный колледж (НИК)" },
                    { 57180, 95, "Индустриально-коммерческий техникум (НИКТ)" },
                    { 155385, 95, "Колледж технологии и дизайна одежды (НКТДО)" },
                    { 91111, 95, "Школа №117" },
                    { 116955, 95, "Школа №116" },
                    { 273392, 95, "Школа №115" },
                    { 136044, 95, "Музыкальная школа №15" },
                    { 1870, 95, "Школа №15" },
                    { 119546, 95, "Музыкальная школа №14" },
                    { 313257, 95, "Гимназия №14" },
                    { 200914, 95, "Школа №14" },
                    { 74497, 95, "Специализированная детско-юношеская школа олимпийского резерва №13" },
                    { 136199, 95, "Музыкальная школа №13" },
                    { 189095, 95, "Гимназия №13" },
                    { 267456, 95, "Школа №13" },
                    { 181832, 95, "Специализированная детско-юношеская школа олимпийского резерва №12 по спортивному ориентированию" },
                    { 30805, 95, "Музыкальная школа №12" },
                    { 18297, 95, "Школа №12" },
                    { 211598, 95, "Техникум транспорта и информационных технологий (филиал ЧТТИТ, бывш. ПЛ 11)" },
                    { 267859, 95, "Школа искусств №15" },
                    { 117357, 95, "Музыкальная школа №11 им. Мокроусова" },
                    { 3184, 95, "Школа №11" },
                    { 137707, 95, "Детско-юношеская спортивная школа №10" },
                    { 56394, 95, "Музыкальная школа №10" },
                    { 206432, 95, "Школа-интернат №10" },
                    { 143289, 95, "Школа №10" },
                    { 207327, 95, "Школа искусств №9" },
                    { 123781, 95, "Музыкальная школа №9" },
                    { 208952, 95, "Школа-интернат №9" },
                    { 93519, 95, "Лицей №9" },
                    { 31875, 95, "Школа №9" },
                    { 314660, 95, "Специализированная детско-юношеская школа олимпийского резерва №8" },
                    { 13994, 95, "Музыкальная школа №8" },
                    { 172, 95, "Лицей №8" },
                    { 173366, 95, "Лицей №11" },
                    { 212513, 95, "Школа №8" },
                    { 269380, 95, "Профессиональное училище №15" },
                    { 137578, 95, "Музыкальная школа №16" },
                    { 185413, 95, "Школа №28" },
                    { 19851, 95, "Школа №27" },
                    { 208548, 95, "Профессионально-техническое училище №26" },
                    { 28518, 95, "Школа №26" },
                    { 186900, 95, "Профессиональное училище №25" },
                    { 12307, 95, "Гимназия №25" },
                    { 190800, 95, "Школа №25" },
                    { 19837, 95, "Школа №24" },
                    { 63497, 95, "Вечерняя школа №23" },
                    { 36734, 95, "Школа №23" },
                    { 9449, 95, "Школа №22" },
                    { 214114, 95, "Профессионально-техническое училище №21" },
                    { 161678, 95, "Радиотехнический колледж (НРТК, бывш. Техникум электроники и связи, ПЛ 21)" },
                    { 57314, 95, "Школа №16" },
                    { 6417, 95, "Школа №21" },
                    { 205898, 95, "Школа №20" },
                    { 103017, 95, "Специализированная детско-юношеская школа олимпийского резерва №19" },
                    { 176354, 95, "Детско-юношеская спортивная школа №19" },
                    { 18131, 95, "Школа №19" },
                    { 259268, 95, "Профессиональное училище №18" },
                    { 119175, 95, "Школа искусств №18" },
                    { 133791, 95, "Профессионально-техническое училище №18" },
                    { 15311, 95, "Художественная школа №18" },
                    { 236841, 95, "Музыкальная школа №18" },
                    { 127117, 95, "Вечерняя школа №18" },
                    { 13727, 95, "Школа №18" },
                    { 52179, 95, "Музыкальная школа №17" },
                    { 247945, 95, "Гимназия №17" },
                    { 246899, 95, "Профессиональное училище №20" },
                    { 21026, 95, "Лицей №28" },
                    { 221216, 95, "Профессиональное училище №7" },
                    { 110757, 95, "Художественная школа №7" },
                    { 218893, 95, "Музыкальная школа №3" },
                    { 138045, 95, "Школа-интернат спортивного профиля №3" },
                    { 256019, 95, "Школа-интернат №3 МКК" },
                    { 228504, 95, "Лицей №3" },
                    { 218, 95, "Гимназия №3" },
                    { 62225, 95, "Школа №3" },
                    { 1761025, 95, "Специализированная детско-юношеская спортивная школа олимпийского резерва №3 по шахматам" },
                    { 93083, 95, "Автошкола РОСТО №2" },
                    { 174065, 95, "Училище олимпийского резерва №2 (УОР)" },
                    { 102035, 95, "Медицинское училище №2 (НМУ)" },
                    { 98737, 95, "Художественная школа №2" },
                    { 105822, 95, "Детско-юношеская спортивная школа №2" },
                    { 64722, 95, "Музыкальная школа №2" },
                    { 62201, 95, "Художественная школа №3" },
                    { 124400, 95, "Школа-интернат №2" },
                    { 240379, 95, "Школа №2" },
                    { 77112, 95, "Автошкола РОСТО №1" },
                    { 62294, 95, "Школа искусств №1" },
                    { 196832, 95, "Училище олимпийского резерва №1 (УОР)" },
                    { 274985, 95, "Профессиональный лицей №1" },
                    { 285031, 95, "Художественная школа №1" },
                    { 179311, 95, "Специализированная детско-юношеская школа олимпийского резерва №1" },
                    { 13237, 95, "Детско-юношеская спортивная школа №1" },
                    { 98811, 95, "Музыкальная школа №1" },
                    { 139060, 95, "Лицей №1" },
                    { 2300, 95, "Гимназия №1" },
                    { 102927, 95, "Школа №1" },
                    { 198562, 95, "Медицинское училище №1 (НМУ)" },
                    { 279156, 95, "Гимназия №2" },
                    { 122363, 95, "Школа искусств №7" },
                    { 808036, 95, "Техникум городского хозяйства и предпринимательства (НТГХиП, бывш. ПЛ 3)" },
                    { 41805, 95, "Школа №4" },
                    { 275422, 95, "Детско-юношеская спортивная школа №7" },
                    { 62791, 95, "Специализированная детско-юношеская школа олимпийского резерва №7" },
                    { 146394, 95, "Музыкальная школа №7" },
                    { 283291, 95, "Школа-интернат №7" },
                    { 184159, 95, "Лицей №7" },
                    { 200928, 95, "Гимназия №7" },
                    { 209013, 95, "Школа №7" },
                    { 154729, 95, "Нижегородский промышленно-технологический техникум (бывш. Дизелестроительный техникум и ПУ 6)" },
                    { 131240, 95, "Профессиональный лицей №6" },
                    { 37225, 95, "Музыкальная школа №6" },
                    { 1612672, 95, "Школа-интернат №6" },
                    { 86305, 95, "Лицей №6" },
                    { 220, 95, "Гимназия №6" },
                    { 81212, 95, "Медицинское училище №3 (НМУ)" },
                    { 172468, 95, "Школа №6" },
                    { 1633399, 95, "Специализированная детско-юношеская школа олимпийского резерва №5" },
                    { 260368, 95, "Музыкальная школа №5" },
                    { 107238, 95, "Школа-интернат №5" },
                    { 219, 95, "Гимназия №5" },
                    { 58773, 95, "Школа №5" },
                    { 284179, 95, "Детский сад №4" },
                    { 195712, 95, "Профессионально-техническое училище №4" },
                    { 157453, 95, "Специализированная детско-юношеская школа олимпийского резерва №4 по волейболу" },
                    { 73692, 95, "Музыкальная школа №4" },
                    { 116801, 95, "Вечерняя (сменная) школа №4" },
                    { 57663, 95, "Школа-интернат №4" },
                    { 262303, 95, "Гимназия №4" },
                    { 106240, 95, "Школа №4 Нижегородский кадетский корпус" },
                    { 178654, 95, "Профессиональный лицей №5" },
                    { 203284, 95, "Юридический колледж РАП" },
                    { 201229, 95, "Профессионально-техническое училище №28" },
                    { 316448, 95, "Школа искусств №29" },
                    { 133306, 95, "Школа №84" },
                    { 58832, 95, "Школа №83" },
                    { 212666, 95, "Профессиональное училище №82" },
                    { 3424, 95, "Лицей №82" },
                    { 288128, 95, "Школа №82" },
                    { 271288, 95, "Лицей №81" },
                    { 39163, 95, "Школа №81" },
                    { 222870, 95, "Профессиональное училище №80" },
                    { 126614, 95, "Гимназия №80" },
                    { 1722620, 95, "Профессионально-техническое училище №79" },
                    { 40008, 95, "Школа №79" },
                    { 274819, 95, "Профессиональное училище №78" },
                    { 188375, 95, "Профессионально-техническое училище №78" },
                    { 15260, 95, "Школа №85" },
                    { 69923, 95, "Лицей №78" },
                    { 195090, 95, "Школа №77" },
                    { 74618, 95, "Школа №76" },
                    { 31071, 95, "Школа №75" },
                    { 50149, 95, "Школа №74" },
                    { 33057, 95, "Школа №73" },
                    { 239847, 95, "Лицей №72" },
                    { 3099, 95, "Школа №72" },
                    { 165537, 95, "Школа №71" },
                    { 120848, 95, "Техникум транспортного обслуживания и сервиса (НТТОС, бывш. ПУ 70)" },
                    { 19200, 95, "Школа №70" },
                    { 38050, 95, "Школа №69" },
                    { 57225, 95, "Школа №68" },
                    { 264320, 95, "Детский сад №67" },
                    { 55306, 95, "Школа №78" },
                    { 88063, 95, "Гимназия №67 (лингвистическая, НЛГ)" },
                    { 240233, 95, "Профессиональное училище №85" },
                    { 86169, 95, "Гимназия №87 (техническая, НТГ)" },
                    { 173243, 95, "Школа №114" },
                    { 195737, 95, "Школа №113" },
                    { 209590, 95, "Школа №112" },
                    { 18056, 95, "Школа №111" },
                    { 4444, 95, "Школа №110" },
                    { 85015, 95, "Школа №109" },
                    { 168886, 95, "Школа №108" },
                    { 26170, 95, "Школа №107" },
                    { 89918, 95, "Школа №106" },
                    { 36846, 95, "Школа №105" },
                    { 130413, 95, "Профессиональное училище №104" },
                    { 124479, 95, "Школа №103" },
                    { 177533, 95, "Школа №102" },
                    { 225418, 95, "Школа №86" },
                    { 35327, 95, "Школа №101" },
                    { 90666, 95, "Школа №99" },
                    { 54589, 95, "Школа №98" },
                    { 194580, 95, "Школа №97" },
                    { 3711, 95, "Школа №96" },
                    { 204225, 95, "Лицей №95" },
                    { 60375, 95, "Школа №94" },
                    { 43681, 95, "Школа №93" },
                    { 281572, 95, "Школа №92" },
                    { 195202, 95, "Школа №91" },
                    { 48539, 95, "Школа №90" },
                    { 57588, 95, "Школа №88" },
                    { 49637, 95, "Музыкальная школа №87" },
                    { 6591, 95, "Лицей №87" },
                    { 5488, 95, "Школа №100" },
                    { 18815, 95, "Школа №29" },
                    { 8761, 95, "Школа №67" },
                    { 147207, 95, "Школа-интернат №65" },
                    { 3362, 95, "Школа №43" },
                    { 11083, 95, "Школа №42" },
                    { 110473, 95, "Техникум отраслевых технологий (НТОТ, бывш. ПЛ 41)" },
                    { 197097, 95, "Лицей №41" },
                    { 26937, 95, "Школа №41" },
                    { 269718, 95, "Школа искусств №40" },
                    { 1066525, 95, "Профессионально-техническое училище №40" },
                    { 1894, 95, "Лицей №40" },
                    { 196625, 95, "Школа №40" },
                    { 1087274, 95, "Профессиональное училище №39" },
                    { 123119, 95, "Школа №39" },
                    { 242971, 95, "Профессиональное училище №38" },
                    { 287403, 95, "Школа искусств №38" },
                    { 190846, 95, "Школа №44" },
                    { 199002, 95, "Профессионально-техническое училище №38" },
                    { 198572, 95, "Школа №38" },
                    { 14846, 95, "Школа №37" },
                    { 23582, 95, "Лицей №36" },
                    { 207151, 95, "Школа №36" },
                    { 743715, 95, "Детский сад №35 «Радуга»" },
                    { 3021, 95, "Школа №35" },
                    { 160276, 95, "Школа №34" },
                    { 11511, 95, "Школа №33" },
                    { 233841, 95, "Вечерняя школа №32" },
                    { 190182, 95, "Школа №32" },
                    { 55762, 95, "Школа №31" },
                    { 155013, 95, "Вечерняя школа №30" },
                    { 17377, 95, "Школа №30" },
                    { 150894, 95, "Лицей №38 (Нижегородский технический, НТЛ)" },
                    { 1988, 95, "Школа №66" },
                    { 8325, 95, "Школа №45" },
                    { 173232, 95, "Школа №47" },
                    { 221125, 95, "Школа №65" },
                    { 42328, 95, "Школа №64" },
                    { 71241, 95, "Коммерческий колледж №63" },
                    { 22347, 95, "Школа №63" },
                    { 16607, 95, "Школа №62" },
                    { 225477, 95, "Профессионально-техническое училище №61" },
                    { 116798, 95, "Школа №61" },
                    { 113744, 95, "Профессиональный лицей №60" },
                    { 98149, 95, "Лицей №60" },
                    { 14303, 95, "Школа №60" },
                    { 40347, 95, "Школа №59" },
                    { 1728, 95, "Школа №58" },
                    { 280915, 95, "Школа №57" },
                    { 9283, 95, "Школа №46" },
                    { 57587, 95, "Школа №56" },
                    { 37100, 95, "Школа №55" },
                    { 140863, 95, "Профессиональное училище №54" },
                    { 23329, 95, "Школа №54" },
                    { 35400, 95, "Гимназия №53" },
                    { 49496, 95, "Школа №52" },
                    { 27492, 95, "Школа №51" },
                    { 221194, 95, "Профессиональное училище №50" },
                    { 3712, 95, "Гимназия №50" },
                    { 288823, 95, "Школа №50" },
                    { 213015, 95, "Профессионально-техническое училище №49" },
                    { 10926, 95, "Школа №49" },
                    { 65341, 95, "Музыкальная школа №48" },
                    { 17085, 95, "Школа №48" },
                    { 188510, 95, "Профессионально-техническое училище №55" },
                    { 1717119, 95, "Языковая школа «Speaking Planet»" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1988);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8761);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14068);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18297);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55762);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67657);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85361);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87797);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116801);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139043);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164069);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177533);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178654);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180058);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188654);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189767);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203103);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208952);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225040);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255109);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267765);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 271288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278254);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287691);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 296261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 310766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 507854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 514953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 621271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 808036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1025190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1066525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1087274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1106638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1129837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1522453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1612672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1626652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1633399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1633407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1633752);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1692811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1704079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1727483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1737675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780601);
        }
    }
}
