using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class PopulateSchoolsUfa : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 202150, 151, "Школа № 1" },
                    { 53296, 151, "Гимназия № 144" },
                    { 293742, 151, "Школа № 143" },
                    { 68533, 151, "Школа № 142" },
                    { 9576, 151, "Школа № 141" },
                    { 16643, 151, "Гимназия № 140" },
                    { 40673, 151, "Школа № 139" },
                    { 84115, 151, "Школа № 138" },
                    { 30828, 151, "Профессиональный лицей № 137" },
                    { 211162, 151, "Школа № 137" },
                    { 8962, 151, "Башкирский лицей № 136" },
                    { 350676, 151, "Колледж индустрии питания и сервиса (УКИПиС, бывш. Профессиональный лицей № 136)" },
                    { 34732, 151, "Школа № 135" },
                    { 52390, 151, "Школа № 134" },
                    { 149377, 151, "Детский сад № 133" },
                    { 52236, 151, "Школа № 133" },
                    { 47997, 151, "Школа № 132" },
                    { 17153, 151, "Школа № 131" },
                    { 21809, 151, "Школа № 130" },
                    { 133202, 151, "Профессиональный лицей № 129" },
                    { 286849, 151, "Музыкальная школа № 129" },
                    { 219415, 151, "Школа № 129" },
                    { 15048, 151, "Школа № 128" },
                    { 31888, 151, "Школа № 127" },
                    { 263057, 151, "Школа № 145" },
                    { 333094, 151, "Детский сад № 126" },
                    { 231398, 151, "Профессиональный лицей № 145" },
                    { 103334, 151, "Школа № 147" },
                    { 791968, 151, "Детский сад № 212" },
                    { 98467, 151, "Гимназия № 205" },
                    { 1556239, 151, "Детский сад № 195" },
                    { 262183, 151, "Детский сад № 185" },
                    { 1619000, 151, "Детский сад № 178 «Солнышко»" },
                    { 224283, 151, "Гимназия № 177" },
                    { 293578, 151, "Детский сад № 172" },
                    { 925793, 151, "Детский сад № 170" },
                    { 77024, 151, "Вечерняя школа № 167" },
                    { 1773133, 151, "Лицей № 161" },
                    { 1774107, 151, "Лицей № 160" },
                    { 1659538, 151, "Школа № 159" },
                    { 172863, 151, "Гимназия № 158 им. М. Карима" },
                    { 129934, 151, "Школа № 157" },
                    { 349158, 151, "Школа № 156" },
                    { 70423, 151, "Художественно-гуманитарный колледж (бывш. ПЛ № 155)" },
                    { 229632, 151, "Лицей № 155" },
                    { 11491, 151, "Школа № 155" },
                    { 77637, 151, "Школа № 154" },
                    { 87276, 151, "Лицей № 153" },
                    { 269781, 151, "Профессиональное училище № 152" },
                    { 132759, 151, "Вечерняя школа № 152" },
                    { 264973, 151, "Гимназия № 148" },
                    { 197695, 151, "Школа № 146" },
                    { 260206, 151, "Детский сад № 216" },
                    { 2487, 151, "Школа № 126" },
                    { 220178, 151, "Школа № 125" },
                    { 162744, 151, "Школа № 103" },
                    { 11557, 151, "Гимназия № 102" },
                    { 17839, 151, "Школа № 101" },
                    { 216720, 151, "Школа № 100" },
                    { 20959, 151, "Школа № 99" },
                    { 104538, 151, "Лицей № 98" },
                    { 27333, 151, "Школа № 98" },
                    { 181175, 151, "Школа № 97" },
                    { 14402, 151, "Лицей № 96" },
                    { 140201, 151, "Школа № 96" },
                    { 348300, 151, "Школа № 95" },
                    { 1061, 151, "Лицей № 94" },
                    { 3316, 151, "Физико-математический лицей № 93 (бывш. гимназия)" },
                    { 355095, 151, "Детский сад № 92" },
                    { 2895, 151, "Гимназия № 91" },
                    { 205931, 151, "Школа № 90" },
                    { 17539, 151, "Школа № 89" },
                    { 14542, 151, "Школа № 88" },
                    { 18574, 151, "Школа № 87" },
                    { 7952, 151, "Гимназия № 86" },
                    { 188613, 151, "Школа № 86" },
                    { 318669, 151, "Школа № 85" },
                    { 225033, 151, "Профессионально-техническое училище № 84 Башкирэнерго" },
                    { 19066, 151, "Школа № 104" },
                    { 143737, 151, "Профессионально-техническое училище № 125" },
                    { 22003, 151, "Гимназия № 105" },
                    { 6522, 151, "Школа № 107" },
                    { 54768, 151, "Школа № 124" },
                    { 192052, 151, "Музыкальная школа при лиц. 123" },
                    { 11556, 151, "Лицей № 123" },
                    { 28695, 151, "Гимназия № 122" },
                    { 195528, 151, "Гимназия № 121" },
                    { 273246, 151, "Школа № 120" },
                    { 172289, 151, "Школа № 119" },
                    { 20263, 151, "Школа № 118" },
                    { 22687, 151, "Школа № 117" },
                    { 242469, 151, "Профессионально-техническое училище № 116" },
                    { 13054, 151, "Школа № 116" },
                    { 8235, 151, "Гимназия № 115" },
                    { 170301, 151, "Школа № 115" },
                    { 229936, 151, "Школа № 114" },
                    { 86721, 151, "Школа № 113" },
                    { 43871, 151, "Школа № 112" },
                    { 20639, 151, "Гимназия № 111" },
                    { 194615, 151, "Лицей № 110" },
                    { 16635, 151, "Школа № 110" },
                    { 10299, 151, "Школа № 109" },
                    { 191468, 151, "Школа № 108" },
                    { 293568, 151, "Детский сад № 107" },
                    { 280957, 151, "Лицей № 107" },
                    { 3961, 151, "Школа № 106" },
                    { 209927, 151, "Гимназия № 84" },
                    { 454909, 151, "Детский сад № 218" },
                    { 240042, 151, "Детский сад № 236" },
                    { 145203, 151, "Техникум экономики и права (УТЭП)" },
                    { 111249, 151, "Техникум советской торговли" },
                    { 92629, 151, "Техникум механизации учета (УТМУ)" },
                    { 337895, 151, "Техникум легкой промышленности" },
                    { 231525, 151, "Техникум информатизации, экономики и права (УТИЭП)" },
                    { 130942, 151, "Техникум железнодорожного транспорта (УТЖТ)" },
                    { 341145, 151, "Техикум при УГИС" },
                    { 164945, 151, "Строительный колледж (БСК)" },
                    { 129996, 151, "Специальная музыкальная школа (ССМШ)" },
                    { 68010, 151, "Социально-экономический колледж (БСЭК)" },
                    { 221645, 151, "Социально-правовой техникум (УСПТ)" },
                    { 29415, 151, "Республиканский экономический лицей-интернат (РЭЛИ)" },
                    { 1764272, 151, "Республиканский инженерный лицей-интернат (бывш. РБЛИ и РЭЛИ)" },
                    { 159086, 151, "Республиканский башкирско-турецкий лицей (РБТЛ)" },
                    { 240065, 151, "Республиканский башкирский лицей-интернат (РБЛИ)" },
                    { 196098, 151, "Республиканская художественная гимназия-интернат (РХГИ) им. К. А. Давлеткильдеева" },
                    { 73056, 151, "Республиканская музыкальная гимназия-интернат (РМГИ) им. Г. Альмухаметова" },
                    { 158270, 151, "Профессионально-педагогический колледж (УГППК)" },
                    { 199813, 151, "Промышленно-экономический колледж (УПЭК)" },
                    { 73413, 151, "Политехнический техникум (УПТ)" },
                    { 167112, 151, "Первая политологическая гимназия" },
                    { 65306, 151, "Нефтяной техникум" },
                    { 685616, 151, "Музыкальный колледж (ССМК)" },
                    { 171295, 151, "Техникум экономики, управления и сервиса (УТЭУС)" },
                    { 144325, 151, "Музыкальная школа при УУИ" },
                    { 126738, 151, "Топливно-энергетический колледж (УТЭК)" },
                    { 1781747, 151, "Уфимская средняя специальная школа подготовки начальствующего состава МВД СССР" },
                    { 229938, 151, "Экономико-юридический колледж (БЭЮК, БЭК)" },
                    { 167111, 151, "Экономико-математическая школа-колледж" },
                    { 322592, 151, "Школа-интернат музыкальных воспитанников (ШМВ, ШИМВ)" },
                    { 1360008, 151, "Школа Ушу-Саньда" },
                    { 1661502, 151, "Школа танцев «E-Dance Studio»" },
                    { 170974, 151, "Школа высшего спортивного мастерства (ШВСМ)" },
                    { 1706457, 151, "Школа «Солнечный круг»" },
                    { 317986, 151, "Школа «Ор Авнер»" },
                    { 272083, 151, "Школа «Знание»" },
                    { 56659, 151, "Школа «Восхождение»" },
                    { 153306, 151, "Школа «Баярд»" },
                    { 123457, 151, "Школа «Альфа»" },
                    { 98780, 151, "Художественная школа при архитектурном факультете УГНТУ" },
                    { 282725, 151, "Художественная школа им. Кузнецова" },
                    { 167594, 151, "Хореографическое училище им. Нуреева (БХУ)" },
                    { 1752881, 151, "Фотошкола СПБШТ (Санкт-Петербургская школа телевидения)" },
                    { 319484, 151, "Финансово-экономический колледж (УФЭК) ФА при Правительстве РФ" },
                    { 43406, 151, "Училище искусств (УУИ)" },
                    { 1764241, 151, "Учебный центр Департамента ФГСЗН по РБ" },
                    { 165230, 151, "Учебно-курсовой комбинат (БРУКК)" },
                    { 1671456, 151, "Учебно-аттестационный центр ОАО «АК ВНЗМ»" },
                    { 1779450, 151, "Уфимский художественно-промышленный колледж (УХПК)" },
                    { 1769172, 151, "Уфимская школа по подготовке специалистов-кинологов МВД РФ" },
                    { 142452, 151, "Торгово-экономический колледж" },
                    { 240036, 151, "Детский сад № 219" },
                    { 9860, 151, "Музыкальная школа «Лейсян»" },
                    { 1757814, 151, "Машиностроительный колледж (УМК)" },
                    { 1360014, 151, "Детско-юношеская спортивная школа олимпийского резерва по горным лыжам" },
                    { 276488, 151, "Детский сад «Ромашка»" },
                    { 1757472, 151, "Детская бизнес академия" },
                    { 230225, 151, "Детская академия" },
                    { 117207, 151, "Дворец детского творчества им. Комарова (УГДДТ)" },
                    { 170252, 151, "Гуманитарный колледж" },
                    { 279823, 151, "Гимназия им. Кусимова" },
                    { 315044, 151, "Воздушно-десантный кадетский корпус (УВДКК) им. М. Гареева" },
                    { 185029, 151, "Библиотечный техникум" },
                    { 5959, 151, "Башкирско-турецкий лицей" },
                    { 1764315, 151, "Башкирский колледж архитектуры, строительства и коммунального хозяйства (БАСК)" },
                    { 58643, 151, "Арабский лицей" },
                    { 148928, 151, "Англоязычная частная школа" },
                    { 143494, 151, "Американо-Башкирский интерколледж" },
                    { 1705600, 151, "Автошкола ДОСААФ" },
                    { 173392, 151, "Автотранспортный колледж (УАТК)" },
                    { 193147, 151, "Авиационный техникум (УАТ)" },
                    { 333642, 151, "Детский сад № 320" },
                    { 1712383, 151, "Детский сад № 310" },
                    { 284466, 151, "Детский сад № 303" },
                    { 857224, 151, "Школа № 301" },
                    { 210709, 151, "Детский сад № 299 «Белоснежка»" },
                    { 1501594, 151, "Детский сад № 240" },
                    { 1669879, 151, "Детско-юношеская спортивная школа олимпийского резерва ХК «Салават Юлаев»" },
                    { 506161, 151, "Медицинский колледж (УМК)" },
                    { 205976, 151, "Индустриально-педагогический техникум (УИПТ)" },
                    { 1741122, 151, "Колледж БГПУ им. М. Акмуллы" },
                    { 53277, 151, "Лицей при УГАТУ" },
                    { 454419, 151, "Лицей при БГАУ" },
                    { 101514, 151, "Лицей «Содружество»" },
                    { 177356, 151, "Лингвистическая академия" },
                    { 242178, 151, "Лесотехнический техникум (бывш. Лесхоз-техникум)" },
                    { 343401, 151, "Кооперативный техникум (БКТ)" },
                    { 96134, 151, "Командное речное училище (УКРУ)" },
                    { 93566, 151, "Колледж технологии и дизайна одежды (УКТиДО)" },
                    { 180890, 151, "Колледж технологии и дизайна (УГКТиД)" },
                    { 219025, 151, "Колледж статистики, информатики и вычислительной техники (УКСИВТ)" },
                    { 132090, 151, "Колледж сервиса при УГАЭС" },
                    { 237031, 151, "Колледж связи (УКС)" },
                    { 195482, 151, "Колледж радиоэлектроники (УГКР)" },
                    { 129556, 151, "Колледж при УФ МГГУ (МГОПУ) им. М. А. Шолохова" },
                    { 243517, 151, "Колледж при БашГУ" },
                    { 1352002, 151, "Колледж предпринимательства, экологии и дизайна (УКПЭД)" },
                    { 70522, 151, "Колледж предпринимательства и права" },
                    { 1659062, 151, "Колледж политики, экономики, юриспруденции" },
                    { 64412, 151, "Колледж пищевой промышленности (УКПП)" },
                    { 225915, 151, "Колледж отраслевых технологий (бывш. УМТК)" },
                    { 261468, 151, "Колледж муниципального управления (БКМУ)" },
                    { 282223, 151, "Колледж моды" },
                    { 164914, 151, "Колледж библиотечного дела и массовых коммуникаций (УКБДиМК)" },
                    { 1748972, 151, "Колледж Башкирского института социальных технологий (филиал) АТиСО" },
                    { 37104, 151, "Школа № 84" },
                    { 150089, 151, "Лицей № 83 при УГНТУ" },
                    { 17267, 151, "Школа № 83" },
                    { 198133, 151, "Лицей № 12" },
                    { 60329, 151, "Школа № 12" },
                    { 82769, 151, "Детско-юношеская спортивная школа олимпийского резерва № 11" },
                    { 150455, 151, "Музыкальная школа № 11" },
                    { 218872, 151, "Гимназия № 11" },
                    { 2740, 151, "Школа № 11" },
                    { 951166, 151, "Детский сад № 10" },
                    { 217868, 151, "Профессионально-техническое училище № 10" },
                    { 344833, 151, "Профессиональный лицей № 10" },
                    { 192258, 151, "Детско-юношеская спортивная школа олимпийского резерва № 10" },
                    { 167642, 151, "Детско-юношеская спортивная школа № 10" },
                    { 7785, 151, "Музыкальная школа № 10" },
                    { 66012, 151, "Лицей № 10" },
                    { 74381, 151, "Гимназия № 10" },
                    { 13031, 151, "Школа № 10" },
                    { 205093, 151, "Детско-юношеская спортивная школа № 9" },
                    { 209354, 151, "Музыкальная школа № 9" },
                    { 202822, 151, "Школа № 9" },
                    { 344135, 151, "Детский сад № 8" },
                    { 126611, 151, "Медицинское училище № 8" },
                    { 240216, 151, "Музыкальная школа № 8" },
                    { 338981, 151, "Лицей № 8" },
                    { 25135, 151, "Школа № 8" },
                    { 133878, 151, "Музыкальная школа № 12" },
                    { 1742452, 151, "Профессионально-техническое училище № 7 (до 1996 г.)" },
                    { 291573, 151, "Детско-юношеская спортивная школа № 12" },
                    { 120717, 151, "Школа № 13" },
                    { 78428, 151, "Школа № 20" },
                    { 272602, 151, "Школа искусств № 19" },
                    { 195239, 151, "Профессионально-техническое училище № 19" },
                    { 226143, 151, "Детско-юношеская спортивная школа № 19 (по фехтованию)" },
                    { 153107, 151, "Школа № 19 им. Б. И. Северинова" },
                    { 771683, 151, "Детский сад № 18" },
                    { 133009, 151, "Детско-юношеская спортивная школа олимпийского резерва № 18" },
                    { 188902, 151, "Школа № 18" },
                    { 35822, 151, "Школа № 17" },
                    { 140704, 151, "Детско-юношеская спортивная школа олимпийского резерва № 16" },
                    { 84137, 151, "Музыкальная школа № 16 им. Ф. Камаева" },
                    { 5612, 151, "Гимназия № 16 (бывш. Школа № 16)" },
                    { 140705, 151, "Детско-юношеская спортивная школа олимпийского резерва № 15" },
                    { 48861, 151, "Музыкальная школа № 15" },
                    { 320386, 151, "Школа № 15" },
                    { 186518, 151, "Профессионально-техническое училище № 14" },
                    { 57652, 151, "Музыкальная школа № 14 (хоровая)" },
                    { 277406, 151, "Гимназия № 14" },
                    { 3625, 151, "Школа № 14" },
                    { 233688, 151, "Профессиональное училище № 13" },
                    { 1712398, 151, "Башкирский колледж сварочно-монтажного и промышленного производства (бывш. Профессиональный лицей № 13)" },
                    { 284934, 151, "Музыкальная школа № 13 им. Х. Заимова" },
                    { 56834, 151, "Школа-интернат № 13" },
                    { 267744, 151, "Профессиональное училище № 12" },
                    { 170943, 151, "Гимназия № 20 им. Ф. Х. Мустафиной" },
                    { 48854, 151, "Музыкальная школа № 7" },
                    { 887709, 151, "Детский сад № 6" },
                    { 188251, 151, "Школа искусств № 2" },
                    { 66013, 151, "Профессионально-техническое училище № 2" },
                    { 80856, 151, "Педагогический колледж № 2" },
                    { 26099, 151, "Художественная школа № 2" },
                    { 210446, 151, "Детско-юношеская спортивная школа № 2" },
                    { 161885, 151, "Детско-юношеская спортивная школа олимпийского резерва № 2" },
                    { 68310, 151, "Музыкальная школа № 2" },
                    { 285420, 151, "Школа-интернат № 2" },
                    { 10399, 151, "Лицей № 2" },
                    { 125892, 151, "Башкирская республиканская гимназия-интернат (БРГИ) 2" },
                    { 222882, 151, "Гимназия № 2" },
                    { 78990, 151, "Школа № 2" },
                    { 380736, 151, "Детский сад № 1" },
                    { 247153, 151, "Школа искусств № 1" },
                    { 282127, 151, "Техникум № 1" },
                    { 162587, 151, "Профессиональный лицей № 1" },
                    { 155460, 151, "Уфимский многопрофильный профессиональный колледж (бывш. Педагогический колледж № 1)" },
                    { 37466, 151, "Художественная школа № 1" },
                    { 224230, 151, "Детско-юношеская спортивная школа олимпийского резерва № 1" },
                    { 2488, 151, "Музыкальная школа № 1" },
                    { 54515, 151, "Лицей № 1" },
                    { 7768, 151, "Гимназия № 1" },
                    { 9911, 151, "Башкирская республиканская гимназия-интернат (БРГИ) 1 им. Р. Гарипова" },
                    { 200671, 151, "Школа № 3" },
                    { 38518, 151, "Школа № 7" },
                    { 202633, 151, "Башкирская республиканская гимназия-интернат (БРГИ) 3" },
                    { 179897, 151, "Школа-интернат № 3" },
                    { 344262, 151, "Училище № 6" },
                    { 40864, 151, "Детско-юношеская спортивная школа № 6 «Геркулес»" },
                    { 61728, 151, "Музыкальная школа № 6" },
                    { 10154, 151, "Лицей № 6" },
                    { 71191, 151, "Школа № 6" },
                    { 350793, 151, "Профессиональное училище № 5" },
                    { 313180, 151, "Детский сад № 5" },
                    { 317424, 151, "Школа искусств № 5" },
                    { 212770, 151, "Профессионально-техническое училище № 5" },
                    { 178897, 151, "Детско-юношеская спортивная школа № 5" },
                    { 178003, 151, "Музыкальная школа № 5" },
                    { 208998, 151, "Вечерняя школа № 5" },
                    { 260001, 151, "Школа-интернат № 5 (спортивного профиля)" },
                    { 3436, 151, "Лицей № 5" },
                    { 263648, 151, "Школа № 5" },
                    { 54745, 151, "Музыкальная школа № 4" },
                    { 273310, 151, "Школа-интернат № 4" },
                    { 190988, 151, "Школа № 4" },
                    { 150939, 151, "Школа искусств № 3" },
                    { 55706, 151, "Художественная школа № 3" },
                    { 88902, 151, "Детско-юношеская спортивная школа олимпийского резерва № 3" },
                    { 175328, 151, "Музыкальная школа № 3" },
                    { 1716919, 151, "Вечерняя школа № 3" },
                    { 287289, 151, "Гимназия № 3 им. А. М. Горького" },
                    { 107236, 151, "Музыкальная школа № 20" },
                    { 73737, 151, "Школа № 21" },
                    { 253071, 151, "Лицей № 21" },
                    { 2955, 151, "Гимназия № 64" },
                    { 176762, 151, "Школа № 64" },
                    { 201301, 151, "Уфимский политехнический колледж (бывш. Профессиональный лицей № 63)" },
                    { 213931, 151, "Гимназия № 63" },
                    { 231523, 151, "Профессионально-техническое училище № 62" },
                    { 99773, 151, "Школа-интернат № 62" },
                    { 8097, 151, "Лицей № 62" },
                    { 219473, 151, "Школа № 62" },
                    { 194139, 151, "Профессионально-техническое училище № 61" },
                    { 24832, 151, "Гимназия № 61" },
                    { 311901, 151, "Школа № 61" },
                    { 165180, 151, "Лицей № 60" },
                    { 25608, 151, "Школа № 60" },
                    { 312749, 151, "Профессионально-техническое училище № 58" },
                    { 29560, 151, "Лицей № 58 (бывш. Школа № 58)" },
                    { 35278, 151, "Школа № 57" },
                    { 8278, 151, "Школа № 56" },
                    { 48461, 151, "Школа № 55" },
                    { 17139, 151, "Школа № 54" },
                    { 43472, 151, "Школа № 53" },
                    { 198881, 151, "Профессионально-техническое училище № 52" },
                    { 341754, 151, "Лицей № 52" },
                    { 7912, 151, "Школа № 51" },
                    { 146191, 151, "Лицей № 64" },
                    { 224998, 151, "Гимназия № 50" },
                    { 146012, 151, "Профессиональный лицей № 64 (художественный)" },
                    { 48514, 151, "Школа № 66" },
                    { 8260, 151, "Гимназия № 82" },
                    { 204724, 151, "Школа № 82" },
                    { 52282, 151, "Школа № 81" },
                    { 88135, 151, "Лицей № 80" },
                    { 56219, 151, "Школа № 80" },
                    { 19786, 151, "Школа № 79" },
                    { 240420, 151, "Профессионально-техническое училище № 78" },
                    { 45036, 151, "Школа № 78" },
                    { 56906, 151, "Школа № 77" },
                    { 211135, 151, "Школа № 76" },
                    { 120086, 151, "Профессиональное училище № 75" },
                    { 212237, 151, "Школа № 75" },
                    { 20632, 151, "Школа № 74" },
                    { 69833, 151, "Школа № 73" },
                    { 55369, 151, "Школа № 72" },
                    { 52274, 151, "Школа № 71" },
                    { 201078, 151, "Профессионально-техническое училище № 70" },
                    { 26204, 151, "Школа № 70" },
                    { 30355, 151, "Школа № 69" },
                    { 261915, 151, "Лицей № 68" },
                    { 127089, 151, "Гимназия № 67" },
                    { 898773, 151, "Центр образования № 67" },
                    { 149967, 151, "Школа № 67" },
                    { 46300, 151, "Татарская гимназия № 65" },
                    { 132684, 151, "Школа № 50" },
                    { 218409, 151, "Детско-юношеская спортивная школа № 49" },
                    { 25462, 151, "Школа № 49" },
                    { 316065, 151, "Школа № 33" },
                    { 37101, 151, "Школа № 32" },
                    { 7668, 151, "Школа № 31" },
                    { 1703839, 151, "Детско-юношеская спортивная школа № 30" },
                    { 58911, 151, "Школа-интернат № 30" },
                    { 322173, 151, "Школа № 30" },
                    { 29672, 151, "Школа № 29" },
                    { 232260, 151, "Профессионально-техническое училище № 28" },
                    { 167509, 151, "Детско-юношеская спортивная школа № 28" },
                    { 77950, 151, "Музыкальная школа № 28" },
                    { 334565, 151, "Школа-интернат № 28" },
                    { 100140, 151, "Школа № 28" },
                    { 36134, 151, "Школа № 27" },
                    { 202964, 151, "Детско-юношеская спортивная школа олимпийского резерва № 26" },
                    { 1716920, 151, "Вечерняя школа № 26" },
                    { 10813, 151, "Школа № 26" },
                    { 32753, 151, "Школа № 25" },
                    { 95565, 151, "Школа № 24" },
                    { 21101, 151, "Школа № 23" },
                    { 166073, 151, "Детско-юношеская спортивная школа № 22" },
                    { 193899, 151, "Музыкальная школа № 22" },
                    { 22470, 151, "Школа № 22" },
                    { 347799, 151, "Школа-интернат № 21" },
                    { 73248, 151, "Школа № 34" },
                    { 6497, 151, "Школа № 35" },
                    { 70908, 151, "Школа № 36" },
                    { 216730, 151, "Школа № 37" },
                    { 313365, 151, "Лицей № 48" },
                    { 55916, 151, "Школа № 48" },
                    { 330789, 151, "Гимназия № 47" },
                    { 230471, 151, "Школа № 47" },
                    { 8035, 151, "Лицей № 46" },
                    { 122221, 151, "Профессионально-техническое училище № 45" },
                    { 115258, 151, "Музыкальная школа № 45" },
                    { 7747, 151, "Гимназия № 45" },
                    { 63689, 151, "Школа № 45" },
                    { 278190, 151, "Школа искусств № 44" },
                    { 107876, 151, "Профессиональный лицей № 44" },
                    { 43685, 151, "Энергетический техникум (УЭТ)" },
                    { 3567, 151, "Школа № 44" },
                    { 74101, 151, "Школа № 43" },
                    { 63166, 151, "Лицей № 42" },
                    { 5061, 151, "Школа № 42" },
                    { 1597, 151, "Школа № 41" },
                    { 220890, 151, "Школа № 40" },
                    { 1060, 151, "Гимназия № 39" },
                    { 149689, 151, "Профессиональный лицей № 38" },
                    { 53731, 151, "Лицей № 38" },
                    { 6682, 151, "Гимназия № 38" },
                    { 176118, 151, "Школа № 38" },
                    { 193376, 151, "Профессионально-техническое училище № 37" },
                    { 88042, 151, "Профессионально-техническое училище № 43" },
                    { 255780, 151, "Юридический колледж" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7952);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17267);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48461);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68533);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122221);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176762);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190988);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218872);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 229632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 229936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 229938);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 319484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 322173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 322592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 330789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 333094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 333642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 337895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 338981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 343401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344262);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 347799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 348300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 349158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 350676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 350793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 355095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 506161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 685616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 771683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 791968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 857224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 887709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 898773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 925793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 951166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1352002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1360008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1360014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1501594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1556239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1619000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1669879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1703839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1706457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1716919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1716920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741122);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1748972);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781747);
        }
    }
}
