using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class OmskSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 166779, 104, "Школа № 1" },
                    { 168880, 104, "Гимназия № 147" },
                    { 129065, 104, "Гимназия № 146" },
                    { 6735, 104, "Школа № 146" },
                    { 9116, 104, "Лицей № 145 (бывш. Школа)" },
                    { 18492, 104, "Школа № 144" },
                    { 13716, 104, "Лицей № 143" },
                    { 180836, 104, "Школа № 142" },
                    { 34066, 104, "Школа № 141" },
                    { 6944, 104, "Гимназия № 140" },
                    { 7908, 104, "Гимназия № 139" },
                    { 39202, 104, "Школа № 148" },
                    { 13567, 104, "Школа № 138" },
                    { 219992, 104, "Гимназия № 136" },
                    { 169623, 104, "Школа № 136 при ОПУ № 2" },
                    { 181238, 104, "Школа № 135" },
                    { 22709, 104, "Школа № 134" },
                    { 50763, 104, "Школа № 133" },
                    { 9466, 104, "Школа № 132" },
                    { 74339, 104, "Школа № 131" },
                    { 53653, 104, "Школа № 130" },
                    { 32233, 104, "Школа № 129" },
                    { 24968, 104, "Школа № 128" },
                    { 6428, 104, "Лицей № 137" },
                    { 85349, 104, "Школа № 127" },
                    { 169201, 104, "Лицей № 149 (СЭШ 149 при СибАДИ)" },
                    { 9767, 104, "Гимназия № 150" },
                    { 1705597, 104, "Автошкола ДОСААФ" },
                    { 1709402, 104, "Автошкола «Пять Звёзд»" },
                    { 244772, 104, "Автотранспортный колледж (ОАТК, бывш. ОАТТ)" },
                    { 98219, 104, "Авиационный колледж им. Н. Е. Жуковского" },
                    { 310453, 104, "Детский сад № 305" },
                    { 1601546, 104, "Школа № 284" },
                    { 252540, 104, "Школа № 233" },
                    { 70721, 104, "Школа № 229" },
                    { 60171, 104, "Колледж № 186" },
                    { 260983, 104, "Школа № 173" },
                    { 323073, 104, "Школа № 150" },
                    { 211966, 104, "Лицей № 166" },
                    { 64386, 104, "Школа № 163" },
                    { 28753, 104, "Школа № 162" },
                    { 19291, 104, "Школа № 161" },
                    { 214260, 104, "Школа № 160" },
                    { 50778, 104, "Гимназия № 159" },
                    { 114402, 104, "Школа № 155 (авторская экспериментальная, АЭШ)" },
                    { 87566, 104, "Школа № 153" },
                    { 104158, 104, "Школа № 152" },
                    { 98440, 104, "Школа № 151" },
                    { 169849, 104, "Детско-юношеская спортивная школа № 150" },
                    { 276705, 104, "Школа № 166" },
                    { 98339, 104, "Аграрно-технологический колледж (бывш. Сельскохозяйственный техникум)" },
                    { 203525, 104, "Школа № 126" },
                    { 19083, 104, "Школа № 124" },
                    { 31675, 104, "Школа № 101" },
                    { 22033, 104, "Школа № 100" },
                    { 28381, 104, "Школа № 99" },
                    { 15792, 104, "Школа № 98" },
                    { 106150, 104, "Школа № 97 им. Л. Г. Полищук" },
                    { 49893, 104, "Школа № 96" },
                    { 50807, 104, "Школа № 95" },
                    { 40981, 104, "Школа № 94" },
                    { 60732, 104, "Школа № 93" },
                    { 1086, 104, "Лицей № 92 (бывш. шк. 92)" },
                    { 82947, 104, "Школа № 102" },
                    { 52351, 104, "Школа № 91" },
                    { 15646, 104, "Школа № 89" },
                    { 4586, 104, "Гимназия № 88" },
                    { 60095, 104, "Школа № 87" },
                    { 20200, 104, "Школа № 86" },
                    { 197313, 104, "Гимназия № 85" },
                    { 5661, 104, "Гимназия № 84" },
                    { 9916, 104, "Школа № 83" },
                    { 38897, 104, "Школа № 82" },
                    { 37722, 104, "Школа № 81" },
                    { 13195, 104, "Школа № 80" },
                    { 71694, 104, "Школа № 90" },
                    { 45702, 104, "Школа № 125" },
                    { 54823, 104, "Школа № 103" },
                    { 32756, 104, "Школа № 105" },
                    { 17589, 104, "Школа № 123" },
                    { 50727, 104, "Школа № 122" },
                    { 15257, 104, "Школа № 121" },
                    { 205861, 104, "Школа № 120" },
                    { 49497, 104, "Школа № 119" },
                    { 199503, 104, "Школа № 118" },
                    { 130861, 104, "Гимназия № 117" },
                    { 217931, 104, "Школа № 117" },
                    { 1777978, 104, "Многопрофильный образовательный центр развития одарённости № 117" },
                    { 189779, 104, "Школа № 116" },
                    { 9680, 104, "Школа № 104" },
                    { 132994, 104, "Гимназия № 115" },
                    { 41683, 104, "Школа № 114" },
                    { 10930, 104, "Школа № 113" },
                    { 30081, 104, "Школа № 112" },
                    { 148506, 104, "Гимназия № 111" },
                    { 151342, 104, "Школа № 111" },
                    { 9621, 104, "Школа № 110" },
                    { 29555, 104, "Школа № 109" },
                    { 45853, 104, "Школа № 108" },
                    { 197295, 104, "Школа № 107" },
                    { 87100, 104, "Школа № 106" },
                    { 176227, 104, "Школа № 115" },
                    { 217725, 104, "Аграрный техникум" },
                    { 67825, 104, "Академический лицей ОмГПУ" },
                    { 273275, 104, "Банковский колледж Банка России (бывш. ОБШ ЦБ РФ)" },
                    { 59957, 104, "Футбольная школа" },
                    { 137121, 104, "Фотошкола V PHOTOS" },
                    { 149871, 104, "Финансово-юридический техникум (ОмФинЮТ)" },
                    { 103320, 104, "Финансово-экономический колледж (ОмФЭК)" },
                    { 114503, 104, "Училище олимпийского резерва (ОГУОР)" },
                    { 1656372, 104, "Учебно-курсовой комбинат автомобильного транспорта" },
                    { 1671453, 104, "Университетский профессиональный колледж ОмГУ им. Ф. М. Достоевского" },
                    { 523887, 104, "Университетский колледж ОмГПУ" },
                    { 1779055, 104, "Университетский колледж агробизнеса ОмГАУ" },
                    { 145661, 104, "Традиционная гимназия" },
                    { 205036, 104, "Химико-механический колледж (ОХМК)" },
                    { 233903, 104, "Торгово-экономический колледж (ОТЭК)" },
                    { 283659, 104, "Техникум советской торговли" },
                    { 284589, 104, "Техникум при ОмГУ" },
                    { 318404, 104, "Техникум мясной и молочной промышленности (ОТММП)" },
                    { 1709216, 104, "Техникум информационных технологий (ОмТИТ)" },
                    { 54429, 104, "Техникум железнодорожного транспорта (ОТЖТ)" },
                    { 1675243, 104, "Театрально-музыкальная школа им. С. З. Казарновского" },
                    { 105592, 104, "Строительный колледж (бывш. техникум)" },
                    { 214394, 104, "Специализированная детско-юношеская спортивная авторская школа олимпийского резерва по художественной гимнастике Л. В. Лебеде" },
                    { 1037101, 104, "СО-Лицей" },
                    { 78346, 104, "Славянская школа им. Кирилла и Мефодия" },
                    { 239933, 104, "Технологический колледж (ОмТК)" },
                    { 70324, 104, "Сибирский профессиональный колледж (бывш. СППК)" },
                    { 52287, 104, "Художественная школа «Модерн»" },
                    { 154020, 104, "Художественное училище" },
                    { 197784, 104, "Экономический лицей" },
                    { 71593, 104, "Школа эстетического воспитания при Музей «Либеров-центр»" },
                    { 119536, 104, "Школа переводчиков «Ин.яз Омск»" },
                    { 150820, 104, "Школа начинающего психолога при ОМГУ им. Достоевского" },
                    { 112760, 104, "Школа молодого политика" },
                    { 130871, 104, "Школа молодого журналиста" },
                    { 118132, 104, "Школа интеллектуального развития" },
                    { 1760458, 104, "Школа иностранных языков «Джей энд Эс»" },
                    { 268327, 104, "Школа джаз-модерн танца" },
                    { 58532, 104, "Школа «Эврика»" },
                    { 74072, 104, "Художественно-промышленный колледж (ОХПК)" },
                    { 240371, 104, "Школа «Престиж»" },
                    { 1762813, 104, "Школа «Легория»" },
                    { 167870, 104, "Школа «Интеллект»" },
                    { 40973, 104, "Школа «Возрождение»" },
                    { 175511, 104, "Школа «Видергебурт»" },
                    { 58531, 104, "Школа «Альфа и Омега»" },
                    { 855855, 104, "Центр развития парикмахерского искусства" },
                    { 91235, 104, "Центр образования и развития «Маврина»" },
                    { 146068, 104, "Центр образования и развития (ЦОР)" },
                    { 138123, 104, "Центр международного образования «Экономика и право»" },
                    { 1745938, 104, "Центр дополнительного образования «Гарант АНО»" },
                    { 1745449, 104, "Школа «Новое поколение»" },
                    { 1705052, 104, "Сибирский казачий юридический колледж" },
                    { 1763027, 104, "Сибирский институт профессиональной переподготовки и бизнес-образования (СИБППБО)" },
                    { 1760874, 104, "Сибирская школа нового поколения «Siberian New Millennium School»" },
                    { 130459, 104, "Колледж профессиональных технологий (ОмГКПТ)" },
                    { 219922, 104, "Колледж предпринимательства и права (ОмКПиП)" },
                    { 203696, 104, "Колледж потребительской кооперации" },
                    { 134670, 104, "Колледж отраслевых технологий строительства и транспорта (ОГКОТСиТ)" },
                    { 122041, 104, "Колледж Омского экономического института (ОмЭИ)" },
                    { 1782225, 104, "Колледж Многопрофильной Академии непрерывного образования" },
                    { 103575, 104, "Колледж культуры и искусства (ООККиИ)" },
                    { 152408, 104, "Колледж «Ориентир»" },
                    { 206216, 104, "Колледж «Ин-яз Омск»" },
                    { 1563317, 104, "Институт им. Гёте" },
                    { 148451, 104, "Колледж торговли, экономики и сервиса (ОГКТЭиС)" },
                    { 161971, 104, "Индустриально-педагогический техникум" },
                    { 208273, 104, "Европейская гимназия" },
                    { 1780924, 104, "Дом детского творчества Октябрьского административного округа" },
                    { 59958, 104, "Детско-юношеская спортивная школа по гимнастике" },
                    { 235495, 104, "Детский сад «Маленький гений»" },
                    { 1148081, 104, "Детский дом-школа" },
                    { 238383, 104, "Дворец творчества детей и юношества (ГДТДиЮ)" },
                    { 112664, 104, "Гуманитарный техникум" },
                    { 1780406, 104, "Гуманитарный колледж" },
                    { 44073, 104, "Богословская школа" },
                    { 960795, 104, "Библиотечный техникум (ОБТ)" },
                    { 1698667, 104, "Европейский колледж туристического бизнеса и иностранных языков" },
                    { 142334, 104, "Колледж транспортного строительства (ОКТС)" },
                    { 267586, 104, "Колледж транспортных технологий (ОКТТ)" },
                    { 58579, 104, "Колледж управления и профессиональных технологий (ОГКУиПТ)" },
                    { 75610, 104, "Сибирская региональная школа бизнеса (СРШБ)" },
                    { 1770292, 104, "Российско-Британская школа" },
                    { 153136, 104, "Российско-американская профессиональная школа (РАПШ)" },
                    { 51138, 104, "Речное училище (ОмКРУ) им. Евдокимова" },
                    { 112772, 104, "Речная школа" },
                    { 74588, 104, "Республиканский медицинский колледж" },
                    { 174366, 104, "Радиотехнический профессиональный лицей (РТПЛ)" },
                    { 187075, 104, "Промышленно-экономический колледж (ОГПЭК)" },
                    { 1745479, 104, "Отраслевой институт «Омскгазтехнология»" },
                    { 135455, 104, "Омский кадетский военный корпус МО РФ" },
                    { 102902, 104, "Областной медицинский колледж" },
                    { 138700, 104, "Музыкальный театр" },
                    { 97993, 104, "Музыкальное училище им. В. Я. Шебалина" },
                    { 256063, 104, "Музыкально-педагогический колледж (ОМПК)" },
                    { 84900, 104, "Музыкальная школа при Музыкальном училище им. В. Я. Шебалина" },
                    { 164636, 104, "Многофункциональная банковская школа ЦБ РФ" },
                    { 167405, 104, "Механико-технологический техникум (ОмМТТ)" },
                    { 197927, 104, "Медицинское училище железнодорожного транспорта (ОМУЖТ)" },
                    { 267989, 104, "Медицинский колледж ОмГМА" },
                    { 138431, 104, "Лицей при ОмГПУ" },
                    { 239373, 104, "Лицей бизнеса и информационных технологий" },
                    { 130271, 104, "Летняя гуманитарно-экономическая школа" },
                    { 95030, 104, "Летно-технический колледж им. Ляпидевского (ОЛТК ГА)" },
                    { 63086, 104, "Школа № 79" },
                    { 34186, 104, "Школа № 78" },
                    { 14625, 104, "Школа № 77" },
                    { 1529533, 104, "Гимназия № 76" },
                    { 212589, 104, "Музыкальная школа № 12" },
                    { 74586, 104, "Вечерняя школа № 12" },
                    { 11839, 104, "Гимназия № 12" },
                    { 169639, 104, "Школа № 12" },
                    { 275348, 104, "Школа искусств № 11" },
                    { 169279, 104, "Художественная школа № 11" },
                    { 197273, 104, "Лицей № 11" },
                    { 44074, 104, "Школа № 11" },
                    { 255438, 104, "Школа искусств № 10" },
                    { 237997, 104, "Техникум легкой промышленности (ОТЛП, бывш. ПУ 10)" },
                    { 251970, 104, "Специализированная детско-юношеская школа олимпийского резерва № 12" },
                    { 136325, 104, "Школа-интернат № 10" },
                    { 193505, 104, "Школа искусств № 9" },
                    { 74469, 104, "Художественная школа № 9" },
                    { 203601, 104, "Специализированная детско-юношеская школа олимпийского резерва № 9" },
                    { 33606, 104, "Детско-юношеская спортивная школа № 9" },
                    { 141023, 104, "Музыкальная школа № 9" },
                    { 79960, 104, "Кадетская школа-интернат № 9" },
                    { 9023, 104, "Гимназия № 9" },
                    { 217473, 104, "Школа № 9" },
                    { 98267, 104, "Музыкальная школа № 8" },
                    { 49334, 104, "Школа № 8" },
                    { 51429, 104, "Школа № 10" },
                    { 121605, 104, "Школа искусств № 7" },
                    { 89106, 104, "Художественная школа № 12" },
                    { 28776, 104, "Школа № 13" },
                    { 54222, 104, "Школа искусств № 18 «Школьные годы»" },
                    { 311789, 104, "Музыкальная школа № 18" },
                    { 12878, 104, "Школа № 18" },
                    { 175377, 104, "Школа искусств № 17" },
                    { 13448, 104, "Школа № 17" },
                    { 247824, 104, "Школа искусств № 16" },
                    { 16763, 104, "Школа № 16" },
                    { 140619, 104, "Школа искусств № 15" },
                    { 158681, 104, "Профессионально-техническое училище № 15" },
                    { 1699555, 104, "Техникум техникум водного транспорта (ОТВТ, бывш. ПУ 15)" },
                    { 151970, 104, "Школа искусств № 12" },
                    { 1707319, 104, "Детско-юношеская спортивная школа № 15" },
                    { 84416, 104, "Школа искусств № 14" },
                    { 209721, 104, "Колледж № 14" },
                    { 242762, 104, "Музыкальная школа № 14" },
                    { 57978, 104, "Школа-интернат № 14" },
                    { 28027, 104, "Школа № 14" },
                    { 272506, 104, "Школа искусств № 13" },
                    { 121900, 104, "Художественная школа № 13" },
                    { 1680657, 104, "Детско-юношеская спортивная школа № 13" },
                    { 700707, 104, "Вечерняя школа № 13" },
                    { 75261, 104, "Гимназия № 13" },
                    { 49461, 104, "Школа № 15" },
                    { 279977, 104, "Специализированная детско-юношеская школа олимпийского резерва № 7" },
                    { 179506, 104, "Музыкальная школа № 7" },
                    { 37270, 104, "Школа № 7" },
                    { 101928, 104, "Педагогический колледж № 2" },
                    { 63902, 104, "Колледж № 2" },
                    { 125943, 104, "Художественная школа № 2" },
                    { 95470, 104, "Детско-юношеская спортивная школа № 2" },
                    { 226958, 104, "Музыкальная школа № 2" },
                    { 791671, 104, "Школа-интернат № 2" },
                    { 161769, 104, "Лицей № 2 при ПГУ" },
                    { 231261, 104, "Гимназия № 2" },
                    { 212861, 104, "Начальная гимназия при ОПК № 2" },
                    { 123420, 104, "Школа № 2" },
                    { 146611, 104, "Школа искусств № 2" },
                    { 45418, 104, "Школа искусств № 1" },
                    { 88645, 104, "Педагогический колледж № 1" },
                    { 190845, 104, "Колледж № 1" },
                    { 50838, 104, "Художественная школа № 1" },
                    { 90251, 104, "Специализированная детско-юношеская школа олимпийского резерва № 1" },
                    { 109779, 104, "Детско-юношеская спортивная школа № 1" },
                    { 115715, 104, "Музыкальная школа № 1" },
                    { 159456, 104, "Школа-интернат № 1" },
                    { 228215, 104, "Лицей № 1" },
                    { 53358, 104, "Лицей при педагогическом колледже № 1" },
                    { 203881, 104, "Гимназия № 1" },
                    { 244453, 104, "Техникум № 1" },
                    { 221548, 104, "Школа № 3" },
                    { 221750, 104, "Гимназия № 3" },
                    { 52029, 104, "Художественная школа № 3" },
                    { 907281, 104, "Начальная школа № 7" },
                    { 148433, 104, "Школа искусств № 6" },
                    { 210686, 104, "Художественная школа № 6" },
                    { 70117, 104, "Музыкальная школа № 6" },
                    { 215967, 104, "Гимназия № 6" },
                    { 13717, 104, "Школа № 6" },
                    { 63484, 104, "Школа искусств № 5" },
                    { 237756, 104, "Профессионально-техническое училище № 5" },
                    { 157585, 104, "Художественная школа № 5" },
                    { 240802, 104, "Детско-юношеская спортивная школа № 5" },
                    { 198887, 104, "Специализированная детско-юношеская школа олимпийского резерва № 5" },
                    { 101128, 104, "Музыкальная школа № 5" },
                    { 134901, 104, "Школа № 5" },
                    { 55307, 104, "Школа искусств № 4" },
                    { 124897, 104, "Педагогический колледж № 4" },
                    { 132995, 104, "Музыкальная школа № 4" },
                    { 37742, 104, "Школа № 4" },
                    { 130753, 104, "Школа искусств № 3" },
                    { 186642, 104, "Профессионально-строительное училище № 3" },
                    { 295254, 104, "Профессиональное училище № 3" },
                    { 286224, 104, "Колледж № 3" },
                    { 151105, 104, "Музыкально-педагогический колледж № 3" },
                    { 209487, 104, "Педагогический колледж № 3" },
                    { 190519, 104, "Специализированная детско-юношеская школа олимпийского резерва № 18" },
                    { 245899, 104, "Экспериментальная музыкальная школа (ЭДМШ)" },
                    { 155523, 104, "Художественная школа № 18" },
                    { 1761320, 104, "Адаптивная школа-интернат № 19" },
                    { 12434, 104, "Гимназия № 62" },
                    { 17955, 104, "Школа № 61" },
                    { 1769032, 104, "Городское техническое училище № 60" },
                    { 49286, 104, "Школа № 60" },
                    { 53416, 104, "Школа № 59" },
                    { 171181, 104, "Профессионально-техническое училище № 58" },
                    { 162894, 104, "Техникум высоких технологий машиностроения (ОмТВТМ, бывш. ПУ 58)" },
                    { 30930, 104, "Школа № 58" },
                    { 95856, 104, "Профессиональный технологический лицей № 57 (бывш. ПТУ 57)" },
                    { 137935, 104, "Школа № 57" },
                    { 17956, 104, "Школа № 63" },
                    { 142079, 104, "Профессиональное училище № 56" },
                    { 46601, 104, "Школа-интернат № 55" },
                    { 53100, 104, "Школа № 55" },
                    { 104547, 104, "Профессиональное училище № 54" },
                    { 36465, 104, "Школа № 54" },
                    { 24105, 104, "Школа № 53" },
                    { 157873, 104, "Профессионально-техническое училище № 52" },
                    { 37980, 104, "Школа № 52" },
                    { 17488, 104, "Школа № 51" },
                    { 55712, 104, "Школа № 50" },
                    { 1650912, 104, "Техникум строительства и лесного хозяйства (ОТСЛХ, бывш. ПТУ № 49)" },
                    { 1887, 104, "Школа № 56" },
                    { 28491, 104, "Школа № 49" },
                    { 266180, 104, "Школа искусств № 63" },
                    { 1541, 104, "Лицей № 64" },
                    { 11106, 104, "Школа № 76" },
                    { 250711, 104, "Училище № 75" },
                    { 7275, 104, "Гимназия № 75" },
                    { 247754, 104, "Школа № 75" },
                    { 38002, 104, "Лицей № 74" },
                    { 6889, 104, "Гимназия № 73" },
                    { 197275, 104, "Школа № 73" },
                    { 11763, 104, "Школа № 72" },
                    { 275485, 104, "Профессионально-техническое училище № 71" },
                    { 27676, 104, "Школа № 71" },
                    { 128810, 104, "Школа № 64" },
                    { 1739621, 104, "Школа № 70" },
                    { 30931, 104, "Гимназия № 69" },
                    { 130943, 104, "Школа № 68" },
                    { 30530, 104, "Школа № 67" },
                    { 285252, 104, "Профессионально-техническое училище № 66" },
                    { 203983, 104, "Профессиональный лицей № 66" },
                    { 4204, 104, "Лицей № 66" },
                    { 321441, 104, "Школа № 66" },
                    { 181154, 104, "Профессионально-техническое училище № 65" },
                    { 35892, 104, "Школа № 65" },
                    { 150149, 104, "Профессиональное училище № 64" },
                    { 227641, 104, "Профессионально-техническое училище № 69" },
                    { 282175, 104, "Профессиональное училище № 48" },
                    { 9332, 104, "Школа № 48" },
                    { 7684, 104, "Школа № 47" },
                    { 9022, 104, "Лицей № 29" },
                    { 246477, 104, "Школа № 29" },
                    { 1486429, 104, "Профессиональное училище № 28" },
                    { 179772, 104, "Детско-юношеская спортивная школа № 28" },
                    { 33164, 104, "Школа № 28" },
                    { 50172, 104, "Школа № 27" },
                    { 4893, 104, "Гимназия № 26" },
                    { 209903, 104, "Школа № 26" },
                    { 59959, 104, "Специализированная детско-юношеская школа олимпийского резерва № 25 по спортивной гимнастике" },
                    { 15839, 104, "Лицей № 25" },
                    { 29877, 104, "Школа № 30" },
                    { 246503, 104, "Профессиональное училище № 24" },
                    { 52147, 104, "Школа № 23" },
                    { 171838, 104, "Профессиональное училище № 22" },
                    { 26188, 104, "Школа № 22" },
                    { 261576, 104, "Профессионально-техническое училище № 21" },
                    { 264260, 104, "Гимназия № 21" },
                    { 24420, 104, "Школа № 21" },
                    { 204968, 104, "Профессионально-техническое училище № 20" },
                    { 92329, 104, "Специализированная детско-юношеская школа олимпийского резерва № 20" },
                    { 22977, 104, "Школа № 20" },
                    { 1514, 104, "Гимназия № 19" },
                    { 151833, 104, "Школа № 24" },
                    { 46324, 104, "Школа № 31" },
                    { 23878, 104, "Школа № 32" },
                    { 21251, 104, "Школа № 33" },
                    { 130609, 104, "Омский монтажный техникум (бывш. ПУ № 46)" },
                    { 17954, 104, "Школа № 46" },
                    { 197274, 104, "Профессионально-техническое училище № 45" },
                    { 225749, 104, "Гимназия № 45" },
                    { 10411, 104, "Школа № 45" },
                    { 231910, 104, "Профессионально-техническое училище № 44" },
                    { 9599, 104, "Школа № 44" },
                    { 1657802, 104, "Профессиональное училище № 43" },
                    { 17857, 104, "Гимназия № 43" },
                    { 7909, 104, "Школа № 42" },
                    { 267941, 104, "Техникум № 41" },
                    { 43381, 104, "Школа № 41" },
                    { 1076390, 104, "Многопрофильный техникум (ОМТ, ПУ № 40)" },
                    { 16455, 104, "Школа № 40" },
                    { 71401, 104, "Школа № 39" },
                    { 9452, 104, "Школа № 38" },
                    { 21758, 104, "Школа № 37" },
                    { 974395, 104, "Профессиональное училище № 36" },
                    { 4892, 104, "Школа № 36" },
                    { 86348, 104, "Специализированная детско-юношеская спортивная школа олимпийского резерва № 35" },
                    { 120695, 104, "Школа № 35" },
                    { 49981, 104, "Школа № 34" },
                    { 1761183, 104, "Школа иностранных языков «Hello!»" },
                    { 1745271, 104, "Школа искусств № 19" },
                    { 1756574, 104, "Юридический колледж (ОмЮК)" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5661);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9767);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29555);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49461);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98267);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138123);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145661);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146068);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203696);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219922);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242762);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267941);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275485);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295254);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 310453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 323073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 523887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 700707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 791671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 855855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 907281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 974395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1037101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1076390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1148081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1529533);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1563317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1601546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1650912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1657802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1680657);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1699555);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1707319);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745938);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782225);
        }
    }
}
