using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class PopulatePetersburgSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 577, 2, "Школа № 644" },
                    { 1675445, 2, "Учебно-курсовой комбинат «Горэлектротранс»" },
                    { 1523718, 2, "Учебно-курсовой комбинат ПГУПС" },
                    { 1760847, 2, "Учебно-курсовой комбинат Управления социального питания" },
                    { 58062, 2, "Учебно-территориальный комплекс «Дачное»" },
                    { 1751464, 2, "Учебно-эстетический центр ESTETISTA" },
                    { 215247, 2, "Учебный комбинат экономики и торговли" },
                    { 1753017, 2, "Учебный центр «FITNESS-Profi»" },
                    { 1777364, 2, "Учебный центр «Базис»" },
                    { 1763925, 2, "Учебный центр «Гид-Интур»" },
                    { 855858, 2, "Учебный центр «Педагогический Альянс» (бывш. Союз педагогов)" },
                    { 1761063, 2, "Учебный центр «Снайпер»" },
                    { 1772011, 2, "Учебный центр «Статус»" },
                    { 1486449, 2, "Учебный центр А. Ф. Конто" },
                    { 9076, 2, "Учебный центр вычислительной техники (УЦВТ)" },
                    { 1767195, 2, "Учебный центр им. Н. П. Бехтеревой" },
                    { 1677633, 2, "Учебно-косметический центр «Нера»" },
                    { 1743339, 2, "Учебный центр НПФ «Геник»" },
                    { 1781135, 2, "Учебно-консультационный центр «Гермес»" },
                    { 454845, 2, "Университет эстрадно-музыкального искусства" },
                    { 1779009, 2, "Техникум «Автосервис» (Многофункциональный центр прикладных квалификаций)" },
                    { 1779008, 2, "Техникум «Приморский»" },
                    { 55383, 2, "Техникум библиотечных и информационных технологий (СПбТБиИТ, бывш. СПбБТ)" },
                    { 7580, 2, "Техникум железнодорожного транспорта (СПТЖТ)" },
                    { 18349, 2, "Техникум книжного бизнеса (СПГТКБ)" },
                    { 70505, 2, "Техникум отраслевых технологий, финансов и права (СПбТОТФиП, бывш. ЛМТ)" },
                    { 14238, 2, "Техникум пищевой промышленности СПбГЭУ" },
                    { 112028, 2, "Техникум экономики и права «Эксма»" },
                    { 16558, 2, "Технический колледж (СПбТК, бывш. ПТЛ)" },
                    { 11873, 2, "Технический колледж управления и коммерции (СПб ТКУиК, бывш. ЛРАСТ)" },
                    { 21961, 2, "Торгово-экономический техникум (ТЭТ, бывш. Советской торговли)" },
                    { 750110, 2, "Туристический профессиональный лицей ресторанного и гостиничного сервиса (ТПЛ)" },
                    { 1046244, 2, "Ульпан «Халом»" },
                    { 127350, 2, "Ульпан при ИКЦ" },
                    { 1773670, 2, "Университет фитнес-технологий" },
                    { 1777807, 2, "Университетский политехнический колледж СПбПУ Петра Великого (СПбКИУ)" },
                    { 1612653, 2, "Учебный центр Федеральной противопожарной службы" },
                    { 218032, 2, "Училище МВД (СПбУ МВД)" },
                    { 19668, 2, "Факультет СПО Горного университета – Колледж геодезии и картографии (бывш. ТГиК, ЛТТ)" },
                    { 23130, 2, "Художественно-профессиональный лицей им. Карла Фаберже" },
                    { 1670596, 2, "Художественное училище (СПбХУ) им. Н. К. Рериха" },
                    { 23365, 2, "Центр внешкольной работы (ЦВР)" },
                    { 1779034, 2, "Центр внешкольной работы с детьми и молодежью «Академический»" },
                    { 1779288, 2, "Центр внешкольной работы Центрального района" },
                    { 1765101, 2, "Центр высшего водительского мастерства" },
                    { 1779010, 2, "Центр детского (юношеского) технического творчества" },
                    { 1779287, 2, "Центр детского (юношеского) технического творчества «Мотор»" },
                    { 1779078, 2, "Центр детского (юношеского) технического творчества «Охта»" },
                    { 1096278, 2, "Центр детского (юношеского) технического творчества Московского района (бывш. Компьютерный центр технического творчества Моск" },
                    { 1769248, 2, "Центр дополнительного профессионального образования, дистанционной профессиональной подготовки и профессиональной переподгото" },
                    { 1768905, 2, "Центр европейских языков «Лексика»" },
                    { 14086, 2, "Центр искусства воспитания (ЦИВ)" },
                    { 36441, 2, "Центр испанского языка «Аделанте»" },
                    { 314698, 2, "Центр культуры и досуга «Кировец»" },
                    { 489317, 2, "Художественно-коммерческий лицей" },
                    { 36055, 2, "Художественная школа им. Аникушина" },
                    { 276272, 2, "Художественная школа «Александрино»" },
                    { 20805, 2, "Хоровое училище при Капелле им. Глинки" },
                    { 1752619, 2, "Факультет среднего профессионального образования ВМедА" },
                    { 6137, 2, "Факультет среднего профессионального образования и довузовской подготовки СЗИУ РАНХиГС (ФСПОиДП СЗИУ РАНХиГС, бывш. Социальны" },
                    { 1707002, 2, "Факультет среднего профессионального образования ИНЖЭКОН" },
                    { 8819, 2, "Факультет среднего профессионального образования ИТМО" },
                    { 1780294, 2, "Факультет фотокорреспондентов им. Ю. А. Гальперина" },
                    { 16540, 2, "Фармацевтический техникум СПХФУ Минздрава России (бывш. Фармацевтический колледж, СПбФК)" },
                    { 7496, 2, "Физико-математическая школа (ФМШ) СПбГУ ИТМО" },
                    { 1762310, 2, "Театр юношеского творчества (ТЮТ)" },
                    { 1761029, 2, "Физико-математический лицей Горного университета" },
                    { 7026, 2, "Физико-техническая школа (ФТШ)" },
                    { 1763166, 2, "ФотоДепартамент (FotoDepartament)" },
                    { 1689489, 2, "Фотошкола «Академия фотографии»" },
                    { 534158, 2, "Французский институт" },
                    { 97693, 2, "Фрунзенский профессиональный лицей" },
                    { 8387, 2, "Хор мальчиков Санкт-Петербурга" },
                    { 55402, 2, "Хореографический ансамбль «Юный ленинградец»" },
                    { 19784, 2, "Физико-механический инженерный колледж (ФМИК, бывш. ЛФМТ) им. Зверева" },
                    { 46652, 2, "Танцевальная школа «Маска»" },
                    { 1695632, 2, "Танцевальная школа «Dance Project ШОКолад»" },
                    { 14668, 2, "Судомеханический колледж (СПСМК)" },
                    { 109186, 2, "Пожарно-спасательный колледж «Санкт-Петербургский центр подготовки спасателей»" },
                    { 14427, 2, "Политехнический колледж городского хозяйства (ПКГХ, бывш. СПКРП)" },
                    { 109141, 2, "Политехнический колледж ФСПО НМСУ «Горный» (бывш. колл. СЗТУ)" },
                    { 112016, 2, "Политехнический техникум СПбГЭУ" },
                    { 36036, 2, "Полицейский колледж («ИнтерПолисКолледж»)" },
                    { 1761511, 2, "Польский институт в Санкт-Петербурге (Instytut Polski w Petersburgu)" },
                    { 746680, 2, "Правобережный дом детского творчества" },
                    { 244252, 2, "Православная гимназия св. благоверного великого князя Александра Невского" },
                    { 7975, 2, "Православная медицинская гимназия" },
                    { 19279, 2, "Приборостроительный техникум (СППТ)" },
                    { 13409, 2, "Приморский профессиональный техникум" },
                    { 13107, 2, "Промышленно-экономический колледж (СПбПЭК)" },
                    { 134144, 2, "Профессионально-реабилитационный центр (ПРЦ)" },
                    { 2847, 2, "Профессиональный лицей «Купчино»" },
                    { 12218, 2, "Профессиональный лицей «Петроградский»" },
                    { 19927, 2, "Подростково-молодежный клуб «Факел»" },
                    { 10196, 2, "Подготовительное отделение СПбГУ" },
                    { 65922, 2, "Петровский колледж" },
                    { 1751590, 2, "Петербургская школа психотерапии и психологии отношений (ПШПиПО)" },
                    { 16520, 2, "Нахимовское военно-морское училище (НВМУ)" },
                    { 1764560, 2, "Национальная школа гидов-переводчиков и экскурсоводов" },
                    { 3718, 2, "Невская Христианская школа" },
                    { 16305, 2, "Невский колледж им. А. Г. Неболсина" },
                    { 11605, 2, "Невский машиностроительный техникум" },
                    { 20285, 2, "Немецкая школа «Гёте-Шуле»" },
                    { 1760199, 2, "Немецкая школа Санкт-Петербурга (Deutsche Schule)" },
                    { 48625, 2, "Профессиональный лицей моды и дизайна" },
                    { 1765817, 2, "Областной специальный детский дом" },
                    { 1675785, 2, "Образовательный центр Анны Франк" },
                    { 1773177, 2, "Обучающий центр «Коннессанс»" },
                    { 17320, 2, "Оптико-механический лицей (ОМЛ, ОМПЛ)" },
                    { 15532, 2, "Оркестр баянистов СПбГДТЮ" },
                    { 1763529, 2, "Охтинский колледж" },
                    { 8519, 2, "Охтинский центр эстетического воспитания (ОЦЭВ)" },
                    { 17898, 2, "Педагогический колледж фитнеса" },
                    { 8974, 2, "Образовательный центр «Vidi Vici»" },
                    { 13675, 2, "Центр подготовки спасателей (ЦПС)" },
                    { 4414, 2, "Профессиональный лицей полиграфии и книжной торговли (ПЛПиКТ)" },
                    { 44487, 2, "Профессиональный лицей торговли и бизнеса (ПЛТиБ)" },
                    { 15623, 2, "Социально-психологический центр по работе с одаренными подростками" },
                    { 19854, 2, "СПб филиал Финансового Университета при Правительстве РФ (бывш. СПбФЭК филиал Академии бюджета и казначейства Министерства фи" },
                    { 1745749, 2, "Специальная средняя школа милиции (СПб ССШМ МВД РФ)" },
                    { 362735, 2, "Спортивная школа олимпийского резерва по футболу «Зенит»" },
                    { 17883, 2, "Спортивная школа олимпийского резерва Приморского района" },
                    { 18093, 2, "Спортивная школа ФК «Турбостроитель»" },
                    { 1764372, 2, "Среднетехнический факультет СПбГМТУ" },
                    { 1772742, 2, "Средняя специальная музыкальная школа СПб государственной консерватории им. Н. А. Римского-Корсакова" },
                    { 175, 2, "Средняя специальная музыкальная школа-лицей СПб Консерватории им. Н. А. Римского-Корсакова" },
                    { 97534, 2, "Средняя школа им. С. Т. Шацкого" },
                    { 9086, 2, "Стадион «Невский завод»" },
                    { 12375, 2, "Строительно-экономический колледж городского хозяйства (СЭКГХ)" },
                    { 1774308, 2, "Студия творческого мышления YouMedia" },
                    { 11590, 2, "Суворовское военное училище (СПб СВУ)" },
                    { 216627, 2, "Суворовское военное училище МВД РФ" },
                    { 1751983, 2, "Социальная школа «Каритас»" },
                    { 109174, 2, "Северо-западный колледж туризма и гостеприимства «ОтельСервисКолледж»" },
                    { 244248, 2, "Северо-Западная заочная математическая школа (СЗЗМШ)" },
                    { 169883, 2, "Северо-Западная академия иностранных языков (СЗАИЯ)" },
                    { 129232, 2, "Радиомеханический техникум (ЛРМТ)" },
                    { 21429, 2, "Радиополитехникум (бывш. СПИШЭ, ЛРПТ, ЛЭВТ)" },
                    { 19688, 2, "Радиотехнический колледж (бывш. РТПЛ)" },
                    { 9203, 2, "Радиотехнический техникум (СПбРТ)" },
                    { 23489, 2, "Реставрационно-художественный колледж (РХК, СПбРПЛ)" },
                    { 1777280, 2, "Реставрационный колледж «Кировский»" },
                    { 135231, 2, "Речной яхт-клуб (СПбРЯК)" },
                    { 130882, 2, "Профессиональный лицей связи (ПЛС)" },
                    { 98056, 2, "Российский колледж традиционной культуры (РКТК)" },
                    { 1775609, 2, "Санкт-петербургская школа красоты" },
                    { 1763051, 2, "Санкт-Петербургская школа нового кино" },
                    { 1765100, 2, "Санкт-Петербургский городской клуб служебного собаководства" },
                    { 1769292, 2, "Санкт-Петербургский институт астрологии (СПбИА)" },
                    { 1768239, 2, "Санкт-Петербургский институт гештальта" },
                    { 1764771, 2, "Санкт-Петербургский институт психотерапии и медицинской психологии им. Б. Д. Карвасарского" },
                    { 13024, 2, "Санкт-Петербургский центр физической культуры и спорта" },
                    { 328547, 2, "Санкт-Петербургская международная школа (СПбМШ)" },
                    { 1772513, 2, "Народный Православный Университет (НПУ)" },
                    { 1757106, 2, "Центр последипломного образования специалистов медицинского профиля (ДПО СМП, бывш. Центр повышения квалификации специалистов" },
                    { 16764, 2, "Центр эстетического воспитания (ЦЭВ)" },
                    { 21972, 2, "Школа народного искусства им. Александры Федоровны" },
                    { 17322, 2, "Школа открытого христианства" },
                    { 1709018, 2, "Школа парикмахерского мастерства «Дом Распутина»" },
                    { 52527, 2, "Школа парусного спорта" },
                    { 784634, 2, "Школа разговорных языков (ШРЯ)" },
                    { 1776477, 2, "Школа рисунка и цифровой графики «Skills Up School»" },
                    { 699693, 2, "Школа русского балета" },
                    { 1764720, 2, "Школа садово-паркового искусства" },
                    { 1768773, 2, "Школа свадебного бизнеса Dahlia School" },
                    { 13529, 2, "Школа скандинавских языков И. Соом" },
                    { 1778458, 2, "Школа современной фотографии «Докдокдок»" },
                    { 1673057, 2, "Школа сомелье «Pro Sommelier»" },
                    { 1761673, 2, "Школа сомелье и винного бизнеса «WineJet»" },
                    { 18206, 2, "Школа танцев «Humpty-Dumpty Dance School»" },
                    { 1756532, 2, "Школа танцев «Millenium Dance Studio»" },
                    { 15573, 2, "Школа милиции (СПбССШМ)" },
                    { 14923, 2, "Школа танцев «Тодес»" },
                    { 1779870, 2, "Школа медицинского фитнеса MediFit" },
                    { 1715614, 2, "Школа макияжа «ATML»" },
                    { 20484, 2, "Школа им. Каргеля и Бедекера" },
                    { 40032, 2, "Школа им. Сухомлинского" },
                    { 20694, 2, "Школа иностранных языков «Forward»" },
                    { 22294, 2, "Школа Института богословия и философии (ИБиФ)" },
                    { 3189, 2, "Школа Института специальной педагогики и психологии (ИСПиП)" },
                    { 21598, 2, "Школа интегрированного обучения" },
                    { 6394, 2, "Школа интеллектуального развития им. О. Андреева" },
                    { 20877, 2, "Школа искусств «Кантилена»" },
                    { 6001, 2, "Школа искусств «На Васильевском»" },
                    { 7773, 2, "Школа искусств им. А. П. Бородина" },
                    { 18061, 2, "Школа искусств им. Бортнянского" },
                    { 18997, 2, "Школа искусств им. Свиридова" },
                    { 13164, 2, "Школа искусств Красносельского района" },
                    { 4607, 2, "Школа каратэ «Иппон»" },
                    { 1748260, 2, "Школа Кино и Фотографии" },
                    { 1661712, 2, "Школа маникюра «Rich Art Nail School»" },
                    { 2482, 2, "Школа творчества при ДДЮТ Фрунзенского района" },
                    { 12140, 2, "Школа театра, телевидения и шоу-бизнеса (ШТТиШБ)" },
                    { 1742142, 2, "Школа телевидения (СПбШТ)" },
                    { 7246, 2, "Экономико-технологический колледж питания (СПбЭТКП)" },
                    { 22809, 2, "Экономическая гимназия" },
                    { 18253, 2, "Экономический колледж" },
                    { 22112, 2, "Экономический лицей МБИ" },
                    { 725532, 2, "Экономический профессиональный лицей (ЭПЛ)" },
                    { 1672109, 2, "Электрогитарная школа «Rock Realm»" },
                    { 18665, 2, "Электромашиностроительный колледж (бывш. ЭМПЛ)" },
                    { 23210, 2, "Электромеханический колледж (СПЭМК, бывш. ЛЭМТ)" },
                    { 23386, 2, "Электротехнический колледж (СПЭТК, ФСО ГУАП)" },
                    { 12046, 2, "Энергетический техникум (СПЭТ)" },
                    { 44406, 2, "Юношеская астрономическая школа (ЮАШ)" },
                    { 10960, 2, "Юношеская математическая школа (ЮМШ)" },
                    { 17439, 2, "Юношеская техническая школа  «Techno Olympus» СПбГЭТУ «ЛЭТИ»" },
                    { 246234, 2, "Юношеский клуб космонавтики им. Г. С. Титова" },
                    { 63448, 2, "Языковой центр «Glory School»" },
                    { 6190, 2, "Экономико-технологический колледж им. Д. И. Менделеева (СПбЭТК)" },
                    { 111787, 2, "Экономико-правовой колледж Института экономики и права (ЭПК ИЭП)" },
                    { 19888, 2, "Экономико-математическая школа при ЭФ СПбГУ (ЭМШ)" },
                    { 1752413, 2, "Эколого-биологический центр «Крестовский остров»" },
                    { 294191, 2, "Школа телевидения и рекламы" },
                    { 1036076, 2, "Школа техников при СПбВМИ" },
                    { 1012075, 2, "Школа фигурного катания «Невский лёд»" },
                    { 1767164, 2, "Школа фитнеса «Анатомия»" },
                    { 1732497, 2, "Школа фитнеса и бодибилдинга Павла Ершова" },
                    { 1723154, 2, "Школа художников-оформителей при Доме политпросвещения" },
                    { 16602, 2, "Школа чтецов" },
                    { 10204, 2, "Школа им. Горчакова" },
                    { 1779311, 2, "Школа экономики и права" },
                    { 1541357, 2, "Школа ювелирного мастерства (ШЮМ)" },
                    { 18692, 2, "Школа юнг" },
                    { 1708681, 2, "Школа юного журналиста при СПбГУ" },
                    { 1658758, 2, "Школа-студия парикмахерского искусства Андрея Калецкого" },
                    { 1675473, 2, "Школа-студия СПб Консерватории им. Н. А. Римского-Корсакова" },
                    { 10933, 2, "Школьный центр Эрмитажа" },
                    { 1779286, 2, "Эврика-лицей" },
                    { 1759300, 2, "Школа эффективного фитнеса и управления «КОРУС»" },
                    { 1665956, 2, "Школа здоровья и индивидуального развития" },
                    { 1041411, 2, "Школа единоборств «ДоМо»" },
                    { 1774795, 2, "Школа дизайна интерьера Арт Этаж (Design School Арт Этаж)" },
                    { 438, 2, "Школа «Гуманитарий»" },
                    { 11951, 2, "Школа «Деловая волна»" },
                    { 8739, 2, "Школа «Дельта»" },
                    { 21907, 2, "Школа «Дипломат»" },
                    { 351, 2, "Школа «Доверие»" },
                    { 7369, 2, "Школа «Интеллект»" },
                    { 18032, 2, "Школа «Интеркаспий»" },
                    { 16487, 2, "Школа «Космос»" },
                    { 7179, 2, "Школа «Крошка»" },
                    { 9661, 2, "Школа «Лад»" },
                    { 293, 2, "Школа «Лидер»" },
                    { 3688, 2, "Школа «Логос»" },
                    { 15604, 2, "Школа «Маэстро»" },
                    { 7609, 2, "Школа «Менахем»" },
                    { 19029, 2, "Школа «Мирт»" },
                    { 21774, 2, "Школа «Гранд»" },
                    { 350, 2, "Школа «Гран»" },
                    { 8805, 2, "Школа «Грааль»" },
                    { 19597, 2, "Школа «Гешер»" },
                    { 1779033, 2, "Центр эстетического воспитания детей и молодежи «Центр на Брянцева»" },
                    { 22575, 2, "Церковно-приходская школа (ЦПШ)" },
                    { 1356, 2, "Частная школа «Эпишкола»" },
                    { 1764561, 2, "Частная школа ЦОДИВ" },
                    { 1765689, 2, "Частная школа-экстернат «Сфера»" },
                    { 1769444, 2, "Школа «Аксон у Академической»" },
                    { 21723, 2, "Школа «Альянс Франсез»" },
                    { 17160, 2, "Школа «Надежда»" },
                    { 17287, 2, "Школа «Андрейка»" },
                    { 13323, 2, "Школа «Артфутуре»" },
                    { 19908, 2, "Школа «Взмах»" },
                    { 22690, 2, "Школа «Виноградная лоза»" },
                    { 5918, 2, "Школа «Вундеркинд»" },
                    { 8929, 2, "Школа «Гарант»" },
                    { 23084, 2, "Школа «Гармония»" },
                    { 11850, 2, "Школа «Геликон»" },
                    { 12772, 2, "Школа «Арсвиктум»" },
                    { 1779024, 2, "Центр технического творчества Адмиралтейского района" },
                    { 1681740, 2, "Школа «Непоседы»" },
                    { 20241, 2, "Школа «Обучение в диалоге» (ШОД)" },
                    { 4815, 2, "Школа «Экстерн»" },
                    { 22057, 2, "Школа «Эпиграф»" },
                    { 9499, 2, "Школа «Ювента»" },
                    { 12621, 2, "Школа «Юнона»" },
                    { 1757572, 2, "Школа английского языка EF English First" },
                    { 1773449, 2, "Школа английского языка Speak Up" },
                    { 493703, 2, "Школа бизнеса (СПбШБ)" },
                    { 16010, 2, "Школа бизнеса Международной академии образования взрослых (ШБ МАОВ)" },
                    { 22896, 2, "Школа бизнеса экономического факультета СПбГУ" },
                    { 1772012, 2, "Школа Вероники Калачевой" },
                    { 1764789, 2, "Школа вина «Энотрия»" },
                    { 18656, 2, "Школа вожатых" },
                    { 1740791, 2, "Школа вокала Ольги Сафроновой" },
                    { 1758844, 2, "Школа делового английского «BIS»" },
                    { 1710730, 2, "Школа дизайна «Divina Harmonia»" },
                    { 9951, 2, "Школа «Экспресс»" },
                    { 12583, 2, "Школа «Чукоккала»" },
                    { 7573, 2, "Школа «Успех»" },
                    { 2133, 2, "Школа «Унисон»" },
                    { 14601, 2, "Школа «Олис»" },
                    { 19559, 2, "Школа «Пансион»" },
                    { 9113, 2, "Школа «ПАСКАЛЬ ЛИЦЕЙ»" },
                    { 4466, 2, "Школа «Петербургский стандарт»" },
                    { 8037, 2, "Школа «Плюс»" },
                    { 22482, 2, "Школа «Поколение»" },
                    { 16865, 2, "Школа «Праздник плюс»" },
                    { 1720897, 2, "Школа «Новое поколение»" },
                    { 15442, 2, "Школа «Рид»" },
                    { 7477, 2, "Школа «Росинка»" },
                    { 18020, 2, "Школа «Рост»" },
                    { 16800, 2, "Школа «Синяя птица»" },
                    { 14879, 2, "Школа «Студиум» (бывш. «Открытые окна»)" },
                    { 1693, 2, "Школа «Талант»" },
                    { 17434, 2, "Школа «Тет-а-тет»" },
                    { 8583, 2, "Школа «Тутти»" },
                    { 17801, 2, "Школа «Родник»" },
                    { 8388, 2, "Музыкальный театр «Карамболь»" },
                    { 5450, 2, "Музыкальный лицей при Комитете по культуре" },
                    { 20031, 2, "Музыкальный лицей «Кикины палаты»" },
                    { 1201, 2, "Гимназия «Радуга»" },
                    { 1671536, 2, "Гимназия «Северная Венеция»" },
                    { 19558, 2, "Гимназия «Шанс»" },
                    { 9648, 2, "Гимназия «Элита»" },
                    { 1600076, 2, "Гимназия «Эрудит»" },
                    { 149365, 2, "Гимназия Академии права и бизнеса (АПБ)" },
                    { 1759286, 2, "Гимназия им. Александра Невского" },
                    { 7415, 2, "Гимназия Института экономики и права (ИЭиП)" },
                    { 1772864, 2, "Городская радиотехническая школа ДОСААФ" },
                    { 20381, 2, "Городская художественная школа (ГХШ)" },
                    { 18467, 2, "Городской дворец творчества юных (ГДТЮ)" },
                    { 1751521, 2, "Государственные курсы иностранных языков и профессионального обучения" },
                    { 1746140, 2, "Гуманитарный колледж БИЭПП" },
                    { 19616, 2, "Дворец детского (юношеского) творчества «На Ленской»" },
                    { 16970, 2, "Дворец детского (юношеского) творчества Кировского района" },
                    { 1383, 2, "Гимназия «Преображение»" },
                    { 19030, 2, "Дворец детского (юношеского) творчества Красногвардейского района" },
                    { 6, 2, "Гимназия «Немецкая гимназия «Петершуле»" },
                    { 2494, 2, "Гимназия «Лингва»" },
                    { 1325143, 2, "Балетная и театральная школа им. Л. В. Якобсона" },
                    { 885, 2, "Балтика-колледж" },
                    { 186, 2, "Банковский колледж Банка России (бывш. Банковская школа ЦБРФ, ЛУКТ)" },
                    { 1781524, 2, "Банковский колледж НИУ ВШЭ" },
                    { 1656221, 2, "Британская школа «ILA Aspect»" },
                    { 23251, 2, "Валеологическая школа «Стерх»" },
                    { 18272, 2, "Вальдорфский центр искусства воспитания (ВЦИВ)" },
                    { 15771, 2, "Вечерняя школа Петроградского района" },
                    { 969864, 2, "Вторая Санкт-Петербургская Гимназия" },
                    { 23609, 2, "Высшая банковская школа (ВБШ)" },
                    { 1762672, 2, "Высшая школа кинематографического мастерства (ВШКМ)" },
                    { 102705, 2, "Высшая школа моды и прикладного творчества (ВПШМиПТ)" },
                    { 1763632, 2, "Высшая школа психосоциальных технологий управления" },
                    { 1743526, 2, "Гёте-институт (Goethe-Institut)" },
                    { 1470, 2, "Гимназия «Альма Матер»" },
                    { 21170, 2, "Гимназия «Мигдаль Ор»" },
                    { 98077, 2, "Дворец детского (юношеского) творчества Московского района" },
                    { 7772, 2, "Дворец детского (юношеского) творчества Фрунзенского района" },
                    { 97947, 2, "Дворец детского (юношеского) творчества Центрального района" },
                    { 16076, 2, "Детско-юношеская спортивная школа олимпийского резерва «Буревестник»" },
                    { 1470049, 2, "Детско-юношеская спортивная школа олимпийского резерва «ВоВиС»" },
                    { 129640, 2, "Детско-юношеская спортивная школа олимпийского резерва «Звезда»" },
                    { 16377, 2, "Детско-юношеская спортивная школа олимпийского резерва «Локомотив»" },
                    { 296188, 2, "Детско-юношеская спортивная школа олимпийского резерва «Орлёнок»" },
                    { 32704, 2, "Детско-юношеская спортивная школа олимпийского резерва «Радуга»" },
                    { 17388, 2, "Детско-юношеская спортивная школа олимпийского резерва «Фристайл»" },
                    { 13115, 2, "Детско-юношеская спортивная школа олимпийского резерва «Юность»" },
                    { 15530, 2, "Детско-юношеская спортивная школа олимпийского резерва Адмиралтейского района" },
                    { 8239, 2, "Детско-юношеская спортивная школа олимпийского резерва Выборгского района" },
                    { 1656222, 2, "Детско-юношеская спортивная школа олимпийского резерва Калининского района по художественной гимнастике" },
                    { 23544, 2, "Детско-юношеская спортивная школа олимпийского резерва Кировского района" },
                    { 13451, 2, "Детско-юношеская спортивная школа олимпийского резерва Кировского района по легкой атлетике" },
                    { 287018, 2, "Детско-юношеская спортивная школа олимпийского резерва Куйбышевского района по спортивной акробатике" },
                    { 287012, 2, "Детско-юношеская спортивная школа олимпийского резерва Невского района" },
                    { 18090, 2, "Детско-юношеская спортивная школа Красносельского района" },
                    { 10219, 2, "Детско-юношеская спортивная школа им. Алексеева" },
                    { 16427, 2, "Детско-юношеская спортивная школа «Экран»" },
                    { 18088, 2, "Детско-юношеская спортивная школа «Рубин»" },
                    { 22145, 2, "Дворец детского и юношеского творчества Выборгского района" },
                    { 1669884, 2, "Дворец культуры им. А. М. Горького" },
                    { 13781, 2, "Дворец культуры им. Ленсовета" },
                    { 1681742, 2, "Дворец творчества «У Вознесенского моста»" },
                    { 1770953, 2, "Дворец творчества детей и молодежи «Молодежный творческий Форум Китеж плюс»" },
                    { 409653, 2, "Дворец учащейся молодежи" },
                    { 1776602, 2, "Державинский институт" },
                    { 20946, 2, "Архитектурно-строительный колледж (СПАСК, бывш. ЛСАТ)" },
                    { 1762096, 2, "Детская консерватория XXI века" },
                    { 1779011, 2, "Детский оздоровительно-образовательный туристский центр «Балтийский берег»" },
                    { 1767882, 2, "Детский сад «Улыбка»" },
                    { 1689578, 2, "Детский хор телевидения и радио Санкт-Петербурга" },
                    { 314697, 2, "Детско-юношеская спортивная школа «Вдохновение»" },
                    { 52526, 2, "Детско-юношеская спортивная школа «Динамо»" },
                    { 18031, 2, "Детско-юношеская спортивная школа «Знамя»" },
                    { 21031, 2, "Детско-юношеская спортивная школа «Лидер»" },
                    { 1776986, 2, "Детский музыкальный лекторий «Пикколо»" },
                    { 23513, 2, "Аничков лицей" },
                    { 899379, 2, "Англо-Американская школа (Anglo-American School of St. Petersburg)" },
                    { 4370, 2, "Акушерский колледж" },
                    { 244218, 2, "Вечерняя школа № 671" },
                    { 112536, 2, "Начальная школа – детский сад № 672" },
                    { 112537, 2, "Начальная школа – детский сад № 673" },
                    { 112540, 2, "Прогимназия № 675 «Талант»" },
                    { 286992, 2, "Прогимназия № 677" },
                    { 112542, 2, "Школа № 678" },
                    { 112543, 2, "Школа № 679" },
                    { 2527, 2, "Школа № 680" },
                    { 269192, 2, "Школа № 682" },
                    { 21987, 2, "Школа № 683" },
                    { 2643, 2, "Школа № 684" },
                    { 269195, 2, "Школа № 685" },
                    { 269197, 2, "Школа № 686" },
                    { 269198, 2, "Школа № 687" },
                    { 4311, 2, "Школа № 688" },
                    { 6553, 2, "Школа № 670" },
                    { 663, 2, "Школа № 667" },
                    { 36048, 2, "Школа № 665" },
                    { 10397, 2, "Лицей № 664" },
                    { 1612, 2, "Школа № 645 (до 2005 г.)" },
                    { 382, 2, "Школа № 645 (бывш. № 33)" },
                    { 112352, 2, "Начальная школа – детский сад № 646" },
                    { 5176, 2, "Школа № 647 «Тайми»" },
                    { 9090, 2, "Гимназия № 649" },
                    { 34, 2, "Гимназия № 652" },
                    { 58452, 2, "Школа-интернат № 652" },
                    { 16840, 2, "Школа № 689" },
                    { 265, 2, "Школа № 653" },
                    { 16688, 2, "Школа № 655" },
                    { 42201, 2, "Школа № 657" },
                    { 5648, 2, "Школа № 658" },
                    { 3407, 2, "Школа № 659" },
                    { 25920, 2, "Школа № 660" },
                    { 487, 2, "Школа № 661" },
                    { 112203, 2, "Школа № 663" },
                    { 1320, 2, "Школа № 654 «Хореография»" },
                    { 10595, 2, "Детско-юношеская спортивная школа олимпийского резерва по единоборствам ФСО «Юность России»" },
                    { 1763194, 2, "Школа № 690" },
                    { 325, 2, "Школа № 692" },
                    { 6907, 2, "Адмиралтейский гуманитарный колледж" },
                    { 1, 2, "Академическая гимназия (АГ) СПбГУ" },
                    { 9255, 2, "Академические классы" },
                    { 21764, 2, "Академический художественный лицей им. Иогансона при РАХ (СПГАХЛ, бывш. СХШ)" },
                    { 1773971, 2, "Академия восточных языков и культуры «Конфуций»" },
                    { 1757015, 2, "Академия документальной фотографии и фотожурналистики «Фотографика»" },
                    { 10179, 2, "Академия индустрии красоты «Локон» (бывш. Колледж «Локон»)" },
                    { 1775722, 2, "Академия информатики и программирования (АИП)" },
                    { 1776623, 2, "Академия машиностроения им. Ж. Я. Котина" },
                    { 7074, 2, "Академия медико-социального управления" },
                    { 1701980, 2, "Академия молодых оперных певцов Мариинского театра" },
                    { 13574, 2, "Академия русского балета им. А. Я. Вагановой" },
                    { 1733746, 2, "Академия танца Бориса Эйфмана" },
                    { 36435, 2, "Академия транспортных технологий (бывш. Автотранспортный и электромеханический колледж, ЛАТТ)" },
                    { 1771664, 2, "Академия управления городской средой, градостроительства и печати" },
                    { 1705589, 2, "Автошкола ДОСААФ" },
                    { 63449, 2, "Автошкола «ШВВМ»" },
                    { 1769428, 2, "Автошкола «Чемпион»" },
                    { 1732472, 2, "Автошкола «ТУР»" },
                    { 269203, 2, "Школа № 695" },
                    { 112544, 2, "Школа № 696" },
                    { 18153, 2, "Вечерняя школа № 697" },
                    { 11327, 2, "Школа № 698" },
                    { 792, 2, "Школа № 700" },
                    { 10753, 2, "Школа № 748" },
                    { 178754, 2, "Школа тренеров при СПбГИФК им. Лесгафта (до 1975)" },
                    { 1778059, 2, "Школа № 691" },
                    { 100556, 2, "Школа «Петербургский этикет» (до 2000 г.)" },
                    { 21553, 2, "Авиационно-транспортный колледж Гражданской авиации (СПАТКГА, ЛАТУГА)" },
                    { 22621, 2, "Автошкола «Берилл»" },
                    { 13113, 2, "Автошкола «ВАД»" },
                    { 1269412, 2, "Автошкола «Ладога»" },
                    { 287206, 2, "Автошкола «Мустанг»" },
                    { 63446, 2, "Автошкола «Перспектива»" },
                    { 11733, 2, "Автошкола «РОСТО»" },
                    { 20287, 2, "Лицей сервиса и индустриальных технологий (бывш. ПУ № 70)" },
                    { 23790, 2, "Детско-юношеская спортивная школа олимпийского резерва по прыжкам в воду" },
                    { 23789, 2, "Детско-юношеская спортивная школа олимпийского резерва по спортивной гимнастике" },
                    { 360867, 2, "Детско-юношеская спортивная школа олимпийского резерва по фехтованию «Спартак»" },
                    { 5199, 2, "Лицей «Новая школа» при ИВЭСЭП" },
                    { 13996, 2, "Лицей «Перспектива»" },
                    { 1475, 2, "Лицей «Санкт-Петербург»" },
                    { 19032, 2, "Лицей Академии права и бизнеса (АПБ)" },
                    { 19476, 2, "Лицей искусств «Санкт-Петербург»" },
                    { 20771, 2, "Лицей СПбГУТ им. Бонч-Бруевича" },
                    { 658619, 2, "Малая академия искусств (МАИ)" },
                    { 4093, 2, "Малая экономическая академия (МЭА)" },
                    { 19262, 2, "Машиностроительный колледж" },
                    { 11252, 2, "Медико-технический колледж (СПМТК, бывш. СПбКМЭиО)" },
                    { 1056, 2, "Медицинская гимназия" },
                    { 14329, 2, "Медицинский колледж ВМедА им. Кирова" },
                    { 112065, 2, "Медицинский колледж ПГУПС (бывш. ОЖД)" },
                    { 23294, 2, "Медицинский колледж при СПбГПМА" },
                    { 817186, 2, "Медицинский колледж СПбГУ" },
                    { 20490, 2, "Лицей «Интер-Хаус»" },
                    { 22414, 2, "Лицей «Аристос»" },
                    { 214821, 2, "Ленинградское речное училище" },
                    { 1723153, 2, "Ленинградское военно-морское подготовительное училище (ЛВМПУ)" },
                    { 1777430, 2, "Компания «Амлаб» (Amlab)" },
                    { 1770490, 2, "Компьютерная Академия ШАГ" },
                    { 13097, 2, "Кооперативный техникум Леноблпотребсоюза (КТ ЛОСПО)" },
                    { 749438, 2, "Культурный центр «Троицкий»" },
                    { 20305, 2, "Курсы переподготовки «Экономика-Альма»" },
                    { 21004, 2, "Лаборатория непрерывного математического образования (ЛНМО)" },
                    { 1772010, 2, "Лекторий Государственного Эрмитажа" },
                    { 707077, 2, "Медицинское училище при БКЦББ им. Г. И. Чудновского" },
                    { 1723239, 2, "Ленинградская областная заочная средняя школа (ЛОЗСОШ)" },
                    { 121176, 2, "Ленинградский областной детский дом музыкального воспитания им. Н. А. Римского-Корсакова" },
                    { 21689, 2, "Ленинградский областной колледж культуры и искусств (ЛОККиИ)" },
                    { 377546, 2, "Ленинградский областной медицинский техникум" },
                    { 492309, 2, "Ленинградский сварочно-машиностроительный техникум (ЛСМТ)" },
                    { 312496, 2, "Ленинградский техникум целлюлозно-бумажной и деревообрабатывающей промышленности (ЛТЦБДП)" },
                    { 1698215, 2, "Ленинградский химико-механический техникум" },
                    { 114738, 2, "Ленинградское арктическое училище (ЛАУ)" },
                    { 18972, 2, "Ленинградский машиностроительный техникум им. Ж. Я. Котина (ЛМТ)" },
                    { 17695, 2, "Колледж экономики и управления НОИР" },
                    { 215306, 2, "Медицинское училище при НИИ онкологии" },
                    { 40061, 2, "Медицинское училище при СПбГМУ им. Павлова" },
                    { 7145, 2, "Музыкальная школа «Вдохновение»" },
                    { 22258, 2, "Музыкальная школа «Юность»" },
                    { 5907, 2, "Музыкальная школа ДК Газа" },
                    { 287261, 2, "Музыкальная школа ДК им. Кирова" },
                    { 26777, 2, "Музыкальная школа им. А. К. Глазунова" },
                    { 22725, 2, "Музыкальная школа им. Андрея Петрова" },
                    { 8545, 2, "Музыкальная школа им. В. В. Андреева" },
                    { 157429, 2, "Музыкальная школа им. Н. А. Римского-Корсакова" },
                    { 8361, 2, "Музыкальная школа им. С. С. Ляховицкой" },
                    { 112258, 2, "Музыкальная школа при СПбНК им. Бершадского" },
                    { 1968, 2, "Музыкально-гуманитарная гимназия" },
                    { 109160, 2, "Музыкально-гуманитарный (вечерний) колледж" },
                    { 1777469, 2, "Музыкально-просветительский колледж им. Б. И. Тищенко" },
                    { 2106, 2, "Музыкальное училище им. Мусоргского" },
                    { 32692, 2, "Музыкальное училище им. Н. А. Римского-Корсакова" },
                    { 1761984, 2, "Музыкальная школа Rock&amp;Pop" },
                    { 1780821, 2, "Московский Гештальт Институт" },
                    { 109912, 2, "Морской рыбопромышленный колледж (СПбМРК)" },
                    { 18515, 2, "Морской клуб «Юнга»" },
                    { 1756680, 2, "Международная Академия Музыки Елены Образцовой" },
                    { 831901, 2, "Международная детская академия художеств (МеДетАХ «Авангард»)" },
                    { 3119, 2, "Международная школа Герценовского университета (МШГУ)" },
                    { 489293, 2, "Международная школа дизайна" },
                    { 6747, 2, "Международная школа иностранных языков Benedict School" },
                    { 1766389, 2, "Международная школа флористов-дизайнеров «ПЛАНТА-А»" },
                    { 1779514, 2, "Международный институт развивающего транзактного анализа" },
                    { 15748, 2, "Медицинское училище при СПбГМА им. Мечникова" },
                    { 1596758, 2, "Международный учебный центр парикмахерского искусства и эстетики «Май»" },
                    { 1779346, 2, "Международный языковой центр Language Link" },
                    { 489300, 2, "Межшкольный учебный комбинат Выборгского района" },
                    { 3344, 2, "Механико-приборостроительный колледж (СПМПК)" },
                    { 215316, 2, "Механико-технологический техникум лёгкой промышленности" },
                    { 186224, 2, "Монтессори-школа Михайловой" },
                    { 1758644, 2, "Морская школа Московского района" },
                    { 11931, 2, "Морская школа РОСТО" },
                    { 1773970, 2, "Международный Центр Кинопрофессий" },
                    { 1781501, 2, "Японский центр «Сакура»" },
                    { 8919, 2, "Колледж экономики и права «Метроном»" },
                    { 132441, 2, "Колледж фитнеса и бодибилдинга им. Бена Вейдера" },
                    { 1771922, 2, "ЕГЭ-Центр «Пять с плюсом»" },
                    { 1752286, 2, "Епархиальные курсы религиозного образования и катехизации им. святого праведного Иоанна Кронштадтского при Отделе религиозног" },
                    { 1671463, 2, "Естественно-научный лицей СПбПУ" },
                    { 1718769, 2, "Ешива «Томхей Тмимим Любавич»" },
                    { 22800, 2, "Издательско-полиграфический техникум (СПбГИПТ)" },
                    { 55394, 2, "Индустриально-педагогический колледж" },
                    { 15517, 2, "Индустриальный техникум" },
                    { 17386, 2, "Индустриальный техникум строительных материалов и деталей (СПИТСМиД)" },
                    { 11282, 2, "Инженерная школа одежды (ИШО, бывш. ЛТЛП)" },
                    { 109834, 2, "Инновационно-образовательный центр «Северная столица»" },
                    { 1782295, 2, "Институт глубинной психологии" },
                    { 1776072, 2, "Институт информационных технологий (НОУ ИИТ)" },
                    { 20647, 2, "Институт информационных технологий «Сегрис»" },
                    { 1778906, 2, "Институт клинической прикладной кинезиологии" },
                    { 1778391, 2, "Институт Коучинга" },
                    { 33605, 2, "Духовой оркестр СПбГДТЮ" },
                    { 11320, 2, "Дом творчества «Измайловский»" },
                    { 1770954, 2, "Дом детства и юношества Приморского района" },
                    { 1770859, 2, "Дом детского творчества Приморского района" },
                    { 13361, 2, "Детско-юношеская спортивная школа олимпийского резерва по футболу «Смена»" },
                    { 100533, 2, "Детско-юношеская спортивная школа олимпийского резерва по шашкам и шахматам" },
                    { 52529, 2, "Детско-юношеская спортивная школа олимпийского резерва СКА по хоккею" },
                    { 760549, 2, "Детско-юношеская спортивная школа олимпийского резерва Центрального района по художественной гимнастике" },
                    { 19311, 2, "Детско-юношеская спортивная школа Петроградского района" },
                    { 1687340, 2, "Детско-юношеская спортивная школа плавания «Дельфин»" },
                    { 102802, 2, "Детско-юношеский футбольный коллектив «Дружба»" },
                    { 1761958, 2, "Институт культурных программ" },
                    { 1779026, 2, "Детско-юношеский центр «Васильевский остров»" },
                    { 1779028, 2, "Дом детского творчества «Олимп»" },
                    { 1779289, 2, "Дом детского творчества «Преображенский»" },
                    { 1779029, 2, "Дом детского творчества «Современник»" },
                    { 1752252, 2, "Дом детского творчества «Союз»" },
                    { 1779030, 2, "Дом детского творчества «Юность»" },
                    { 1779035, 2, "Дом детского творчества Калининского района" },
                    { 1779347, 2, "Дом детского творчества Красносельского района" },
                    { 1779079, 2, "Детско-юношеский центр «Красногвардеец»" },
                    { 23636, 2, "Колледж холодильной промышленности (СПбКХП)" },
                    { 1776071, 2, "Институт недвижимости (НОУ ИН)" },
                    { 6730, 2, "Институт повышения квалификации и переподготовки (ИПКП вузов при СПбГУ)" },
                    { 112064, 2, "Колледж ИСД при СПбГМУ им. Павлова" },
                    { 8214, 2, "Колледж морского приборостроения (СПКМП)" },
                    { 7341, 2, "Колледж отраслевых технологий «Краснодеревец»" },
                    { 11379, 2, "Колледж Петербургской моды (бывш. ПЛПМ)" },
                    { 215262, 2, "Колледж пищевой промышленности" },
                    { 1513889, 2, "Колледж практической экономики компании «Век»" },
                    { 8395, 2, "Колледж социально-экономического образования (КСЭО)" },
                    { 1698201, 2, "Колледж СПбУТУиЭ (СПбУУЭ)" },
                    { 22091, 2, "Колледж строительной индустрии и городского хозяйства (КСИиГХ, бывш. ЛИТСМД)" },
                    { 109149, 2, "Колледж телекоммуникаций при СПбГУТ им. Бонч-Бруевича (СПбКТ, бывш. ЛЭТС им. Кренкеля)" },
                    { 23272, 2, "Колледж технологии, моделирования и управления (КТМУ СПбГУПТД)" },
                    { 19930, 2, "Колледж туризма и гостиничного сервиса (КТГС, бывш. БТК, Лицей «Сервис»)" },
                    { 15041, 2, "Колледж управления и экономики «Александровский лицей»" },
                    { 8732, 2, "Колледж факультета экономики и менеджмента СПбГПУ" },
                    { 11468, 2, "Колледж физической культуры и спорта, экономики и технологий (КФКиСЭТ СПбГУ)" },
                    { 969, 2, "Колледж ГУМРФ им. Макарова (бывш. Колледж водного транспорта, Морской колледж)" },
                    { 499022, 2, "Колледж Высшей школы народных искусств" },
                    { 1771613, 2, "Колледж в Санкт-Петербургском государственном аграрном университете (СПбГАУ)" },
                    { 12641, 2, "Колледж Балтийской академии туризма и предпринимательства (БАТиП)" },
                    { 1767750, 2, "Институт практической психологии «Иматон»" },
                    { 1741812, 2, "Институт психологического консультирования «Новый век»" },
                    { 1778870, 2, "Институт психотерапии и консультирования «Гармония»" },
                    { 1762013, 2, "Институт спортивной и восстановительной медицины" },
                    { 15777, 2, "Кадетский корпус (СПб КК, бывш. КРАК, ВККК и КК ЖДВ МО РФ)" },
                    { 1766292, 2, "Кадетский корпус (школа IT-технологий) Военной академии связи" },
                    { 1719036, 2, "Кадетский пожарно-спасательный корпус СПб УГПС МЧС России" },
                    { 55403, 2, "Институт парикмахерского искусства и эстетики «Влада»" },
                    { 1781691, 2, "Казачий юнкерский православный гуманитарно-технический колледж" },
                    { 20510, 2, "Киношкола-студия «Кадр»" },
                    { 52544, 2, "Книготорговый техникум" },
                    { 1772225, 2, "Колледж «Звёздный»" },
                    { 10309, 2, "Колледж «Станкоэлектрон»" },
                    { 8468, 2, "Колледж авиационного приборостроения и автоматики (СПКАПиА, ФСПО ГУАП)" },
                    { 189125, 2, "Колледж автоматизации лесопромышленного производства (КАЛП)" },
                    { 12586, 2, "Колледж Академии гуманитарного образования (АГО)" },
                    { 40059, 2, "Киновидеотехнический колледж (СПб КВТК)" },
                    { 1743240, 2, "Японский центр в Санкт-Петербурге" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8361);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9661);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11733);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13361);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17801);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18665);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18972);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19262);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19559);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21774);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21972);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22690);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22896);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65922);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100533);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215262);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 296188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 328547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 362735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 377546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 409653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 492309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 493703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 499022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 534158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 658619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 699693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 707077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 725532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 746680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 749438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 750110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 760549);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 784634);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 817186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 831901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 855858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 899379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 969864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1012075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1036076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1041411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1046244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1096278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1269412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1325143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1470049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1513889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1523718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1541357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1596758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1600076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1612653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656221);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1658758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1669884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671463);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672109);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1673057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675445);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1681740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1681742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1689489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1689578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1695632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1701980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1707002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1708681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1710730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1719036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1732472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1732497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1740791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741812);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1748260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1753017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762096);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766389);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771922);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781691);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782295);
        }
    }
}
