using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class AddSamaraSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 202801, 123, "Школа №1" },
                    { 204883, 123, "Школа №176" },
                    { 20099, 123, "Школа №175" },
                    { 77130, 123, "Музыкальная школа №174" },
                    { 18220, 123, "Школа №174" },
                    { 210383, 123, "Школа №172" },
                    { 181684, 123, "Школа №171" },
                    { 204727, 123, "Школа №170" },
                    { 102398, 123, "Школа №169" },
                    { 30118, 123, "Школа №168" },
                    { 43360, 123, "Школа №167" },
                    { 24078, 123, "Школа №166" },
                    { 8088, 123, "Школа №165" },
                    { 14160, 123, "Школа №164" },
                    { 6479, 123, "Школа №163" },
                    { 16621, 123, "Школа №162" },
                    { 15238, 123, "Школа №161" },
                    { 320510, 123, "Школа №160" },
                    { 32673, 123, "Школа №157" },
                    { 14322, 123, "Школа №156" },
                    { 168852, 123, "Художественная школа №155" },
                    { 49548, 123, "Школа №155" },
                    { 3284, 123, "Школа №154" },
                    { 27405, 123, "Школа №153" },
                    { 127493, 123, "Школа №177" },
                    { 36373, 123, "Школа №178" },
                    { 853277, 123, "Детский сад №180 «Березка»" },
                    { 1341977, 123, "Детский сад №282" },
                    { 203636, 123, "Гимназия «Перспектива»" },
                    { 53674, 123, "Гимназия «Ор-Авнер»" },
                    { 150961, 123, "Военно-технический кадетский корпус (ВТКК)" },
                    { 259247, 123, "Ветеринарный техникум (СЗВТ)" },
                    { 18489, 123, "Вальдорфская школа (СВШ)" },
                    { 105179, 123, "Библейская школа" },
                    { 71290, 123, "Банковская школа (СБШ)" },
                    { 111299, 123, "Аэрокосмический лицей (СМАЛ)" },
                    { 1771428, 123, "Архитектурно-технический лицей АСИ СамГТУ" },
                    { 188650, 123, "Архитектурно-строительный лицей (СГАСЛ)" },
                    { 289289, 123, "Академия сервиса красоты" },
                    { 69795, 123, "Школа №152" },
                    { 104390, 123, "Автошкола РОСТО (ДОСААФ)" },
                    { 1687995, 123, "Авиационно-транспортный колледж (АТК СГАУ)" },
                    { 660115, 123, "Детский сад №462" },
                    { 1670623, 123, "Детский сад №423" },
                    { 263234, 123, "Детский сад №407" },
                    { 236503, 123, "Детский сад №386" },
                    { 250891, 123, "Детский сад №385 «Сказка»" },
                    { 286376, 123, "Детский сад №381" },
                    { 1663335, 123, "Детский сад №377 «Эрудит»" },
                    { 238851, 123, "Детский сад №333" },
                    { 870522, 123, "Детский сад №324" },
                    { 155784, 123, "Детский сад №318 «Рябинка»" },
                    { 144232, 123, "Авиационный техникум (СаАТ, бывш. КуАТ)" },
                    { 95261, 123, "Школа №151" },
                    { 17835, 123, "Школа №150" },
                    { 52463, 123, "Школа №149" },
                    { 37126, 123, "Школа №123" },
                    { 20673, 123, "Школа №122" },
                    { 699842, 123, "Детский сад №121" },
                    { 46306, 123, "Школа №121" },
                    { 7287, 123, "Школа №120" },
                    { 278808, 123, "Школа №119" },
                    { 12518, 123, "Школа №118" },
                    { 1710023, 123, "Профессиональное училище №117" },
                    { 171676, 123, "Школа №117" },
                    { 37206, 123, "Школа №116" },
                    { 1716, 123, "Лицей №114" },
                    { 5575, 123, "Школа №124" },
                    { 259878, 123, "Школа №114" },
                    { 41611, 123, "Школа №112" },
                    { 138920, 123, "Детский сад №111" },
                    { 1778651, 123, "Школа-интернат №111" },
                    { 50341, 123, "Школа №110" },
                    { 89809, 123, "Школа №109" },
                    { 13347, 123, "Школа №108" },
                    { 887712, 123, "Детский сад №107" },
                    { 31226, 123, "Школа №107" },
                    { 1313, 123, "Школа №106" },
                    { 191069, 123, "Школа №105" },
                    { 223945, 123, "Школа №104" },
                    { 63928, 123, "Школа №113" },
                    { 49079, 123, "Гимназия «Радиант»" },
                    { 52509, 123, "Школа №125" },
                    { 8159, 123, "Школа №127" },
                    { 159098, 123, "Школа искусств №148" },
                    { 205070, 123, "Школа №148" },
                    { 286078, 123, "Школа №148 Учебно-воспитательный комплекс «Эксперимент»" },
                    { 108691, 123, "Школа №147" },
                    { 12519, 123, "Школа №146" },
                    { 20007, 123, "Школа №145" },
                    { 24804, 123, "Школа №144" },
                    { 94596, 123, "Школа №143" },
                    { 246040, 123, "Школа №142" },
                    { 18687, 123, "Школа №141" },
                    { 67594, 123, "Школа №140" },
                    { 53059, 123, "Школа №126" },
                    { 20868, 123, "Школа №139" },
                    { 67458, 123, "Школа №138" },
                    { 53465, 123, "Школа №137" },
                    { 193772, 123, "Школа №136" },
                    { 3812, 123, "Школа №135" },
                    { 105013, 123, "Школа №134" },
                    { 3054, 123, "Гимназия №133" },
                    { 9293, 123, "Школа №132" },
                    { 1343836, 123, "Лицей №131 «Созвездие»" },
                    { 180485, 123, "Школа №131" },
                    { 191803, 123, "Школа №129" },
                    { 51232, 123, "Школа №128" },
                    { 136944, 123, "Профессионально-техническое училище №138" },
                    { 52433, 123, "Школа №103" },
                    { 190418, 123, "Гимназия Института экономики и права (ИЭиП)" },
                    { 74707, 123, "Дворец детского и юношеского творчества (СДДЮТ)" },
                    { 188837, 123, "Факультет довузовской подготовки при СамГМУ" },
                    { 123579, 123, "Училище олимпийского резерва (УОР)" },
                    { 256835, 123, "Учетно-кредитный техникум" },
                    { 120433, 123, "Торгово-экономический колледж (СТЭК)" },
                    { 127635, 123, "Техникум транспортного строительства" },
                    { 109197, 123, "Техникум промышленных технологий (СТПТ)" },
                    { 159892, 123, "Техникум легкой промышленности (СТЛП)" },
                    { 125740, 123, "Техникум космического машиностроения (СТКМ)" },
                    { 224335, 123, "Техникум городского хозяйства и строительных технологий (СТГХиСТ)" },
                    { 1598421, 123, "Техникум авиационного и промышленного машиностроения" },
                    { 72571, 123, "Татарская школа" },
                    { 1318991, 123, "Студия «Вундеркинд»" },
                    { 162902, 123, "Спортивный лицей (ССЛ)" },
                    { 1687309, 123, "Социально-экономический колледж (ССЭК)" },
                    { 185119, 123, "Социально-педагогический колледж (ССПК)" },
                    { 1766877, 123, "Самарское хореографическое училище (колледж)" },
                    { 686390, 123, "Самарский колледж сервиса производственного оборудования (бывш. СТСПО)" },
                    { 1778507, 123, "Самарский казачий кадетский корпус" },
                    { 1773171, 123, "Самарский кадетский корпус МВД России" },
                    { 160244, 123, "Речной техникум (СРТ)" },
                    { 1472600, 123, "Республиканский заочный автотранспортный техникум (РЗАТТ)" },
                    { 1762620, 123, "Региональный центр для одаренных детей (СРЦОД)" },
                    { 206840, 123, "Радиомеханический техникум" },
                    { 1764875, 123, "Факультет СПО СГЭУ" },
                    { 817172, 123, "Финансово-экономический колледж (СФЭК)" },
                    { 241950, 123, "Хореографическая школа" },
                    { 294546, 123, "Хореографическая школа «Карнавал»" },
                    { 105785, 123, "Экономический лицей (СЭЛ)" },
                    { 901781, 123, "Экономико-юридический техникум (БЭК)" },
                    { 149037, 123, "Экономико-технологический колледж питания (СЭТКП)" },
                    { 1729817, 123, "Школа современной фотографии «Photo Park School»" },
                    { 65039, 123, "Школа рабочей молодежи (ШРМ)" },
                    { 220726, 123, "Школа искусств «Импульс»" },
                    { 100544, 123, "Школа иностранных языков «English School»" },
                    { 73360, 123, "Школа английского языка «Language Link»" },
                    { 166152, 123, "Школа «Яктылык»" },
                    { 1663249, 123, "Школа «Элита»" },
                    { 50160, 123, "Школа «Эврика»" },
                    { 136714, 123, "Профессиональный лицей компьютерных технологий (ПЛКТ)" },
                    { 31299, 123, "Школа «Творчество»" },
                    { 68895, 123, "Школа «Радуга»" },
                    { 1777438, 123, "Школа «Потенциал»" },
                    { 237964, 123, "Школа «Лидер»" },
                    { 12833, 123, "Школа «Альтернатива»" },
                    { 108075, 123, "Швейный техникум" },
                    { 67225, 123, "Центральная музыкальная школа (ЦДМШ)" },
                    { 1761149, 123, "Центр внешкольной работы «Парус»" },
                    { 1772486, 123, "Центр внешкольного образования «Творчество»" },
                    { 55176, 123, "Художественное училище им. К. С. Петрова-Водкина (СХУ)" },
                    { 82364, 123, "Художественная школа при лиц. «Гармония мира»" },
                    { 171920, 123, "Художественная школа «Ренессанс»" },
                    { 130570, 123, "Школа «Сириус»" },
                    { 167739, 123, "Профессиональный лицей гостиничного и ресторанного сервиса" },
                    { 320196, 123, "Приборостроительный техникум" },
                    { 273585, 123, "Политехнический колледж (СПК)" },
                    { 224295, 123, "Лицей информационных технологий (СамЛИТ)" },
                    { 107453, 123, "Лицей авиационного профиля (ЛАП)" },
                    { 160697, 123, "Лицей «Технический» им. С. П. Королёва г. о. Самара (бывш. Технический лицей, СТЛ)" },
                    { 1960, 123, "Лицей «Престиж»" },
                    { 79235, 123, "Лицей «Гармония мира»" },
                    { 71282, 123, "Кооперативный техникум (СКТ)" },
                    { 260076, 123, "Колледж транспорта и коммуникаций (СКТК)" },
                    { 182039, 123, "Колледж строительства и предпринимательства (СКСП)" },
                    { 178048, 123, "Колледж сервисных технологий и дизайна (СГКСТД)" },
                    { 28536, 123, "Колледж сервиса МГУС / РГУТиС" },
                    { 266345, 123, "Колледж сервиса (СКС)" },
                    { 167563, 123, "Лицей моды и стиля" },
                    { 118602, 123, "Колледж связи (КС ПГАТИ, бывш. Политехникум связи)" },
                    { 105273, 123, "Колледж Самарского муниципального университета Наяновой (СМУН)" },
                    { 68747, 123, "Колледж железнодорожного транспорта им. А. А. Буянова (СТЖТ)" },
                    { 127439, 123, "Колледж бизнеса Аксенова" },
                    { 235751, 123, "Классический лицей (СКЛ)" },
                    { 153898, 123, "Издательско-полиграфический техникум (СГИПТ)" },
                    { 201886, 123, "Джазовая студия «Движение»" },
                    { 315363, 123, "Детский сад «Ягодка»" },
                    { 228409, 123, "Детский сад «Яблонька»" },
                    { 197230, 123, "Детский сад «Тополек»" },
                    { 1143460, 123, "Детский сад «Радонеж»" },
                    { 266374, 123, "Детский сад «Красавушки»" },
                    { 187959, 123, "Колледж Самарской гуманитарной академии (СаГА)" },
                    { 126830, 123, "Государственный колледж (СГК)" },
                    { 122738, 123, "Лицей философии планетарного гуманизма (ЛФПГ)" },
                    { 85576, 123, "Математическая школа при СГУ" },
                    { 536420, 123, "Поволжский экономико-юридический колледж (ПЭЮК)" },
                    { 1746918, 123, "Поволжский фармацевтический колледж" },
                    { 1778055, 123, "Поволжский строительно-энергетический колледж им. П. Мачнева" },
                    { 233219, 123, "Поволжский государственный колледж (ПГК, бывш. СГППК, КИПТ)" },
                    { 295249, 123, "Областной специальный лицей-интернат (ОблСЛИ)" },
                    { 128975, 123, "Областной педагогический лицей (СОПЛ)" },
                    { 150985, 123, "Областной многопрофильный лицей-интернат (СОМЛИ)" },
                    { 125127, 123, "Областной лицей-интернат милиции" },
                    { 196151, 123, "Областное училище культуры (СОУК)" },
                    { 181771, 123, "Областная юношеская автомобильная школа" },
                    { 253195, 123, "Областная физико-математическая школа (СОФМШ)" },
                    { 220351, 123, "Малая научно-инженерная академияпри СамГТУ (МНИА)" },
                    { 1751075, 123, "Национальный институт профессиональных бухгалтеров, финансовых менеджеров и экономистов" },
                    { 165608, 123, "Музыкальная школа при ОДО" },
                    { 264174, 123, "Музыкальная школа «Задумка»" },
                    { 289583, 123, "Музыкальная хореографическая студия" },
                    { 163133, 123, "Механико-технологический техникум (СМТТ)" },
                    { 68282, 123, "Металлургический колледж (СМК)" },
                    { 1721967, 123, "Медресе «Нур»" },
                    { 214174, 123, "Медицинский лицей (СМЛ)" },
                    { 78317, 123, "Медицинский колледж им. Ляпиной (СМК)" },
                    { 113359, 123, "Медико-технический лицей (СМТЛ)" },
                    { 195680, 123, "Медико-социальный колледж (СМСК)" },
                    { 72121, 123, "Машиностроительный колледж (СМК)" },
                    { 232686, 123, "Музыкальное училище им. Шаталова (СМУ)" },
                    { 8877, 123, "Школа №102" },
                    { 17952, 123, "Школа №101" },
                    { 3920, 123, "Школа №100" },
                    { 1666312, 123, "Школа искусств №12" },
                    { 273933, 123, "Профессиональный лицей №12" },
                    { 168035, 123, "Музыкальная школа №12" },
                    { 1733782, 123, "Вечерняя школа №12" },
                    { 32643, 123, "Школа №12" },
                    { 235026, 123, "Профессиональное училище №11" },
                    { 135057, 123, "Школа искусств №11" },
                    { 187961, 123, "Профессионально-техническое училище №11" },
                    { 194851, 123, "Детско-юношеская спортивная школа №11" },
                    { 158340, 123, "Музыкальная школа №11" },
                    { 175763, 123, "Гимназия №11 (международная  школа ЮНЕСКО)" },
                    { 204466, 123, "Школа №11" },
                    { 98927, 123, "Школа искусств №10 «Апрель»" },
                    { 86145, 123, "Профессионально-техническое училище №10" },
                    { 238990, 123, "Техникум кулинарного искусства (СТКИ, бывш. ПЛ 10)" },
                    { 254074, 123, "Детско-юношеская спортивная школа №10" },
                    { 171212, 123, "Специализированная детско-юношеская школа олимпийского резерва №10" },
                    { 201368, 123, "Музыкальная школа №10" },
                    { 1665959, 123, "Вечерняя школа №10 им. Н. Д. Кузнецова" },
                    { 75140, 123, "Лицей №10" },
                    { 38585, 123, "Школа №10" },
                    { 123002, 123, "Школа искусств №9" },
                    { 260678, 123, "Детско-юношеская спортивная школа №9" },
                    { 17090, 123, "Школа №13" },
                    { 148147, 123, "Лицей №13" },
                    { 12520, 123, "Музыкальная школа №13" },
                    { 52627, 123, "Школа искусств №13" },
                    { 125191, 123, "Школа №21" },
                    { 245016, 123, "Профессиональное училище №20" },
                    { 227412, 123, "Музыкальная школа №20" },
                    { 52399, 123, "Школа №20" },
                    { 109874, 123, "Профессионально-техническое училище №19" },
                    { 158186, 123, "Музыкальная школа №19" },
                    { 174447, 123, "Школа №19" },
                    { 21971, 123, "Музыкальная школа №18" },
                    { 137037, 123, "Школа №18" },
                    { 1343815, 123, "Школа искусств №17" },
                    { 260006, 123, "Детско-юношеская спортивная школа №17" },
                    { 315951, 123, "Специализированная детско-юношеская школа олимпийского резерва №9" },
                    { 174273, 123, "Специализированная детско-юношеская школа олимпийского резерва №17" },
                    { 98835, 123, "Школа №17" },
                    { 169851, 123, "Музыкальная школа №16" },
                    { 1556, 123, "Школа №16" },
                    { 181277, 123, "Школа искусств №15" },
                    { 12521, 123, "Музыкальная школа №15" },
                    { 214146, 123, "Лицей №15" },
                    { 54779, 123, "Школа №15" },
                    { 176145, 123, "Специализированная детско-юношеская школа олимпийского резерва №14" },
                    { 64624, 123, "Музыкальная школа №14" },
                    { 202296, 123, "Гимназия №14" },
                    { 203080, 123, "Школа №14" },
                    { 98134, 123, "Музыкальная школа №17" },
                    { 51233, 123, "Музыкальная школа №9" },
                    { 1664512, 123, "Школа-интернат №9" },
                    { 212565, 123, "Гимназия №9" },
                    { 32140, 123, "Художественная школа №3" },
                    { 96496, 123, "Музыкальная школа №3 им. М. И. Глинки" },
                    { 273276, 123, "Лицей №3" },
                    { 150651, 123, "Гимназия №3" },
                    { 50938, 123, "Школа №3" },
                    { 257833, 123, "Школа искусств №2" },
                    { 286820, 123, "Колледж №2" },
                    { 255679, 123, "Педагогический колледж №2 (СПК)" },
                    { 61429, 123, "Художественная школа №2" },
                    { 259958, 123, "Детско-юношеская спортивная школа №2" },
                    { 84323, 123, "Музыкальная школа №2" },
                    { 175154, 123, "Школа искусств №3" },
                    { 209272, 123, "Лицей №2" },
                    { 314758, 123, "Школа №2" },
                    { 103863, 123, "Школа искусств №1" },
                    { 138422, 123, "Профессионально-техническое училище №1" },
                    { 277767, 123, "Педагогический колледж №1 (СПК)" },
                    { 260757, 123, "Художественная школа №1 им. Зингера" },
                    { 121675, 123, "Специализированная детско-юношеская школа олимпийского резерва №1" },
                    { 315953, 123, "Детско-юношеская спортивная школа №1" },
                    { 75641, 123, "Музыкальная школа №1 им. Шостаковича" },
                    { 131748, 123, "Экспериментальная музыкально-хоровая школа-десятилетка (ЭМХШД №1)" },
                    { 111617, 123, "Лицей №1" },
                    { 312032, 123, "Гимназия №1" },
                    { 196672, 123, "Музыкально-математическая гимназия №2" },
                    { 56606, 123, "Музыкальная школа №21" },
                    { 200188, 123, "Школа №4" },
                    { 1334412, 123, "Школа-интернат №4" },
                    { 39637, 123, "Школа №9" },
                    { 248877, 123, "Школа искусств №8 «Радуга»" },
                    { 116220, 123, "Детско-юношеская спортивная школа №8" },
                    { 237995, 123, "Музыкальная школа №8" },
                    { 853276, 123, "Вечерняя школа №8" },
                    { 51206, 123, "Школа №8" },
                    { 237203, 123, "Школа искусств №7" },
                    { 30310, 123, "Музыкальная школа №7" },
                    { 200201, 123, "Школа №7" },
                    { 61423, 123, "Художественная школа №6" },
                    { 219403, 123, "Музыкальная школа №6" },
                    { 215806, 123, "Гимназия №4" },
                    { 94882, 123, "Школа-интернат №6" },
                    { 206161, 123, "Гимназия №6" },
                    { 188984, 123, "Физико-математическая школа при 6 факультете СГАУ" },
                    { 11536, 123, "Школа №6 им. Ломоносова" },
                    { 136190, 123, "Школа искусств №5" },
                    { 283045, 123, "Профессионально-техническое училище №5" },
                    { 53401, 123, "Специализированная детско-юношеская школа олимпийского резерва №5" },
                    { 242380, 123, "Детско-юношеская спортивная школа №5" },
                    { 126311, 123, "Музыкальная школа №5" },
                    { 242625, 123, "Школа №5" },
                    { 191584, 123, "Школа искусств №4" },
                    { 160947, 123, "Музыкальная школа №4" },
                    { 199216, 123, "Лицей №6" },
                    { 241402, 123, "Профессионально-техническое училище №21" },
                    { 15999, 123, "Школа №22" },
                    { 138697, 123, "Музыкальная школа №22" },
                    { 187835, 123, "Профессионально-техническое училище №76" },
                    { 295097, 123, "Лицей №76" },
                    { 16055, 123, "Школа №76" },
                    { 219550, 123, "Профессиональный лицей №75" },
                    { 27175, 123, "Школа №75" },
                    { 1713161, 123, "Профессиональное училище №74" },
                    { 24837, 123, "Школа №74" },
                    { 3506, 123, "Школа №73" },
                    { 29317, 123, "Школа №72" },
                    { 148651, 123, "Школа №71" },
                    { 1675559, 123, "Профессиональное училище №70" },
                    { 18030, 123, "Школа №77" },
                    { 27965, 123, "Школа №70" },
                    { 162893, 123, "Лицей №68" },
                    { 17567, 123, "Школа №68" },
                    { 110487, 123, "Школа №67" },
                    { 63575, 123, "Школа №66" },
                    { 36954, 123, "Школа №65" },
                    { 6782, 123, "Школа №64" },
                    { 168618, 123, "Музыкальная школа при шк. 63" },
                    { 14178, 123, "Школа №63" },
                    { 71316, 123, "Школа №62" },
                    { 52010, 123, "Школа №61" },
                    { 199455, 123, "Школа №60" },
                    { 9858, 123, "Школа №69" },
                    { 54973, 123, "Школа №59" },
                    { 2037, 123, "Школа №78" },
                    { 47397, 123, "Школа №80" },
                    { 52605, 123, "Школа №99" },
                    { 49052, 123, "Школа №98" },
                    { 231479, 123, "Профессиональное училище №97" },
                    { 77907, 123, "Школа №97" },
                    { 57444, 123, "Школа №96" },
                    { 3811, 123, "Школа №95" },
                    { 22132, 123, "Школа №94" },
                    { 221553, 123, "Школа №93" },
                    { 55303, 123, "Школа №92" },
                    { 4298, 123, "Школа №91" },
                    { 29785, 123, "Школа №90" },
                    { 35121, 123, "Школа №79" },
                    { 242979, 123, "Профессиональное училище №89" },
                    { 89808, 123, "Школа №88" },
                    { 50114, 123, "Школа №87" },
                    { 27877, 123, "Школа №86" },
                    { 67107, 123, "Гимназия №85" },
                    { 43240, 123, "Школа №85" },
                    { 131754, 123, "Дневной пансион-84" },
                    { 9932, 123, "Школа №84" },
                    { 34456, 123, "Школа №83" },
                    { 184019, 123, "Музыкальная школа №82" },
                    { 34263, 123, "Школа №82" },
                    { 14164, 123, "Школа №81" },
                    { 68185, 123, "Школа №89" },
                    { 1597180, 123, "Экономический техникум (СЭТ)" },
                    { 173019, 123, "Школа №58" },
                    { 17087, 123, "Школа №57" },
                    { 41678, 123, "Школа №37" },
                    { 32517, 123, "Лицей №36" },
                    { 316251, 123, "Школа №36" },
                    { 13936, 123, "Школа №35" },
                    { 238776, 123, "Профессиональное училище №34" },
                    { 53329, 123, "Школа №34" },
                    { 27866, 123, "Школа №33" },
                    { 16333, 123, "Школа №32" },
                    { 37890, 123, "Школа №31" },
                    { 32871, 123, "Школа №30" },
                    { 270762, 123, "Школа искусств №29" },
                    { 54676, 123, "Школа №38" },
                    { 172524, 123, "Школа №29" },
                    { 14175, 123, "Школа №28" },
                    { 165169, 123, "Профессиональный лицей №27" },
                    { 17496, 123, "Школа №27" },
                    { 98993, 123, "Школа №26" },
                    { 243274, 123, "Профессиональный лицей №25" },
                    { 14167, 123, "Школа №25" },
                    { 98633, 123, "Гимназия №24" },
                    { 14944, 123, "Школа №24" },
                    { 278548, 123, "Профессиональный лицей №23 (политехнический)" },
                    { 286271, 123, "Музыкальная школа №23" },
                    { 74349, 123, "Школа №23" },
                    { 1659490, 123, "Профессионально-техническое училище железнодорожного транспорта  №28" },
                    { 294095, 123, "Лицей №57" },
                    { 252119, 123, "Профессиональное училище №38" },
                    { 167600, 123, "Школа иностранных языков «Denis' School»" },
                    { 100723, 123, "Школа №56" },
                    { 39416, 123, "Школа №55" },
                    { 11450, 123, "Классическая гимназия №54 «Воскресение»" },
                    { 209963, 123, "Школа №53" },
                    { 89871, 123, "Гимназия №52" },
                    { 134013, 123, "Школа №52" },
                    { 61883, 123, "Школа №51" },
                    { 1470048, 123, "Профессиональное училище №50" },
                    { 15279, 123, "Школа №50" },
                    { 115503, 123, "Школа искусств №49" },
                    { 132505, 123, "Технологический колледж им. Н. Д. Кузнецова (бывш. Техникум аграрного и промышлен­ного сервиса (СОТАПС), ПЛ №49 и РСХТ)" },
                    { 52118, 123, "Школа №39" },
                    { 13842, 123, "Школа №49" },
                    { 28183, 123, "Школа №47" },
                    { 10779, 123, "Школа №46" },
                    { 45477, 123, "Школа №45" },
                    { 22601, 123, "Школа №44" },
                    { 176614, 123, "Гимназия №43" },
                    { 15407, 123, "Школа №43" },
                    { 179593, 123, "Лицей №42" },
                    { 29126, 123, "Школа №42" },
                    { 3141, 123, "Школа №41" },
                    { 254878, 123, "Профессионально-техническое училище №40" },
                    { 89355, 123, "Школа №40" },
                    { 15217, 123, "Школа №48" },
                    { 125678, 123, "Энергетический колледж (СЭК)" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3812);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6782);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13842);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14167);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17952);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50938);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52463);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68185);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72571);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 94596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 94882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108691);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180485);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 182039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191069);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191584);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191803);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202801);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214146);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220726);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 223945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246040);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250891);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270762);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277767);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 289289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 289583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 536420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 660115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 686390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 699842);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 817172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 853276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 853277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 870522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 887712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 901781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1143460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1318991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1334412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1341977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1470048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1472600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1597180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1598421);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1664512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1666312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675559);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1710023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1713161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1721967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1729817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733782);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778651);
        }
    }
}
