using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class AddChelyabisnk : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 1777157, 158, "Образовательный центр № 1" },
                    { 72804, 158, "Школа № 141" },
                    { 77034, 158, "Школа № 140" },
                    { 73276, 158, "Школа № 139" },
                    { 91173, 158, "Школа № 138" },
                    { 42013, 158, "Школа № 137" },
                    { 283508, 158, "Училище № 136" },
                    { 56005, 158, "Школа № 136" },
                    { 4735, 158, "Школа № 135" },
                    { 59113, 158, "Колледж «Система» (шк. 134)" },
                    { 84626, 158, "Школа № 133" },
                    { 52041, 158, "Лицей № 142" },
                    { 221063, 158, "Школа № 132" },
                    { 10229, 158, "Школа № 130" },
                    { 20840, 158, "Школа № 129" },
                    { 45727, 158, "Школа № 128" },
                    { 15031, 158, "Гимназия № 127" },
                    { 236914, 158, "Школа № 127" },
                    { 214773, 158, "Школа № 126" },
                    { 63160, 158, "Школа № 125" },
                    { 117062, 158, "Школа № 124" },
                    { 644, 158, "Школа № 123" },
                    { 76285, 158, "Школа № 122" },
                    { 77140, 158, "Школа № 131" },
                    { 12288, 158, "Школа № 121" },
                    { 42442, 158, "Школа № 143" },
                    { 4441, 158, "Школа № 145" },
                    { 1058261, 158, "Детский сад № 412" },
                    { 128129, 158, "Школа № 408" },
                    { 129304, 158, "Школа № 402" },
                    { 178212, 158, "Школа № 400" },
                    { 879780, 158, "Детский сад № 369" },
                    { 187276, 158, "Детский сад № 348" },
                    { 854176, 158, "Детский сад № 343" },
                    { 82656, 158, "Школа № 337" },
                    { 720545, 158, "Детский сад № 329" },
                    { 1679427, 158, "Детский сад № 316" },
                    { 29576, 158, "Школа № 144" },
                    { 253867, 158, "Детский сад № 315" },
                    { 36395, 158, "Школа № 155" },
                    { 21702, 158, "Школа № 154" },
                    { 9156, 158, "Школа № 153" },
                    { 270072, 158, "Школа № 152" },
                    { 213509, 158, "Школа № 151" },
                    { 22093, 158, "Школа № 150" },
                    { 63500, 158, "Школа № 149" },
                    { 14070, 158, "Школа № 148" },
                    { 11080, 158, "Школа № 147" },
                    { 49483, 158, "Школа № 146" },
                    { 335324, 158, "Детский сад № 218" },
                    { 34951, 158, "Лицей № 120" },
                    { 173870, 158, "Школа № 120" },
                    { 60378, 158, "Школа № 119" },
                    { 21257, 158, "Гимназия № 100" },
                    { 269165, 158, "Школа искусств № 99" },
                    { 316539, 158, "Дорожно-строительный техникум (ЧДСТ, бывш. ПУ 99)" },
                    { 115619, 158, "Лицей № 99" },
                    { 135, 158, "Школа № 99" },
                    { 46311, 158, "Школа № 98" },
                    { 315286, 158, "Школа искусств № 97" },
                    { 25511, 158, "Лицей № 97" },
                    { 112920, 158, "Школа № 97" },
                    { 88348, 158, "Профессиональное училище № 96" },
                    { 323887, 158, "Колледж № 100" },
                    { 22641, 158, "Гимназия № 96" },
                    { 8607, 158, "Школа № 95" },
                    { 36420, 158, "Школа № 94" },
                    { 4763, 158, "Гимназия № 93" },
                    { 202834, 158, "Школа № 93" },
                    { 201251, 158, "Техникум торговли и художественных промыслов (ЧТТХП, бывш. ПЛ-92, до 2012 г.)" },
                    { 128573, 158, "Лицей № 92" },
                    { 30483, 158, "Школа № 92" },
                    { 231584, 158, "Профессиональное училище № 91 (до 2010 г.)" },
                    { 333814, 158, "Школа искусств № 91" },
                    { 4279, 158, "Школа № 91" },
                    { 207833, 158, "Школа № 96" },
                    { 49903, 158, "Школа № 101" },
                    { 218039, 158, "Профессионально-техническое училище № 101" },
                    { 15333, 158, "Школа № 102" },
                    { 53008, 158, "Школа № 118" },
                    { 49256, 158, "Школа № 117" },
                    { 103933, 158, "Школа № 116" },
                    { 53588, 158, "Школа № 115" },
                    { 139898, 158, "Школа № 114" },
                    { 32482, 158, "Школа № 113" },
                    { 127363, 158, "Профессионально-техническое училище № 112" },
                    { 6415, 158, "Школа № 112" },
                    { 164127, 158, "Гимназия № 111" },
                    { 41920, 158, "Школа № 111" },
                    { 52116, 158, "Школа № 110" },
                    { 133663, 158, "Колледж ИСТиС ЮУрГУ (бывш. Технологический колледж ЮУрГУ, ЧТКС, ПЛ № 109)" },
                    { 49994, 158, "Школа № 109" },
                    { 208999, 158, "Профессионально-техническое училище № 108" },
                    { 2492, 158, "Школа № 108" },
                    { 40364, 158, "Школа № 107" },
                    { 56899, 158, "Школа № 106" },
                    { 11441, 158, "Школа № 105" },
                    { 278454, 158, "Школа № 104" },
                    { 30193, 158, "Школа № 103" },
                    { 291831, 158, "Профессионально-техническое училище № 102" },
                    { 197997, 158, "Профессиональный лицей № 102" },
                    { 80774, 158, "Лицей № 102" },
                    { 266630, 158, "Школа № 414" },
                    { 114904, 158, "Школа № 90" },
                    { 53098, 158, "Школа № 424" },
                    { 98274, 158, "Школа № 427" },
                    { 1661813, 158, "Художественная школа искусств (ДХШИ)" },
                    { 71166, 158, "Финансово-экономический колледж" },
                    { 169933, 158, "Физико-математическая школа ЮУрГУ" },
                    { 257522, 158, "Факультет среднего профессионального образования ЧГИ" },
                    { 511304, 158, "Учетно-кредитный техникум (ЧУКТ)" },
                    { 1780060, 158, "Уральский медицинский колледж" },
                    { 96191, 158, "Университетские классы ЧелГУ" },
                    { 160966, 158, "Торговое училище" },
                    { 82984, 158, "Техникум Челябинского института путей сообщения (ЧИПС)" },
                    { 217608, 158, "Техникум легкой промышленности (ЧТТЛП)" },
                    { 214798, 158, "Художественное училище (ЧХУ)" },
                    { 188434, 158, "Техникум железнодорожного транспорта (ЧТЖТ)" },
                    { 110738, 158, "Средняя специализированная техническая школа (ССТШ)" },
                    { 1752358, 158, "СПО Институт экономики, торговли и технологий ЮУрГУ" },
                    { 18118, 158, "Специальная музыкальная школа  при ЧИМ им. Чайковского" },
                    { 1762048, 158, "Региональный институт охраны и безопасности труда (АНО «РИОТ»)" },
                    { 140047, 158, "Реальная школа" },
                    { 51649, 158, "Радиотехнический техникум им. П. С. Плешакова (ЧРТ)" },
                    { 128288, 158, "Промышленно-гуманитарный техникум (ЧГПГТ)" },
                    { 1660238, 158, "Православная гимназия" },
                    { 49495, 158, "Политехнический техникум" },
                    { 1751500, 158, "Областной центр дополнительного профессионального образования специалистов здравоохранения" },
                    { 146228, 158, "Театральная студия" },
                    { 109894, 158, "Областная школа-интернат с первоначальной летной подготовкой (ОШИ с ПЛП)" },
                    { 1780034, 158, "Центр детского творчества" },
                    { 451132, 158, "Центральная детская школа искусств" },
                    { 1675415, 158, "Юридический колледж (Факультет непрерывного образования РАП)" },
                    { 1749755, 158, "Южно-Уральский учебный центр профессиональных квалификаций ОАО «РЖД» (бывш. ДТШМ)" },
                    { 1722561, 158, "Южно-Уральский многопрофильный колледж (ЮУМК)" },
                    { 1771778, 158, "Южно-Уральский колледж бизнеса (ЮуКБ)" },
                    { 267454, 158, "Южно-Уральский государственный технический колледж (Монтажный колледж)" },
                    { 1708844, 158, "Южно-Уральский государственный колледж (ЮУГК, бывш. Колледж информационно-промышленных технологий и художественных промыслов)" },
                    { 252778, 158, "Энергетический колледж им. С. М. Кирова (ЧЭнК)" },
                    { 1672048, 158, "Электрометаллургический техникум (ЧЭМТ)" },
                    { 1767775, 158, "Экономический колледж Высшей школы экономики и управления ЮУрГУ" },
                    { 1751471, 158, "Школа-интернат спортивного профиля" },
                    { 1752247, 158, "Центр дополнительного образования «УНИВЕРСУМ»" },
                    { 1704169, 158, "Школа экономических знаний ЮУрГУ" },
                    { 1725483, 158, "Школа кинологии при ЧРООЛС" },
                    { 1341523, 158, "Школа кино и телевидения (ЧОШКТ)" },
                    { 167666, 158, "Школа искусств «Молодость»" },
                    { 145747, 158, "Школа еврейской культуры и традиций (ШЕКиТ)" },
                    { 77457, 158, "Школа бизнеса (ВШБ)" },
                    { 156910, 158, "Школа «Улыбка»" },
                    { 50154, 158, "Школа «Пеликан»" },
                    { 147848, 158, "Школа «Лидер»" },
                    { 152682, 158, "Челябинский областной многопрофильный лицей-интернат для одаренных детей (бывш. Областной лицей-интернат)" },
                    { 76375, 158, "Частная школа «Эстет-центр»" },
                    { 102749, 158, "Школа Челябинского гуманитарного института (ЧГИ)" },
                    { 1762062, 158, "Областная организация Общероссийской общественной организации-Общество «Знание» России" },
                    { 80207, 158, "Начальная школа «Альтернатива»" },
                    { 218513, 158, "Музыкальный колледж им. П. И. Чайковского" },
                    { 1751881, 158, "Детско-юношеская спортивная школа по теннису им. Б. Маниона" },
                    { 287978, 158, "Детско-юношеская спортивная школа «Юность»" },
                    { 1762314, 158, "Детско-юношеская спортивная школа «Олимп»" },
                    { 324630, 158, "Детский сад «Чебурашка»" },
                    { 170942, 158, "Дворец пионеров и школьников" },
                    { 66495, 158, "Геологический лицей (ОЗГЛ)" },
                    { 81904, 158, "Банковская школа (ЧБШ)" },
                    { 1763117, 158, "Академия Рынка Труда" },
                    { 1776873, 158, "Академия профессионального образования" },
                    { 1122229, 158, "Академия индустрии и красоты «Стандарт»" },
                    { 1757234, 158, "Духовное училище (ЧДУ)" },
                    { 1705602, 158, "Автошкола ДОСААФ" },
                    { 125089, 158, "Автотранспортный техникум (ЧАТТ)" },
                    { 277282, 158, "Колледж информатики, информационных технологий и экономики (ЧКИИТиЭ, бывш. ЧЭК, до 2012 г.)" },
                    { 249795, 158, "Колледж промышленной автоматики (ЧКПА, до 2012 г.)" },
                    { 111758, 158, "Школа № 482" },
                    { 43155, 158, "Школа № 481" },
                    { 25401, 158, "Школа № 477" },
                    { 1662607, 158, "Детский сад № 456" },
                    { 1603852, 158, "Детский сад № 447" },
                    { 197281, 158, "Школа № 440" },
                    { 315934, 158, "Детский сад № 433" },
                    { 1665457, 158, "Автошкола «АртэС»" },
                    { 187238, 158, "Златоустовский торгово-экономический техникум (ЧФЗТЭТ)" },
                    { 102054, 158, "Индустриальный колледж (ЧИТ)" },
                    { 44276, 158, "Колледж «Комитент»" },
                    { 191992, 158, "Музыкальное училище им П. И. Чайковского (ЧМУ)" },
                    { 704579, 158, "Молодежная школа предпринимательства" },
                    { 231582, 158, "Механический вечерний техникум (ЧВМТ)" },
                    { 1698383, 158, "Механико-технологический техникум (ЧМТТ)" },
                    { 275035, 158, "Металлургический техникум (ЧМТ)" },
                    { 499286, 158, "Медицинский колледж при ЧелГМА" },
                    { 253798, 158, "Медицинский базовый колледж (ЧБМК)" },
                    { 190811, 158, "Машиностроительный техникум (ЧМсТ)" },
                    { 64464, 158, "Лицей «Будущее»" },
                    { 1756720, 158, "Лётное училище гражданской авиации (ЧЛУГА)" },
                    { 132306, 158, "Кооперативный техникум" },
                    { 1772229, 158, "Колледж ЮУрГГПУ (ЧГПУ)" },
                    { 164347, 158, "Колледж ЧФ МГГЭИ (бывш. Профессионально-педагогический, ЧГППК)" },
                    { 202397, 158, "Колледж физической культуры (ЧГКФК)" },
                    { 198103, 158, "Колледж управления и экономики" },
                    { 1717282, 158, "Колледж РБИУ" },
                    { 1781794, 158, "Колледж при Международном институте дизайна и сервиса (МИДиС)" },
                    { 1781768, 158, "Колледж предпринимательства и отраслевых технологий" },
                    { 197283, 158, "Колледж права и экономики (КПиЭ)" },
                    { 260200, 158, "Колледж музыки (ЧГКМ)" },
                    { 147242, 158, "Колледж культуры (ЧКК)" },
                    { 136329, 158, "Колледж искусства и культуры" },
                    { 81118, 158, "Колледж бизнеса (УКБ)" },
                    { 157365, 158, "Гимназия № 426" },
                    { 40757, 158, "Юридический колледж (ЧЮК)" },
                    { 3677, 158, "Школа № 89" },
                    { 164338, 158, "Школа № 88" },
                    { 318149, 158, "Лицей № 12" },
                    { 324825, 158, "Гимназия № 12" },
                    { 128203, 158, "Школа № 12" },
                    { 261994, 158, "Детский сад № 11 «Каравайчик»" },
                    { 167251, 158, "Специализированная детско-юношеская школа олимпийского резерва № 11" },
                    { 46317, 158, "Музыкальная школа № 11" },
                    { 133832, 158, "Лицей № 11" },
                    { 225052, 158, "Гимназия № 11" },
                    { 215167, 158, "Школа № 11" },
                    { 219795, 158, "Школа искусств № 10 «Мечта»" },
                    { 202326, 158, "Школа-интернат № 12" },
                    { 211294, 158, "Профессионально-техническое училище № 10" },
                    { 46688, 158, "Художественная школа № 10" },
                    { 186892, 158, "Детско-юношеская спортивная школа № 10" },
                    { 114444, 158, "Лицей № 10" },
                    { 9419, 158, "Гимназия № 10" },
                    { 219754, 158, "Школа № 10" },
                    { 232299, 158, "Училище № 9 (медицинское)" },
                    { 44819, 158, "Музыкальная школа № 9" },
                    { 208495, 158, "Вечерняя школа № 9" },
                    { 175596, 158, "Школа рабочей молодежи № 9 (ШРМ)" },
                    { 40453, 158, "Школа № 9" },
                    { 250387, 158, "Техникум промышленности и городского хозяйства им. Я. П. Осадчего (ЧТПиГХ, бывш. ПЛ 10)" },
                    { 252544, 158, "Специализированная детско-юношеская школа олимпийского резерва № 8" },
                    { 51076, 158, "Музыкальная школа № 12" },
                    { 53097, 158, "Школа № 13" },
                    { 51958, 158, "Школа № 22" },
                    { 52880, 158, "Школа № 21" },
                    { 207300, 158, "Профессионально-техническое училище № 20" },
                    { 232218, 158, "Гимназия № 20" },
                    { 77356, 158, "Школа № 20" },
                    { 788621, 158, "Детский сад № 19" },
                    { 253298, 158, "Гимназия № 19" },
                    { 221062, 158, "Школа № 19" },
                    { 194934, 158, "Профессионально-техническое училище № 18" },
                    { 213330, 158, "Школа № 18" },
                    { 276393, 158, "Специализированная детско-юношеская школа олимпийского резерва № 12" },
                    { 529353, 158, "Вечерняя школа № 17" },
                    { 166036, 158, "Школа № 16" },
                    { 208169, 158, "Школа-интернат № 15" },
                    { 213507, 158, "Школа № 15" },
                    { 283007, 158, "Гимназия № 14" },
                    { 2781, 158, "Школа № 14" },
                    { 1661303, 158, "Школа искусств № 13" },
                    { 76239, 158, "Музыкальная школа № 13" },
                    { 186037, 158, "Вечерняя школа № 13" },
                    { 1280378, 158, "Школа-интернат № 13" },
                    { 47898, 158, "Лицей № 13" },
                    { 51425, 158, "Школа № 17" },
                    { 44452, 158, "Музыкальная школа № 8" },
                    { 29859, 158, "Школа № 8" },
                    { 295098, 158, "Музыкальная школа № 7" },
                    { 144137, 158, "Школа искусств № 2" },
                    { 175133, 158, "Профессионально-техническое училище № 2" },
                    { 270818, 158, "Педагогический колледж № 2 (ЧГПК)" },
                    { 223061, 158, "Специализированная детско-юношеская школа олимпийского резерва № 2" },
                    { 191577, 158, "Музыкальная школа № 2" },
                    { 188665, 158, "Школа-интернат № 2" },
                    { 151959, 158, "Лицей № 2" },
                    { 5697, 158, "Гимназия № 2" },
                    { 1772713, 158, "Образовательный центр № 2" },
                    { 213506, 158, "Школа № 2" },
                    { 246171, 158, "Профессиональное училище № 2" },
                    { 235992, 158, "Профессиональное училище № 1" },
                    { 230344, 158, "Профессионально-техническое училище № 1" },
                    { 288837, 158, "Педагогический колледж № 1 (ЧГПК)" },
                    { 224242, 158, "Колледж № 1" },
                    { 102842, 158, "Художественная школа № 1" },
                    { 510951, 158, "Специализированная детско-юношеская школа олимпийского резерва № 1 по конькобежному спорту" },
                    { 187137, 158, "Музыкальная школа № 1" },
                    { 267160, 158, "Школа-интернат № 1" },
                    { 215875, 158, "Гимназия № 1" },
                    { 122563, 158, "Еврейская школа  № 1" },
                    { 110372, 158, "Школа № 1" },
                    { 243946, 158, "Школа искусств № 1" },
                    { 222743, 158, "Школа № 3" },
                    { 126201, 158, "Лицей № 3" },
                    { 895751, 158, "Школа-интернат № 3" },
                    { 1766295, 158, "Школа «7 ключей»" },
                    { 281367, 158, "Школа № 7" },
                    { 147385, 158, "Специализированная детско-юношеская школа олимпийского резерва № 6" },
                    { 66070, 158, "Музыкальная школа № 6" },
                    { 172354, 158, "Лицей № 6" },
                    { 5901, 158, "Школа № 6" },
                    { 236244, 158, "Школа искусств № 5" },
                    { 272470, 158, "Профессиональный лицей № 5 (до 2011 г.)" },
                    { 212908, 158, "Специализированная детско-юношеская школа олимпийского резерва № 5" },
                    { 171139, 158, "Музыкальная школа № 5" },
                    { 81175, 158, "Лицей № 5" },
                    { 5730, 158, "Школа № 5" },
                    { 72887, 158, "Детская школа искусств № 4" },
                    { 270804, 158, "Художественная школа № 4" },
                    { 276576, 158, "Специализированная детско-юношеская школа олимпийского резерва № 4" },
                    { 136423, 158, "Музыкальная школа № 4" },
                    { 150625, 158, "Школа-интернат № 4" },
                    { 255443, 158, "Школа № 4" },
                    { 1780704, 158, "Образовательный центр № 4" },
                    { 77205, 158, "Школа искусств № 3" },
                    { 788620, 158, "Педагогическое училище № 3" },
                    { 212013, 158, "Профессионально-техническое училище № 3" },
                    { 257680, 158, "Музыкальная школа № 3" },
                    { 262800, 158, "Школа № 23" },
                    { 10001, 158, "Лицей № 88" },
                    { 138993, 158, "Гимназия № 23" },
                    { 45317, 158, "Школа № 24" },
                    { 69287, 158, "Детско-юношеская спортивная школа № 71" },
                    { 323095, 158, "Школа № 71" },
                    { 260448, 158, "Училище № 70" },
                    { 67989, 158, "Школа № 70" },
                    { 84279, 158, "Детско-юношеская спортивная школа № 69" },
                    { 647, 158, "Школа № 69" },
                    { 239186, 158, "Профессиональный колледж (ЧелПК, бывш. ПЛ 68)" },
                    { 16594, 158, "Школа № 68" },
                    { 1707609, 158, "Школа № 67 ОАО РЖД" },
                    { 34780, 158, "Школа № 67" },
                    { 156397, 158, "Колледж № 71" },
                    { 58246, 158, "Школа № 66" },
                    { 61599, 158, "Школа № 65" },
                    { 177492, 158, "Профессиональное училище № 64" },
                    { 16509, 158, "Школа № 64" },
                    { 21941, 158, "Гимназия № 63" },
                    { 328597, 158, "Школа № 63" },
                    { 27101, 158, "Школа № 62" },
                    { 185997, 158, "Профессионально-техническое училище № 61" },
                    { 55245, 158, "Школа № 61" },
                    { 228143, 158, "Школа № 60" },
                    { 948194, 158, "Училище № 59" },
                    { 162227, 158, "Училище № 65" },
                    { 17026, 158, "Школа № 59" },
                    { 185844, 158, "Профессиональное училище № 71" },
                    { 28757, 158, "Школа № 73" },
                    { 24035, 158, "Школа № 87" },
                    { 204710, 158, "Школа № 86" },
                    { 235723, 158, "Профессионально-техническое училище № 85" },
                    { 36398, 158, "Школа № 85" },
                    { 37645, 158, "Школа № 84" },
                    { 63875, 158, "Лицей № 83" },
                    { 153747, 158, "Колледж индустрии питания и торговли (ЧКИПиТ, бывш. ПУ 82)" },
                    { 15484, 158, "Лицей № 82" },
                    { 169813, 158, "Лицей № 82" },
                    { 45731, 158, "Школа № 81" },
                    { 16502, 158, "Школа № 72" },
                    { 232989, 158, "Профессионально-техническое училище № 80" },
                    { 76903, 158, "Школа № 79" },
                    { 95739, 158, "Школа № 78" },
                    { 15981, 158, "Лицей № 77" },
                    { 266955, 158, "Гимназия № 77" },
                    { 230419, 158, "Школа № 77" },
                    { 334207, 158, "Школа искусств № 76" },
                    { 4214, 158, "Гимназия № 76" },
                    { 257521, 158, "Школа № 76" },
                    { 16501, 158, "Школа № 75" },
                    { 30499, 158, "Школа № 74" },
                    { 9152, 158, "Гимназия № 80" },
                    { 12966, 158, "Школа № 58" },
                    { 321480, 158, "Школа № 57" },
                    { 43078, 158, "Школа № 56" },
                    { 53730, 158, "Лицей № 38" },
                    { 97076, 158, "Школа № 38" },
                    { 1684446, 158, "Профессиональное училище № 37" },
                    { 147530, 158, "Лицей № 37" },
                    { 179419, 158, "Школа № 37" },
                    { 5741, 158, "Школа № 36" },
                    { 277866, 158, "Школа искусств № 35" },
                    { 14071, 158, "Лицей № 35" },
                    { 247925, 158, "Школа № 35" },
                    { 176046, 158, "Школа № 34" },
                    { 34463, 158, "Школа № 39" },
                    { 48840, 158, "Школа № 33" },
                    { 56366, 158, "Школа № 32" },
                    { 646, 158, "Лицей № 31" },
                    { 195999, 158, "Школа № 31" },
                    { 8628, 158, "Школа № 30" },
                    { 175732, 158, "Школа № 29" },
                    { 4526, 158, "Школа № 28" },
                    { 29187, 158, "Школа № 27" },
                    { 199294, 158, "Гимназия № 26" },
                    { 195193, 158, "Школа № 26" },
                    { 28420, 158, "Школа № 25" },
                    { 273889, 158, "Гимназия № 32" },
                    { 54399, 158, "Лицей № 39" },
                    { 211683, 158, "Школа № 40" },
                    { 288646, 158, "Лицей № 40" },
                    { 1715743, 158, "Детский сад № 55" },
                    { 21258, 158, "Школа № 55" },
                    { 27917, 158, "Детско-юношеская спортивная школа № 54" },
                    { 49995, 158, "Школа № 54" },
                    { 10795, 158, "Школа № 53" },
                    { 18117, 158, "Школа № 52" },
                    { 11992, 158, "Школа № 51" },
                    { 29509, 158, "Школа № 50" },
                    { 12320, 158, "Школа № 49" },
                    { 281325, 158, "Школа-интернат № 48" },
                    { 3145, 158, "Гимназия № 48" },
                    { 205059, 158, "Школа № 48" },
                    { 217447, 158, "Школа № 47" },
                    { 27387, 158, "Школа № 46" },
                    { 10175, 158, "Школа № 45" },
                    { 312164, 158, "Профессиональный лицей № 44" },
                    { 70093, 158, "Лицей № 44" },
                    { 194461, 158, "Школа № 44" },
                    { 49144, 158, "Школа № 43" },
                    { 226769, 158, "Лицей № 42" },
                    { 39531, 158, "Школа № 42" },
                    { 62848, 158, "Профессионально-техническое училище № 41" },
                    { 341, 158, "Школа № 41" },
                    { 1672029, 158, "Профессиональное училище № 23" },
                    { 1472596, 158, "Юридический техникум (ЧЮТ)" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21941);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27917);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34463);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43155);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80774);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84626);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102842);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140047);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188665);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194461);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198103);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204710);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215167);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 223061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231584);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 269165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321480);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 323095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 323887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 328597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 333814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 451132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 499286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 510951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 511304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 529353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 704579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 720545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 788620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 788621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 854176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 879780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 895751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 948194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1058261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1122229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1280378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1341523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1472596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1603852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1684446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1704169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1707609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1708844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767775);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781794);
        }
    }
}
