using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class KazanSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 216032, 60, "Детско-юношеская спортивная школа №1" },
                    { 54963, 60, "Школа №156" },
                    { 7526, 60, "Гимназия №155" },
                    { 317373, 60, "Гимназия №154" },
                    { 48328, 60, "Школа №153" },
                    { 8515, 60, "Школа №152" },
                    { 160111, 60, "Гимназия №152" },
                    { 74731, 60, "Школа №152 (бывш. шк. №68 Горьковской ЖД)" },
                    { 14141, 60, "Школа №151" },
                    { 320211, 60, "Школа №150" },
                    { 315207, 60, "Татарско-турецкий лицей №149" },
                    { 272977, 60, "Школа №149" },
                    { 133646, 60, "Школа №148" },
                    { 71424, 60, "Школа №147" },
                    { 34552, 60, "Гимназия №157" },
                    { 280963, 60, "Школа №146" },
                    { 275589, 60, "Школа №145" },
                    { 2979, 60, "Школа №144" },
                    { 313011, 60, "Школа №143" },
                    { 2840, 60, "Школа №141" },
                    { 29828, 60, "Гимназия №140" },
                    { 93323, 60, "Школа №139" },
                    { 2603, 60, "Гимназия №139" },
                    { 11434, 60, "Лицей №138" },
                    { 136366, 60, "Школа №138" },
                    { 171552, 60, "Лицей №137" },
                    { 214834, 60, "Профессиональное училище №137" },
                    { 242733, 60, "Школа №137" },
                    { 169467, 60, "Лицей при шк. №136" },
                    { 8460, 60, "Лицей №145" },
                    { 319547, 60, "Профессиональный лицей №136" },
                    { 1671821, 60, "Детский сад №158" },
                    { 289406, 60, "Школа №160" },
                    { 899185, 60, "Школа №222" },
                    { 15939, 60, "Школа №210" },
                    { 508385, 60, "Детский сад №203" },
                    { 1778953, 60, "Политехнический лицей №182" },
                    { 1774173, 60, "Многопрофильная полилингвальная гимназия №180" },
                    { 1752250, 60, "Гимназия №179 (бывш. шк.)" },
                    { 1657268, 60, "Центр образования №178" },
                    { 198220, 60, "Лицей №177 (Школа №177)" },
                    { 130642, 60, "Школа №175" },
                    { 166594, 60, "Лицей №174" },
                    { 61170, 60, "Школа №174" },
                    { 64666, 60, "Школа №173" },
                    { 111288, 60, "Школа №172" },
                    { 29829, 60, "Лицей №159" },
                    { 1627980, 60, "Детский сад №171" },
                    { 52169, 60, "Школа №170" },
                    { 10902, 60, "Школа №169" },
                    { 92776, 60, "Школа №168" },
                    { 272805, 60, "Школа №167" },
                    { 266929, 60, "Гимназия №166" },
                    { 97292, 60, "Школа №166" },
                    { 30151, 60, "Школа №165" },
                    { 53539, 60, "Школа №164" },
                    { 53067, 60, "Школа №163" },
                    { 454838, 60, "Детский сад №162" },
                    { 189713, 60, "Школа №162 «Озарение»" },
                    { 53129, 60, "Школа №161" },
                    { 255734, 60, "Гимназия №161" },
                    { 326541, 60, "Школа №171" },
                    { 281365, 60, "Лицей №136" },
                    { 51173, 60, "Школа №136" },
                    { 19937, 60, "Школа №135" },
                    { 245684, 60, "Школа №113" },
                    { 257918, 60, "Профессиональное училище №113" },
                    { 52743, 60, "Школа №112" },
                    { 279770, 60, "Школа №111" },
                    { 275882, 60, "Школа №110" },
                    { 159267, 60, "Школа №109" },
                    { 139157, 60, "Школа №108" },
                    { 61545, 60, "Школа №107" },
                    { 1682119, 60, "Профессиональное училище №107" },
                    { 69813, 60, "Школа №106" },
                    { 58941, 60, "Школа №105" },
                    { 20456, 60, "Школа №103" },
                    { 162681, 60, "Школа №102" },
                    { 13924, 60, "Школа №114" },
                    { 1565, 60, "Гимназия №102 им. М. С. Устиновой" },
                    { 123193, 60, "Школа №100" },
                    { 18389, 60, "Школа №99" },
                    { 202829, 60, "Школа №98" },
                    { 11237, 60, "Школа №97" },
                    { 19105, 60, "Школа №96" },
                    { 61785, 60, "Гимназия №96" },
                    { 2906, 60, "Школа №95" },
                    { 2835, 60, "Гимназия №94" },
                    { 189913, 60, "Музыкальная школа при гимн. №94" },
                    { 36684, 60, "Гимназия №93" },
                    { 456659, 60, "Профессиональный лицей №93" },
                    { 257111, 60, "Школа №93" },
                    { 35157, 60, "Школа №92" },
                    { 16379, 60, "Школа №101" },
                    { 72764, 60, "Лицей №115" },
                    { 62575, 60, "Школа №115" },
                    { 226872, 60, "Профессиональный лицей №115" },
                    { 115703, 60, "Школа №134" },
                    { 283990, 60, "Школа №133" },
                    { 9089, 60, "Школа №133" },
                    { 7232, 60, "Школа №132" },
                    { 166156, 60, "Физико-математический лицей №131" },
                    { 260056, 60, "Школа №131" },
                    { 57511, 60, "Школа №130" },
                    { 19274, 60, "Школа №129" },
                    { 268276, 60, "Школа №127" },
                    { 200501, 60, "Гимназия №126" },
                    { 282762, 60, "Школа №125" },
                    { 190744, 60, "Гимназия №125" },
                    { 163303, 60, "Художественная школа при гимн. №125" },
                    { 60377, 60, "Школа №124" },
                    { 72763, 60, "Лицей №123" },
                    { 93567, 60, "Школа №123" },
                    { 218731, 60, "Профессиональный лицей №123" },
                    { 561, 60, "Школа №122" },
                    { 51582, 60, "Гимназия №122" },
                    { 26182, 60, "Школа №121" },
                    { 102279, 60, "Лицей №121 (бывш. гимн. №121)" },
                    { 220769, 60, "Гимназия №120" },
                    { 46430, 60, "Школа №120" },
                    { 63976, 60, "Школа №119" },
                    { 162084, 60, "Школа №118" },
                    { 23280, 60, "Школа №117" },
                    { 312318, 60, "Школа №116" },
                    { 8723, 60, "Лицей №116" },
                    { 281790, 60, "Училище №116" },
                    { 1463346, 60, "Детский сад №293" },
                    { 422402, 60, "Детский сад №316" },
                    { 1657425, 60, "Детский сад №351" },
                    { 89576, 60, "Гимназия №360" },
                    { 1601149, 60, "Техникум наземного и подземного электротранспорта" },
                    { 114942, 60, "Техникум железнодорожного транспорта (КТЖТ - филиал СамГУПС)" },
                    { 70099, 60, "Театральное училище (КТУ)" },
                    { 220359, 60, "Танковое училище" },
                    { 127495, 60, "Суворовское военное училище (СВУ)" },
                    { 69816, 60, "Строительный колледж (КСК)" },
                    { 8161, 60, "Средняя специальная музыкальная школа (колледж) при КГК им. Н. Г. Жиганова" },
                    { 1717511, 60, "Специализированный олимпиадно-научный центр «СОлНЦе»" },
                    { 265345, 60, "Сельскохозяйственный техникум (КФЛСХТ)" },
                    { 74877, 60, "Речной техникум (КРТ)" },
                    { 1760748, 60, "Республиканский инженерно-технический центр «РИТЦ-ПрофСтандарт»" },
                    { 110012, 60, "Республиканская татарская музыкальная школа" },
                    { 1766219, 60, "Республиканская специальная общеобразовательная школа им. Н. А. Галлямова" },
                    { 123391, 60, "Технологический колледж (КТК)" },
                    { 160225, 60, "Республиканская музыкальная школа (ДРМШ)" },
                    { 96447, 60, "Прогимназия-лицей гувернерского типа обучения (ПЛГТО)" },
                    { 116795, 60, "Правовая школа (ГПШ)" },
                    { 143511, 60, "Политехнический колледж при КГТУ им. А. Н. Туполева (ВПК)" },
                    { 995667, 60, "Политехнический колледж (КПК)" },
                    { 23620, 60, "Педагогический колледж (КПК)" },
                    { 1772226, 60, "Открытый колледж бизнеса и информатики" },
                    { 50306, 60, "МУПК - МАРТ Вахитовского р-на" },
                    { 45326, 60, "Музыкальное училище им. Аухадеева (КМУ)" },
                    { 58909, 60, "Музыкально-хоровая гимназия для мальчиков (МХГМ)" },
                    { 227843, 60, "Многопрофильный лицей" },
                    { 150786, 60, "Механико-технологический техникум (КМТТ)" },
                    { 133957, 60, "Межшкольный учебный комбинат Ново-Савиновского района" },
                    { 160779, 60, "Межрегиональный центр компетенций - Казанский техникум информационных технологий и связи (МЦК-КТИТС, бывш. КЭТС)" },
                    { 186345, 60, "Радиотехнический колледж" },
                    { 166836, 60, "Торгово-экономический техникум (КТЭТ, бывш. КТСТ)" },
                    { 1679659, 60, "Учебный центр Кнауф" },
                    { 271971, 60, "Учетно-кредитный техникум (КУКТ)" },
                    { 145984, 60, "Экономический лицей Бауманского р-на" },
                    { 108410, 60, "Экономико-юридический колледж (КЭЮК)" },
                    { 219087, 60, "Экономико-правовой колледж при ТИСБИ (ЭПК)" },
                    { 184066, 60, "Экономико-правовой колледж при ИЭУП (ЭПК)" },
                    { 539464, 60, "Экологический колледж при КГУ" },
                    { 201557, 60, "Школа молодого журналиста" },
                    { 1767375, 60, "Школа кино и телевидения" },
                    { 831812, 60, "Школа иностранных языков «Speaking Planet»" },
                    { 1759866, 60, "Школа иностранных языков «Alibra School»" },
                    { 207357, 60, "Школа живописи при КГТУ" },
                    { 116446, 60, "Школа дизайна при КГАСА" },
                    { 1778141, 60, "Школа «Усмания»" },
                    { 720544, 60, "Школа «Орбиталь» им. П. А. Кирпичникова" },
                    { 1670629, 60, "Школа «Ор Авнер»" },
                    { 49397, 60, "Школа «Елена-Сервис»" },
                    { 1668247, 60, "Центр творчества «Вдохновение»" },
                    { 1776024, 60, "Центр социально-гуманитарного образования (ЦСГО)" },
                    { 362575, 60, "Центр детского творчества «Детская академия»" },
                    { 221964, 60, "Художественное училище (КХУ)" },
                    { 96667, 60, "Художественная школа «Галатея»" },
                    { 175192, 60, "Христианская школа" },
                    { 95620, 60, "Хореографическое училище (КГХОУ)" },
                    { 1759082, 60, "Хореографическая школа-студия ансамбля танца «Казань»" },
                    { 134448, 60, "Хор Лукьянова ЦДТ Алиша" },
                    { 231716, 60, "Химико-технологический техникум (КХТТ)" },
                    { 154281, 60, "Факультет среднего профессионального образования «ТИСБИ»" },
                    { 1780550, 60, "Факультет непрерывного образования по подготовке специалистов для судебной системы КФ РГУП (бывш. РАП)" },
                    { 140394, 60, "Училище олимпийского резерва (КазУОР)" },
                    { 91815, 60, "Училище оборонного завода РТИ" },
                    { 1061931, 60, "Международный колледж сервиса (МКС)" },
                    { 16084, 60, "Школа №91" },
                    { 1768473, 60, "Международная школа Казани" },
                    { 227130, 60, "Медицинское училище (КМУ)" },
                    { 108981, 60, "Детско-юношеская спортивная школа олимпийского резерва «Тасма»" },
                    { 1560351, 60, "Детско-юношеская спортивная школа олимпийского резерва «Олимп»" },
                    { 270315, 60, "Детско-юношеская спортивная школа олимпийского резерва «Батыр»" },
                    { 77561, 60, "Детско-юношеская спортивная школа Вахитовского р-на" },
                    { 131771, 60, "Детско-юношеская спортивная школа «Уникс-Юниор»" },
                    { 908778, 60, "Детско-юношеская спортивная школа «Трудовые резервы»" },
                    { 148621, 60, "Детско-юношеская спортивная школа «Динамо»" },
                    { 208127, 60, "Детско-юношеская спортивная школа «Виктория»" },
                    { 252468, 60, "Детско-юношеская спортивная школ «Рубин»" },
                    { 1627982, 60, "Детско-юношеская спортивная школ «Ракета»" },
                    { 292265, 60, "Детский сад «Чиполлино»" },
                    { 268675, 60, "Детский сад «Аленький цветочек»" },
                    { 58381, 60, "Детская архитектурно-дизайнерская школа «Дашка»" },
                    { 128231, 60, "Детско-юношеская спортивная школа олимпийского резерва по фехтованию" },
                    { 149720, 60, "Высшая школа управления и бизнеса (ВШУБ)" },
                    { 154419, 60, "Вальдорфская школа" },
                    { 30815, 60, "Банковский колледж (КБК) ЦБ РФ (бывш. КБШ)" },
                    { 1761892, 60, "Ассоциация ДПО КГ СДК «БИНК»" },
                    { 1670471, 60, "Академия STANDART" },
                    { 79817, 60, "Академический лицей им. Лобачевского" },
                    { 165895, 60, "Академический колледж при КГУ" },
                    { 322543, 60, "Автотранспортный техникум им. А. П. Обыденнова (КАТТ)" },
                    { 237312, 60, "Авиационный техникум (КАТ)" },
                    { 192066, 60, "Авиационно-технический колледж (КАТК)" },
                    { 1704392, 60, "IT-лицей КФУ" },
                    { 158248, 60, "Гимназия №387" },
                    { 324232, 60, "Детский сад №385" },
                    { 960825, 60, "Детский сад №369" },
                    { 132173, 60, "Высшая школа иностранных языков «Лингва»" },
                    { 164354, 60, "Детско-юношеская спортивная школа олимпийского резерва по фигурному катанию на коньках" },
                    { 161489, 60, "Детско-юношеская спортивная школа олимпийского резерва по худ. гимнастике «Приволжанка»" },
                    { 797946, 60, "Детско-юношеская спортивная школа по спортивной гимнастике и акробатике" },
                    { 126102, 60, "Медицинский базовый колледж (КБМК)" },
                    { 104989, 60, "Медико-фармацевтический колледж при КГМУ (КМФК)" },
                    { 284825, 60, "Малый энергетический колледж (МЭК)" },
                    { 46252, 60, "Малый университет при КГУ" },
                    { 83838, 60, "Малая академия искусств (МАКИ)" },
                    { 1739320, 60, "Лицей-интернат им. П. А. Кирпичникова с углубленным изучением химии КНИТУ" },
                    { 60649, 60, "Лицей им. Н. И. Лобачевского при КФУ" },
                    { 1777445, 60, "Лицей – инженерный центр" },
                    { 168014, 60, "Летняя профильная школа «Квант»" },
                    { 205982, 60, "Кооперативный техникум (ККТ)" },
                    { 264071, 60, "Конно-спортивная школа" },
                    { 1775310, 60, "Комплексная детско-юношеская спортивная школа «Авиатор»" },
                    { 52115, 60, "Колледж управления, права и информационных технологий (КУПИТ, КиМЭСИ)" },
                    { 218203, 60, "Колледж управления, бизнеса и информатики (КУБИ) при ИСГЗ" },
                    { 85108, 60, "Колледж технологии и дизайна (ККТиД, бывш. КТЛП)" },
                    { 244024, 60, "Колледж Российской академии правосудия (КФ РАП)" },
                    { 1660235, 60, "Колледж малого бизнеса и предпринимательства (КМБиП)" },
                    { 857121, 60, "Колледж информационных технологий (СПО ИКТЗИ КИТ)" },
                    { 77053, 60, "Колледж автоматизации лесопромышленного производства (ККАЛПП)" },
                    { 189784, 60, "Казанский социально-гуманитарный техникум (КСГТ-КСГК)" },
                    { 234581, 60, "Казанский колледж строительства, архитектуры и городского хозяйства (бывш. Колледж коммунального хозяйства и строительства)" },
                    { 1773082, 60, "Казанская кадетская школа-интернат им. Героя Советского Союза Б. К. Кузнецова" },
                    { 117479, 60, "Казанская академия тенниса" },
                    { 161704, 60, "Испанский Центр Образования и Культуры при КФУ (Школа испанского языка при КГУ)" },
                    { 1374020, 60, "Исламский колледж (КИК)" },
                    { 1767575, 60, "Институт дополнительного профессионального образования (повышения квалификации) специалистов социокультурной сферы и искусств" },
                    { 1756988, 60, "Инженерный лицей КНИТУ-КАИ для одаренных детей" },
                    { 1501592, 60, "ИАНТЭ Технический колледж" },
                    { 1743527, 60, "Зенитно-прожекторное училище (КЗПУ)" },
                    { 277736, 60, "Медресе «Мухаммадия» (КВММ)" },
                    { 154643, 60, "Школа №90" },
                    { 20851, 60, "Гимназия №90" },
                    { 22630, 60, "Школа №89" },
                    { 55555, 60, "Музыкальная школа №13" },
                    { 61235, 60, "Гимназия №13" },
                    { 17196, 60, "Школа №13" },
                    { 268543, 60, "Лицей №12" },
                    { 325111, 60, "Музыкальная школа №12" },
                    { 320568, 60, "Специализированная детско-юношеская спортивная школа олимпийского резерва №12" },
                    { 97251, 60, "Профессиональное училище №12" },
                    { 62545, 60, "Школа №12 «Мишпахтейну»" },
                    { 8405, 60, "Гимназия №12" },
                    { 85634, 60, "Вечерняя школа №12" },
                    { 92777, 60, "Музыкальная школа №11" },
                    { 1595495, 60, "Вечерняя школа №11" },
                    { 51664, 60, "Школа №11" },
                    { 156175, 60, "Вечерняя школа №13" },
                    { 10256, 60, "Лицей №11" },
                    { 126396, 60, "Гимназия №11" },
                    { 277413, 60, "Школа-интернат №10" },
                    { 72418, 60, "Художественная школа №10" },
                    { 171695, 60, "Музыкальная школа №10" },
                    { 318310, 60, "Гимназия №10" },
                    { 325614, 60, "Профессиональное училище №10" },
                    { 42724, 60, "Школа №10" },
                    { 292598, 60, "Школа искусств №10" },
                    { 294975, 60, "Вечерняя школа №10" },
                    { 908777, 60, "Детско-юношеская спортивная школа олимпийского резерва №9" },
                    { 311928, 60, "Школа №9" },
                    { 99409, 60, "Лицей №9" },
                    { 119728, 60, "Художественная школа №9" },
                    { 103496, 60, "Детско-юношеская спортивная школа олимпийского резерва №11 по художественной гимнастике" },
                    { 57308, 60, "Школа №14" },
                    { 127738, 60, "Гимназия №14" },
                    { 60637, 60, "Музыкальная школа №14" },
                    { 285892, 60, "Гимназия №20" },
                    { 68733, 60, "Музыкальная школа №20" },
                    { 126349, 60, "Школа №19" },
                    { 64633, 60, "Детско-юношеская спортивная школа №19" },
                    { 45293, 60, "Музыкальная школа №19" },
                    { 186060, 60, "Нефтехимический колледж (КНХК, бывш. ПЛ 19)" },
                    { 319567, 60, "Гимназия №19" },
                    { 321501, 60, "Техникум №19" },
                    { 3229, 60, "Школа №18" },
                    { 102956, 60, "Школа искусств №18" },
                    { 83683, 60, "Музыкальная школа №18" },
                    { 52175, 60, "Гимназия №18" },
                    { 153023, 60, "Детско-юношеская спортивная школа олимпийского резерва №18" },
                    { 103590, 60, "Детско-юношеская спортивная школа №18" },
                    { 89325, 60, "Школа №17" },
                    { 41441, 60, "Музыкальная школа №17" },
                    { 31210, 60, "Гимназия №17" },
                    { 162216, 60, "Профессиональное училище №17" },
                    { 287412, 60, "Школа №16" },
                    { 255170, 60, "Гимназия №16" },
                    { 68189, 60, "Музыкальная школа №16" },
                    { 241644, 60, "Художественная школа №15" },
                    { 263574, 60, "Профессиональный лицей №15" },
                    { 220507, 60, "Училище №15" },
                    { 53229, 60, "Музыкальная школа №15" },
                    { 54937, 60, "Гимназия №15" },
                    { 13960, 60, "Школа №15" },
                    { 77417, 60, "Профессионально-техническое училище №15" },
                    { 104599, 60, "Школа искусств №15" },
                    { 167737, 60, "Школа искусств №9" },
                    { 197363, 60, "Профессиональное училище №20" },
                    { 124855, 60, "Профессиональный лицей №9" },
                    { 4451, 60, "Гимназия №9" },
                    { 156320, 60, "Лицей №3" },
                    { 266806, 60, "Школа №3" },
                    { 15637, 60, "Гимназия №3" },
                    { 268972, 60, "Художественная школа №3" },
                    { 1310774, 60, "Школа-интернат №3" },
                    { 287305, 60, "Детско-юношеская спортивная школа олимпийского резерва №3" },
                    { 40761, 60, "Музыкальная школа №3" },
                    { 4926, 60, "Лицей №2" },
                    { 1395061, 60, "Турецко-Татарский лицей им. Эртугрула Гази №2" },
                    { 47001, 60, "Детско-юношеская спортивная школа №2" },
                    { 177934, 60, "Детско-юношеская спортивная школа олимпийского резерва №2" },
                    { 195648, 60, "Школа №2" },
                    { 213215, 60, "Училище №2" },
                    { 98876, 60, "Гимназия №4" },
                    { 8416, 60, "Музыкальная школа №2" },
                    { 193628, 60, "Педагогическое училище №2" },
                    { 250878, 60, "Художественная школа №2" },
                    { 283415, 60, "Школа-интернат №2" },
                    { 282902, 60, "Индустриально-педагогический техникум №2 (КИПТ)" },
                    { 242947, 60, "Профессиональное училище №2" },
                    { 52233, 60, "Школа №1" },
                    { 174576, 60, "Индустриально-педагогический техникум №1 (КИПТ)" },
                    { 46820, 60, "Музыкальная школа №1 им. П. И. Чайковского" },
                    { 210284, 60, "Училище №1" },
                    { 37198, 60, "Гимназия №1" },
                    { 38148, 60, "Художественная школа №1" },
                    { 222868, 60, "Межшкольный учебный комбинат №1 Московского района" },
                    { 47755, 60, "Лицей №1 при КГУ" },
                    { 53585, 60, "Гимназия №2 им. Ш. Марджани" },
                    { 53960, 60, "Школа №4" },
                    { 310420, 60, "Музыкальная школа №4" },
                    { 80251, 60, "Татарско-турецкий лицей №4" },
                    { 8674, 60, "Гимназия №8" },
                    { 273416, 60, "Лицей №8" },
                    { 295756, 60, "Музыкальная школа №8" },
                    { 106785, 60, "Школа №8" },
                    { 7529, 60, "Школа-интернат №7 (ТТЭЛ)" },
                    { 7527, 60, "Лицей №7" },
                    { 54523, 60, "Художественная школа №7" },
                    { 236528, 60, "Детско-юношеская спортивная школа олимпийского резерва №7" },
                    { 24336, 60, "Музыкальная школа №7" },
                    { 53029, 60, "Школа №7" },
                    { 51287, 60, "Гимназия №7" },
                    { 320612, 60, "Школа-интернат №6" },
                    { 52112, 60, "Лицей №6" },
                    { 47344, 60, "Художественная школа №6" },
                    { 53683, 60, "Музыкальная школа №6 им. А. Бакирова" },
                    { 214732, 60, "Детско-юношеская спортивная школа олимпийского резерва №6" },
                    { 59626, 60, "Школа №6" },
                    { 29585, 60, "Гимназия №6" },
                    { 110753, 60, "Школа №5" },
                    { 53042, 60, "Гимназия №5" },
                    { 149016, 60, "Вечерняя школа №5" },
                    { 68033, 60, "Музыкальная школа №5" },
                    { 72612, 60, "Детско-юношеская спортивная школа №5" },
                    { 12611, 60, "Лицей №5" },
                    { 267593, 60, "Художественная школа №5" },
                    { 317005, 60, "Профессиональный лицей №4" },
                    { 55440, 60, "Художественная школа №4" },
                    { 28768, 60, "Школа-интернат №4" },
                    { 72647, 60, "Детско-юношеская спортивная школа №4" },
                    { 53478, 60, "Музыкальная школа №9" },
                    { 92456, 60, "Экономический лицей Вахитовского р-на" },
                    { 38783, 60, "Школа №20" },
                    { 110563, 60, "Школа №21" },
                    { 163081, 60, "Школа №63" },
                    { 15250, 60, "Школа №62" },
                    { 1414866, 60, "Школа №61" },
                    { 272887, 60, "Школа №60" },
                    { 86949, 60, "Школа №59" },
                    { 157257, 60, "Профессиональный лицей №59" },
                    { 361012, 60, "Профессиональный лицей №58" },
                    { 50309, 60, "Школа №58" },
                    { 314477, 60, "Школа №57" },
                    { 226329, 60, "Гимназия №57" },
                    { 103295, 60, "Школа-интернат №56" },
                    { 103292, 60, "Колледж №56" },
                    { 226809, 60, "Школа №56" },
                    { 17813, 60, "Школа №64" },
                    { 7479, 60, "Школа №55" },
                    { 318120, 60, "Профессиональное училище №54" },
                    { 53167, 60, "Школа №54" },
                    { 92459, 60, "Школа №53" },
                    { 109035, 60, "Гимназия №52" },
                    { 12731, 60, "Школа №52" },
                    { 131004, 60, "Колледж №51" },
                    { 37932, 60, "Школа №51" },
                    { 181904, 60, "Профессионально-техническое училище №51" },
                    { 26185, 60, "Лицей №50" },
                    { 268192, 60, "Профессиональный лицей №50" },
                    { 106305, 60, "Школа №50" },
                    { 99537, 60, "Профессиональное училище №49" },
                    { 286905, 60, "Школа искусств №49" },
                    { 140143, 60, "Колледж связи №54 (ККС)" },
                    { 26012, 60, "Школа №65" },
                    { 54721, 60, "Школа №66" },
                    { 14920, 60, "Школа №67" },
                    { 4851, 60, "Школа №88" },
                    { 10506, 60, "Школа №87" },
                    { 25656, 60, "Школа №86" },
                    { 42235, 60, "Школа №85" },
                    { 28542, 60, "Школа №84" },
                    { 2909, 60, "Лицей №83" },
                    { 250964, 60, "Школа №83" },
                    { 16363, 60, "Школа №82" },
                    { 251491, 60, "Гимназия №81" },
                    { 33662, 60, "Школа №81" },
                    { 14629, 60, "Школа №80" },
                    { 264513, 60, "Лицей №80" },
                    { 196301, 60, "Гимназия №80" },
                    { 20654, 60, "Школа №79" },
                    { 256726, 60, "Лицей №78 им. А. С. Пушкина" },
                    { 22344, 60, "Лицей №78 «Фарватер» (бывш. шк. №78)" },
                    { 28868, 60, "Школа №77" },
                    { 239385, 60, "Гимназия №77" },
                    { 276805, 60, "Гимназия №76" },
                    { 40841, 60, "Гимназия №75" },
                    { 55459, 60, "Школа №74" },
                    { 42637, 60, "Школа №73" },
                    { 11930, 60, "Школа №72" },
                    { 37663, 60, "Школа №71" },
                    { 20392, 60, "Школа №70" },
                    { 43237, 60, "Школа №69" },
                    { 266085, 60, "Машиностроительный техникум (КМТ, бывш. ПЛ 68)" },
                    { 13618, 60, "Школа №68" },
                    { 112729, 60, "Лицей №68" },
                    { 247530, 60, "Училище №49" },
                    { 173603, 60, "Профессиональное училище №21" },
                    { 3240, 60, "Школа №49" },
                    { 113529, 60, "Школа №47" },
                    { 124181, 60, "Школа №29" },
                    { 99582, 60, "Музыкальная школа №29" },
                    { 99528, 60, "Художественная школа №29" },
                    { 175668, 60, "Школа №28" },
                    { 1501591, 60, "Музыкальная школа №28" },
                    { 40559, 60, "Гимназия №28" },
                    { 122285, 60, "Музыкальная школа №27" },
                    { 212525, 60, "Школа №27" },
                    { 54431, 60, "Гимназия №27" },
                    { 241439, 60, "Профессионально-техническое училище №26" },
                    { 190080, 60, "Татарско-турецкий лицей №26" },
                    { 90463, 60, "Музыкальная школа №26" },
                    { 188629, 60, "Гимназия №26" },
                    { 249497, 60, "Профессиональное училище №30" },
                    { 51984, 60, "Школа №26" },
                    { 89322, 60, "Школа №25" },
                    { 43052, 60, "Гимназия №25" },
                    { 142163, 60, "Музыкальная школа №25" },
                    { 204587, 60, "Музыкальная школа №24" },
                    { 281789, 60, "Вечерняя школа №24" },
                    { 239658, 60, "Художественная школа №24" },
                    { 5516, 60, "Школа №24" },
                    { 174711, 60, "Музыкальная школа №23" },
                    { 81924, 60, "Школа №23" },
                    { 58217, 60, "Музыкальная школа №22" },
                    { 23398, 60, "Школа №22" },
                    { 212266, 60, "Музыкальная школа №21" },
                    { 77094, 60, "Гимназия №21" },
                    { 200330, 60, "Школа искусств №25" },
                    { 254581, 60, "Татарский мужской лицей №30" },
                    { 166602, 60, "Школа №30" },
                    { 262785, 60, "Школа №31" },
                    { 30927, 60, "Школа №46" },
                    { 246339, 60, "Лицей №45" },
                    { 55946, 60, "Школа №45" },
                    { 62789, 60, "Школа №44" },
                    { 29166, 60, "Школа №43" },
                    { 262441, 60, "Лицей №42" },
                    { 169842, 60, "Профессионально-техническое училище №42" },
                    { 16720, 60, "Школа №42" },
                    { 254681, 60, "Профессиональный лицей №41" },
                    { 46912, 60, "Лицей №41" },
                    { 52295, 60, "Школа №41" },
                    { 974390, 60, "Колледж №41" },
                    { 21065, 60, "Школа №40" },
                    { 62546, 60, "Школа №39" },
                    { 8461, 60, "Школа №38" },
                    { 5152, 60, "Гимназия №37 (Школа №37)" },
                    { 21557, 60, "Школа №36" },
                    { 202014, 60, "Профессионально-техническое училище №36" },
                    { 321088, 60, "Профессиональное училище №35" },
                    { 79016, 60, "Лицей №35" },
                    { 1720183, 60, "Школа №35" },
                    { 12713, 60, "Школа №34" },
                    { 208176, 60, "Техникум народных художественных промыслов (бывш. Профессиональный лицей №34, Профессиональное училище №40)" },
                    { 200672, 60, "Школа №33" },
                    { 268713, 60, "Профессиональный лицей №33 им. Б. Г. Макшанцева" },
                    { 278602, 60, "Школа искусств №33" },
                    { 46879, 60, "Школа №32" },
                    { 123674, 60, "Музыкальная школа №32" },
                    { 149303, 60, "Музыкальная школа №31" },
                    { 31373, 60, "Школа №48" },
                    { 147516, 60, "Энергетический колледж (КЭК)" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8461);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15250);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18389);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20654);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26185);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40559);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40761);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53067);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53167);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53478);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55555);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58941);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59626);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68733);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69816);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77053);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85108);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85634);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86949);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90463);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126102);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159267);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169842);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226872);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242733);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256726);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268972);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 271971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282762);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 289406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 310420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312318);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 315207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 319547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 319567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 322543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 325111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 325614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 326541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 361012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 362575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 422402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 456659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 508385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 539464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 720544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 797946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 831812);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 857121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 899185);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 908777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 908778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 974390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 995667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1061931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1310774);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1374020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1395061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1414866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1463346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1501591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1501592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1560351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1595495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1601149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1627980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1627982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1657268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1657425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1682119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1704392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752250);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756988);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777445);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780550);
        }
    }
}
