using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class SeedMoskowSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 29625, 1, "Школа №1" },
                    { 4625, 1, "Школа №1931" },
                    { 7560, 1, "Школа №1933" },
                    { 4541, 1, "Школа №1934" },
                    { 2004, 1, "Школа №1935" },
                    { 8010, 1, "Школа №1937" },
                    { 16886, 1, "Школа №1938" },
                    { 5376, 1, "Школа №1939" },
                    { 10402, 1, "Школа №1940" },
                    { 10474, 1, "Школа №1941" },
                    { 16375, 1, "Школа №1943 (ЦО 1943)" },
                    { 4240, 1, "Школа №1930" },
                    { 2015, 1, "Школа №1944" },
                    { 23673, 1, "Школа №1946" },
                    { 5616, 1, "Школа №1947" },
                    { 2137, 1, "Центр образования №1948 «Лингвист-М»" },
                    { 58388, 1, "Школа №1950" },
                    { 4826, 1, "Школа №1951" },
                    { 3005, 1, "Школа №1952" },
                    { 58897, 1, "Центр образования №1953 «Москва-98»" },
                    { 3665, 1, "Школа №1955" },
                    { 12903, 1, "Школа №1956" },
                    { 14736, 1, "Школа №1957" },
                    { 3725, 1, "Школа №1945" },
                    { 3557, 1, "Школа №1929" },
                    { 2862, 1, "Школа №1925" },
                    { 4390, 1, "Школа №1923" },
                    { 3705, 1, "Центр образования №1883 «Бутово» (бывш. УВК 1883)" },
                    { 1093842, 1, "Школа №1886" },
                    { 1689499, 1, "Начальная школа-детский сад №1888" },
                    { 538488, 1, "Школа №1889" },
                    { 1722407, 1, "Школа №1893" },
                    { 3486, 1, "Школа №1900" },
                    { 57330, 1, "Школа №1902" },
                    { 6936, 1, "Школа №1903" },
                    { 3346, 1, "Школа №1904" },
                    { 1276, 1, "Школа №1905" },
                    { 52358, 1, "Академическое художественное училище памяти 1905 года (МАХУ)" },
                    { 6888, 1, "Школа №1906" },
                    { 603, 1, "Школа №1908" },
                    { 15678, 1, "Школа №1909" },
                    { 649, 1, "Школа №1910" },
                    { 2456, 1, "Школа №1911" },
                    { 50384, 1, "Школа №1913" },
                    { 13554, 1, "Школа №1916" },
                    { 49086, 1, "Школа №1917" },
                    { 2447, 1, "Школа №1918" },
                    { 3203, 1, "Школа №1919" },
                    { 3042, 1, "Школа №1920" },
                    { 9242, 1, "Школа №1921" },
                    { 1484, 1, "Школа №1958" },
                    { 1616, 1, "Гимназия №1959" },
                    { 1613, 1, "Школа №1961" },
                    { 286990, 1, "Детский сад №1961" },
                    { 12279, 1, "Школа №1995" },
                    { 24646, 1, "Школа №1996" },
                    { 15043, 1, "Школа №1997" },
                    { 22272, 1, "Школа №1998" },
                    { 1718679, 1, "Гимназия «Виктория 2000»" },
                    { 18685, 1, "Школа №2000" },
                    { 6970, 1, "Школа №2001" },
                    { 2917, 1, "Школа №2002" },
                    { 24532, 1, "Школа №2003" },
                    { 4662, 1, "Школа №2005" },
                    { 7326, 1, "Школа №2006" },
                    { 1909, 1, "Школа №2007" },
                    { 14725, 1, "Школа №2008" },
                    { 20622, 1, "Школа №2009" },
                    { 1187, 1, "Школа №2010 им. Героя Советского Союза М. П. Судакова (ЦО 2010)" },
                    { 25336, 1, "Школа №2011" },
                    { 16212, 1, "Школа №2012" },
                    { 12079, 1, "Школа №2013" },
                    { 59370, 1, "Школа №2014" },
                    { 30810, 1, "Школа №2016" },
                    { 52928, 1, "Школа №2017" },
                    { 58039, 1, "Школа №2018" },
                    { 244104, 1, "Школа №2020" },
                    { 3418, 1, "Школа №1994" },
                    { 989205, 1, "Школа №1882" },
                    { 4843, 1, "Школа №1992" },
                    { 35969, 1, "Центр образования №1989" },
                    { 14327, 1, "Школа №1962" },
                    { 15933, 1, "Школа №1963" },
                    { 10346, 1, "Школа №1964" },
                    { 4946, 1, "Школа №1965" },
                    { 6144, 1, "Школа №1967" },
                    { 6817, 1, "Школа №1968" },
                    { 10707, 1, "Школа №1969" },
                    { 4001, 1, "Школа №1970" },
                    { 1753, 1, "Школа №1971" },
                    { 23958, 1, "Школа №1972" },
                    { 3659, 1, "Школа №1973" },
                    { 32076, 1, "Школа №1974" },
                    { 7058, 1, "Школа №1975" },
                    { 1471, 1, "Школа №1976" },
                    { 7811, 1, "Школа №1977" },
                    { 29138, 1, "Школа №1978" },
                    { 6501, 1, "Школа №1979" },
                    { 2425, 1, "Школа №1980" },
                    { 1755, 1, "Школа №1981" },
                    { 8640, 1, "Школа №1983" },
                    { 28667, 1, "Школа №1985 (ЦО 1985)" },
                    { 4794, 1, "Школа №1986" },
                    { 16474, 1, "Школа №1987" },
                    { 26655, 1, "Школа №1990" },
                    { 54286, 1, "Школа №2021" },
                    { 27681, 1, "Центр образования №1881" },
                    { 572488, 1, "Школа №1879" },
                    { 4176, 1, "Школа №1750" },
                    { 1762609, 1, "Прогимназия №1752" },
                    { 625201, 1, "Гимназия №1753" },
                    { 102706, 1, "Школа №1759" },
                    { 854156, 1, "Школа №1764" },
                    { 1478590, 1, "Школа №1768" },
                    { 244261, 1, "Кадетская школа №1770 «Московский музыкальный кадетский корпус»" },
                    { 1663990, 1, "Школа №1771" },
                    { 1674550, 1, "Прогимназия №1774" },
                    { 989210, 1, "Прогимназия №1776" },
                    { 380355, 1, "Школа №1749" },
                    { 429348, 1, "Кадетская школа №1778 «Московский Шереметьевский кадетский корпус»" },
                    { 526439, 1, "Кадетская школа №1780 «Кадетский корпус памяти Героев Сталинградской битвы»" },
                    { 465201, 1, "Кадетская школа №1783 «Московский кадетский корпус Героев Космоса»" },
                    { 534813, 1, "Школа №1784" },
                    { 1662193, 1, "Кадетская школа №1785 «Таганский кадетский корпус»" },
                    { 1679253, 1, "Гимназия №1786" },
                    { 1743423, 1, "Гимназия №1788" },
                    { 3075, 1, "Лицей №1793 «Жулебино» (бывш. ЦО 1439, шк. 1936, 1922)" },
                    { 1770951, 1, "Школа №1794" },
                    { 1751470, 1, "Школа №1795 «Лосиноостровская»" },
                    { 1742242, 1, "Гимназия №1796 «Гольяново»" },
                    { 1728217, 1, "Прогимназия №1779" },
                    { 8215, 1, "Гимназия №1748 «Вертикаль» (бывш. шк. 1748, ЦО 1748)" },
                    { 2525, 1, "Школа №1747" },
                    { 3783, 1, "Школа №1745" },
                    { 2635, 1, "Кадетская школа №1702 «Петровский кадетский корпус»" },
                    { 20537, 1, "Школа №1702" },
                    { 674090, 1, "Гимназия №1706" },
                    { 1667745, 1, "Прогимназия №1709" },
                    { 41024, 1, "Школа №1712" },
                    { 8180, 1, "Школа №1714" },
                    { 36520, 1, "Школа №1715" },
                    { 5937, 1, "Школа №1716" },
                    { 91392, 1, "Гимназия №1717" },
                    { 44834, 1, "Школа №1718" },
                    { 1523539, 1, "Кадетская школа №1721" },
                    { 294194, 1, "Гимназия №1723" },
                    { 130227, 1, "Школа №1726" },
                    { 130904, 1, "Гимназия №1726" },
                    { 1675301, 1, "Прогимназия №1728" },
                    { 312728, 1, "Гимназия №1729" },
                    { 758095, 1, "Гимназия №1733" },
                    { 380363, 1, "Детский сад №1736" },
                    { 3406, 1, "Школа №1737" },
                    { 11793, 1, "Школа №1738" },
                    { 27976, 1, "Школа №1740" },
                    { 3840, 1, "Школа №1741" },
                    { 1643, 1, "Школа №1744" },
                    { 1758692, 1, "Гимназия №1797 «Богородская»" },
                    { 11005, 1, "Гимназия №1798 «Феникс» (бывш. УВК, ЦО «Феникс» 1666, шк. 406)" },
                    { 1779509, 1, "Школа №1799" },
                    { 1743424, 1, "Гимназия №1799 «Экополис»" },
                    { 6392, 1, "Школа №1847" },
                    { 28410, 1, "Школа №1848" },
                    { 1633, 1, "Школа №1849" },
                    { 791310, 1, "Школа №1850" },
                    { 27759, 1, "Школа №1852" },
                    { 314703, 1, "Школа №1854" },
                    { 214518, 1, "Учебно-воспитательный комплекс №1857" },
                    { 28933, 1, "Учебно-воспитательный комплекс №1858" },
                    { 5878, 1, "Лицей №1858" },
                    { 2747, 1, "Учебно-воспитательный комплекс №1859" },
                    { 15640, 1, "Школа №1861" },
                    { 1642, 1, "Школа №1862 (бывш. УВК 1862, ВОКК)" },
                    { 23682, 1, "Учебно-воспитательный комплекс №1863" },
                    { 5281, 1, "Школа №1863" },
                    { 5618, 1, "Гимназия №1865" },
                    { 1686481, 1, "Школа №1867" },
                    { 11142, 1, "Школа №1871" },
                    { 376702, 1, "Детский сад №1872" },
                    { 26255, 1, "Школа №1873 УВК" },
                    { 2348, 1, "Школа №1874 (бывш. УВК 1874, ЦО 1874)" },
                    { 21142, 1, "Школа №1875" },
                    { 58175, 1, "Учебно-воспитательный комплекс №1876" },
                    { 25527, 1, "Школа №1877 «Люблино» (бывш. УВК 1877, ЦО 1877)" },
                    { 22459, 1, "Школа №1846" },
                    { 1674, 1, "Школа №1881" },
                    { 1006556, 1, "Учебно-воспитательный комплекс №1844" },
                    { 30743, 1, "Учебно-воспитательный комплекс №1841 им. Галины Вишневской" },
                    { 42969, 1, "Прогимназия  №1801 (бывш. УВК 1801)" },
                    { 506529, 1, "Учебно-воспитательный комплекс №1802" },
                    { 287060, 1, "Учебно-воспитательный комплекс №1803" },
                    { 29714, 1, "Центр образования №1804" },
                    { 29252, 1, "Школа №1805" },
                    { 446415, 1, "Детский сад №1808" },
                    { 11116, 1, "Учебно-воспитательный комплекс №1810" },
                    { 25858, 1, "Учебно-воспитательный комплекс №1811" },
                    { 3893, 1, "Школа №1811" },
                    { 4577, 1, "Центр образования №1816 (бывш. УВК 1816)" },
                    { 1766128, 1, "Прогимназия №1819" },
                    { 1658754, 1, "Детский сад №1820" },
                    { 51186, 1, "Школа №1823" },
                    { 523278, 1, "Детский сад №1823" },
                    { 6038, 1, "Школа №1825 (бывш. шк. 1070, УВК 1825)" },
                    { 294182, 1, "Школа №1826" },
                    { 10520, 1, "Центр образования №1828 «Сабурово» (бывш. шк. 1828, УВК 1828, шк. 984)" },
                    { 30405, 1, "Учебно-воспитательный комплекс №1829" },
                    { 15579, 1, "Учебно-воспитательный комплекс №1832" },
                    { 406404, 1, "Школа №1834" },
                    { 413501, 1, "Начальная школа-детский сад №1835 «Материнская школа»" },
                    { 35180, 1, "Школа №1837" },
                    { 43166, 1, "Центр образования №1840 (бывш. УВК 1840)" },
                    { 3708, 1, "Гимназия №1842" },
                    { 802610, 1, "Школа №2025" },
                    { 293022, 1, "Школа №2026" },
                    { 184418, 1, "Школа №2028" },
                    { 17296, 1, "Вечерняя физико-математическая школа при МГТУ им. Баумана" },
                    { 49520, 1, "Вечерняя физико-техническая школа при МФТИ" },
                    { 57541, 1, "Вечерняя химическая школа при РХТУ им. Д. И. Менделеева" },
                    { 1777431, 1, "Виртуальная школа Profile" },
                    { 37823, 1, "Владимирская гимназия" },
                    { 1779576, 1, "Военно-музыкальная школа (МВМШ)" },
                    { 56799, 1, "Военно-музыкальное училище (МВМУ)" },
                    { 884829, 1, "Вокальная школа академического и эстрадного пения" },
                    { 1659571, 1, "Всероссийская творческая мастерская эстрадного искусства им. Л. С. Маслюкова" },
                    { 1539339, 1, "Всероссийский заочный физико-математический лицей «Авангард»" },
                    { 43431, 1, "Вечерняя физико-математическая школа при МГИЭМ" },
                    { 1745587, 1, "Высшая партийная школа ЛДПР" },
                    { 1778856, 1, "Высшая школа кино и телевидения «Останкино»" },
                    { 30681, 1, "Высшая школа народных искусств (ВШНИ, МШХР)" },
                    { 1778994, 1, "Высшая школа практической психологии и бизнеса" },
                    { 1778993, 1, "Высшая школа психологии" },
                    { 1759362, 1, "Высшая школа психологического консультирования (ВШПК)" },
                    { 1777124, 1, "Высшая Школа Стилистики" },
                    { 1780552, 1, "Высшая школа технологий и управления МГУТУ им. К. Г. Разумовского" },
                    { 1773809, 1, "Высшая школа фитнеса и бодибилдинга" },
                    { 784633, 1, "Высшая школа экономики и сервиса" },
                    { 1718929, 1, "Гёте-Институт (Goethe-Institut Moskau)" },
                    { 1740852, 1, "Высшая школа деятелей сценического искусства под руководством Г. Г. Дадамяна (ВШДСИ Г. Г. Дадамяна)" },
                    { 29537, 1, "Вечерняя физико-математическая школа при МАИ" },
                    { 56909, 1, "Вечерняя математическая школа при факультете ВМиК МГУ" },
                    { 41432, 1, "Британский банковско-финансовый колледж (ББФК)" },
                    { 1760051, 1, "Академия Лидерства" },
                    { 1780551, 1, "Академия медицинского образования" },
                    { 1756788, 1, "Академия образования «Планета красоты»" },
                    { 910238, 1, "Академия парикмахерского искусства «Долорес»" },
                    { 1761683, 1, "Академия персонального лидерства «Маяк»" },
                    { 26081, 1, "Академия танца Натальи Нестеровой" },
                    { 34369, 1, "Академия фотографии" },
                    { 53398, 1, "Американская школа «Луиза Хилвуд»" },
                    { 58342, 1, "Архитектурная школа при МИИГАиК" },
                    { 1759031, 1, "Архитектурный колледж МАСИ" },
                    { 1733572, 1, "Ассоциация профессионалов фитнеса (FPA)" },
                    { 1632258, 1, "Ассоциация профессиональных пирсеров России" },
                    { 1764298, 1, "Ассоциация профессиональных тренеров Америки «Bestbody»" },
                    { 1772214, 1, "Астрофизическая школа «Траектория»" },
                    { 1758140, 1, "Аудио школа DJ Грува" },
                    { 1765784, 1, "Аудио школа Dj Грува" },
                    { 11912, 1, "Банковский экономический колледж МБИ (МБЭК МБИ)" },
                    { 1600255, 1, "Бизнес-колледж МАП при Правительстве Москвы" },
                    { 1767986, 1, "Бизнес-школа ИЭУП РГГУ" },
                    { 1769640, 1, "БМ Институт" },
                    { 1771863, 1, "Богословский колледж Свято-Филаретовского института" },
                    { 1766246, 1, "Британская высшая школа дизайна" },
                    { 4230, 1, "Британская международная школа (BIS, British International School)" },
                    { 1743093, 1, "ГБПОУ «Воробьёвы горы»" },
                    { 42221, 1, "Геологическая школа МГУ" },
                    { 26055, 1, "Гимназия «ABC»" },
                    { 18035, 1, "Гимназия «Алфавит»" },
                    { 510382, 1, "Гуманитарно-экологический колледж при ГЭИ" },
                    { 57066, 1, "Гуманитарный колледж РГГУ" },
                    { 50865, 1, "Гуманитарный лицей" },
                    { 102439, 1, "Гуманитарный лицей при МАБиУ" },
                    { 114984, 1, "Гуманитарный техникум экономики и права (ГТЭП)" },
                    { 41349, 1, "Дворец творчества детей и молодёжи «На Полянке» (МГДТДМ)" },
                    { 1770010, 1, "Дворец творчества детей и молодежи «Севастополец»" },
                    { 46383, 1, "Детская музыкальная школа им. Й. Гайдна" },
                    { 1762610, 1, "Детская театральная студия под руководством Ирины Феофановой" },
                    { 49288, 1, "Детская хоровая студия «Пионерия» им. Г. А. Струве" },
                    { 1779958, 1, "Детская школа искусств им. Е. Ф. Светланова" },
                    { 1749878, 1, "Детская школа искусств им. Н. Г. Рубинштейна" },
                    { 518806, 1, "Детский воспитательно-образовательный комплекс «Пенаты»" },
                    { 55820, 1, "Детско-молодежный центр «Коньково»" },
                    { 214926, 1, "Детско-юношеская спортивная школа «Авангард»" },
                    { 14453, 1, "Детско-юношеская спортивная школа «Олимп»" },
                    { 53162, 1, "Детско-юношеская спортивная школа «Химки»" },
                    { 1759253, 1, "Детско-юношеская спортивная школа «Энтузиаст»" },
                    { 36791, 1, "Детско-юношеская спортивная школа ПФК ЦСКА" },
                    { 50339, 1, "Детско-юношеская спортивная школа ФК «Интер»" },
                    { 50338, 1, "Детско-юношеская спортивная школа ФК «Катюша-Спартак»" },
                    { 57954, 1, "Детско-юношеская спортивная школа ФК «Строгино»" },
                    { 101164, 1, "Детско-юношеская спортивная школа ФК «Феликс»" },
                    { 1766427, 1, "Гуманитарно-правовой колледж МГПУ" },
                    { 1747389, 1, "Академия коммуникаций «Wordshop»" },
                    { 1598423, 1, "Гуманитарная гимназия «Альтаир»" },
                    { 758181, 1, "Государственный открытый колледж (МГОК, бывш. МГЗППК, МЗПТ)" },
                    { 7223, 1, "Гимназия «Гармония»" },
                    { 1478597, 1, "Гимназия «Диалектика»" },
                    { 59699, 1, "Гимназия «Доверие»" },
                    { 12298, 1, "Гимназия «Жуковка»" },
                    { 56558, 1, "Гимназия «Знайка»" },
                    { 28278, 1, "Гимназия «Классика»" },
                    { 55087, 1, "Гимназия «Мастер-класс»" },
                    { 51563, 1, "Гимназия «Мини-Авионика»" },
                    { 53239, 1, "Гимназия «Образ»" },
                    { 18749, 1, "Гимназия «Свет»" },
                    { 21100, 1, "Гимназия «Сократ»" },
                    { 56553, 1, "Гимназия «Талисман»" },
                    { 41931, 1, "Гимназия «Утро»" },
                    { 1851, 1, "Гимназия «Эллада»" },
                    { 46240, 1, "Гимназия им. Григория Неокесарийского" },
                    { 49014, 1, "Гимназия им. Кирилла и Мефодия" },
                    { 1756742, 1, "Гимназия МГУДТ" },
                    { 133309, 1, "Гитарный колледж" },
                    { 102158, 1, "Городской гуманитарно-правовой колледж (ГГПК)" },
                    { 1757939, 1, "Городской центр дополнительного профессионального образования (Учебный центр ГЦДПО)" },
                    { 1725339, 1, "Госкурсы «ИН-ЯЗ»" },
                    { 44885, 1, "Государственная столичная гимназия" },
                    { 214430, 1, "Государственное музыкальное училище эстрадного и джазового искусства (ГМУЭДИ, ГМКЭДИ)" },
                    { 51747, 1, "Грузинская школа «Просвещение»" },
                    { 1739783, 1, "Академия классической фотографии (АКФ)" },
                    { 1781140, 1, "Академия информационных систем (АИС)" },
                    { 1747256, 1, "Академия журналистики «Коммерсант»" },
                    { 19331, 1, "Школа №2089 (бывш. шк. 430, УВК 1830, ЦО 1830)" },
                    { 1752362, 1, "Школа №2090" },
                    { 1742909, 1, "Школа №2092 им. И. Н. Кожедуба" },
                    { 1741170, 1, "Школа №2093 им. А. Н. Савельева" },
                    { 49311, 1, "Школа №2094 (бывш. шк. 419)" },
                    { 1780329, 1, "Школа №2095" },
                    { 1765477, 1, "Школа №2097" },
                    { 1734232, 1, "Школа №2098 им. Л. М. Доватора" },
                    { 909773, 1, "Детский сад №2098" },
                    { 1777010, 1, "Школа №2099" },
                    { 12917, 1, "Школа №2100 - Структурное подразделение №1 (бывш. шк. 660)" },
                    { 1342023, 1, "Школа №2100 - Структурное подразделение №2 (бывш. ЦО 1884)" },
                    { 948195, 1, "Школа №2100 - Структурное подразделение №3 (бывш. лиц. 1594)" },
                    { 1739992, 1, "Школа №2101 «Филёвский образовательный центр»" },
                    { 1758141, 1, "Школа №2103" },
                    { 1774477, 1, "Школа №2104 на Таганке" },
                    { 532457, 1, "Детский сад №2104" },
                    { 1758957, 1, "Школа на Яузе (бывш. шк. 2105)" },
                    { 12063, 1, "Школа №2106" },
                    { 1738982, 1, "Школа №2109 (бывш. шк. 1176, 2046, 2047)" },
                    { 16605, 1, "Школа №2110 Многопрофильный образовательный комплекс «Марьино» (бывш. шк. 499)" },
                    { 1764299, 1, "Школа №2111 «Новая волна»" },
                    { 8901, 1, "Школа №2113 (бывш. шк. 859, 900, детские сады 741, 748, 900, 2372)" },
                    { 1770459, 1, "Школа №2088 «Грайвороново»" },
                    { 1270323, 1, "Детский сад №2113" },
                    { 1745088, 1, "Школа №2087 Многопрофильный образовательный комплекс «Открытие»" },
                    { 700465, 1, "Детский сад №2085" },
                    { 1662330, 1, "Школа №2029" },
                    { 97699, 1, "Школа №2030 «Школа будущего»" },
                    { 189110, 1, "Школа №2031" },
                    { 26116, 1, "Школа №2032" },
                    { 58289, 1, "Школа №2033" },
                    { 1663045, 1, "Школа №2034" },
                    { 436204, 1, "Школа №2035" },
                    { 899501, 1, "Школа №2036" },
                    { 733858, 1, "Школа №2042" },
                    { 1291509, 1, "Школа №2043" },
                    { 861338, 1, "Школа №2044" },
                    { 17094, 1, "Школа №2048 (бывш. шк. 105, 592)" },
                    { 1659568, 1, "Школа №2049" },
                    { 1720456, 1, "Школа №2051" },
                    { 1691905, 1, "Школа №2053" },
                    { 1739399, 1, "Школа №2054" },
                    { 12918, 1, "Школа №2055 (бывш. шк. 83, 340)" },
                    { 1744509, 1, "Школа №2059" },
                    { 716501, 1, "Детский сад №2060" },
                    { 794448, 1, "Школа №2063 (бывш. шк. 1)" },
                    { 1691894, 1, "Школа №2065 «Вектор» (бывш. шк. 3)" },
                    { 1701255, 1, "Гимназия №2072" },
                    { 1701203, 1, "Школа №2077" },
                    { 1738975, 1, "Школа №2086" },
                    { 40116, 1, "Школа №1701" },
                    { 1740016, 1, "Школа №2114" },
                    { 1744914, 1, "Школа №2116 «Зябликово»" },
                    { 1767196, 1, "Moscow Business School (Московская бизнес школа – Семинары)" },
                    { 1782148, 1, "The English School of Science and Technology" },
                    { 1687981, 1, "Авиационная школа «Гамаюн»" },
                    { 1706632, 1, "Авиационная школа Аэрофлота" },
                    { 784637, 1, "Авиационный вечерний техникум (МАВТ)" },
                    { 1773706, 1, "Австрийская Академия стиля Mozart Аrt House" },
                    { 15846, 1, "Автомобилестроительный колледж (МАСК)" },
                    { 35891, 1, "Автомобильно-дорожный колледж им. А. А. Николаева (МАДК)" },
                    { 1675672, 1, "Авторская школа  музыкального исполнительства профессора Светланы Карась" },
                    { 526363, 1, "Авторская школа Сергея Князева для event-менеджеров" },
                    { 1676697, 1, "Авторская школа-студия «Детали»" },
                    { 1723412, 1, "Автошкола «Учебный комбинат на Яблочкова»" },
                    { 794673, 1, "Автошкола «Центральная автошкола»" },
                    { 1519698, 1, "Автошкола Учебно-курсовой комбинат «Автодор»" },
                    { 105994, 1, "Академическая школа «Гелан»" },
                    { 521150, 1, "Академическая школа дизайна" },
                    { 1593505, 1, "Академический правовой колледж РПА МЮ РФ" },
                    { 1080642, 1, "Академический региональный техникум (АРТ)" },
                    { 5967, 1, "Академический художественный лицей МАХЛ РАХ (бывш. МСХШ)" },
                    { 4857, 1, "Академическое музыкальное училище (колледж) при МГК им. Чайковского" },
                    { 1781149, 1, "Академия АйТи" },
                    { 1781311, 1, "Академия бодибилдинга и фитнеса (Энерджим Фитнес Студио)" },
                    { 1772066, 1, "Академия груминга «Боншери»" },
                    { 1777791, 1, "IT-колледж Мирбис" },
                    { 1780680, 1, "Школа №2115" },
                    { 1773260, 1, "International School of Moscow" },
                    { 1775945, 1, "Gogol School" },
                    { 1764459, 1, "Школа №2120" },
                    { 1763414, 1, "Школа №2121 им. Маршала Советского Союза С. К. Куркоткина" },
                    { 2546, 1, "Школа №2123 им. Мигеля Эрнандеса (шк. 110)" },
                    { 1758045, 1, "Школа №2126 «Перово»" },
                    { 1764301, 1, "Школа №2127" },
                    { 4245, 1, "Школа №2127 (бывш. гимн.1048 «Новокосино», 1926, шк. 1927)" },
                    { 1762138, 1, "Школа №2128 «Энергия» (бывш. шк. 1914, 1924)" },
                    { 1775222, 1, "Школа №2129 им. Героя Советского Союза П. И. Романова" },
                    { 1667737, 1, "Детский сад №2148" },
                    { 1594059, 1, "Детский сад №2150" },
                    { 1627968, 1, "Детский сад №2173" },
                    { 9547, 1, "Школа №2200 (бывш. гимназия)" },
                    { 2239, 1, "Гимназия №2200 (бывш. шк. 1268)" },
                    { 454742, 1, "Детский сад №2259" },
                    { 1711373, 1, "Японская школа в Москве  モスクワ日本人学校" },
                    { 1763157, 1, "Alexander Belgorokov Business School" },
                    { 8243, 1, "Anglo-American School of Moscow" },
                    { 1669882, 1, "English International School Moscow" },
                    { 1768916, 1, "Estill Voice Training" },
                    { 1763527, 1, "Fashion Factory School" },
                    { 1778788, 1, "FreeForm.Edit" },
                    { 1777957, 1, "GeekBrains" },
                    { 1777507, 1, "GeekUniversity" },
                    { 1766291, 1, "Indonesian School of Moscow" },
                    { 38354, 1, "Детско-юношеский центр «Отрадное»" },
                    { 9406, 1, "Школа №1700" },
                    { 408516, 1, "Учебно-воспитательный комплекс №1697" },
                    { 506907, 1, "Школа №1385" },
                    { 720541, 1, "Школа №1386" },
                    { 541894, 1, "Школа №1387" },
                    { 4809, 1, "Школа №1388 (бывш. шк. 182)" },
                    { 5975, 1, "Школа №1389 (бывш. шк. 889)" },
                    { 1782144, 1, "Школа № 1392 им. Д. В. Рябинкина" },
                    { 1723102, 1, "Школа №1393 «Школа РОСТ»" },
                    { 1779433, 1, "Школа №1394 «На набережной»" },
                    { 4913, 1, "Школа №1397" },
                    { 1050567, 1, "Школа №1399" },
                    { 646913, 1, "Школа №1384" },
                    { 4440, 1, "Школа №1400" },
                    { 51667, 1, "Центр образования №1402 им. А. С. Пушкина" },
                    { 133468, 1, "Профессиональная школа №1403" },
                    { 136246, 1, "Центр образования №1403" },
                    { 9581, 1, "Гимназия №1404 «Гамма» (бывш. ЦО 1404 «Гамма», шк. 890, УВК 1634)" },
                    { 3233, 1, "Школа №1405" },
                    { 58912, 1, "Центр образования №1406" },
                    { 48786, 1, "Школа №1406 «Центр на Павелецкой»" },
                    { 1349849, 1, "Детский сад №1406" },
                    { 1600082, 1, "Детский сад №1407" },
                    { 286998, 1, "Центр образования №1408" },
                    { 14675, 1, "Школа №1401" },
                    { 1666778, 1, "Школа №1383" },
                    { 701572, 1, "Школа №1381" },
                    { 41402, 1, "Школа №1380" },
                    { 102490, 1, "Школа №1358" },
                    { 505172, 1, "Детский сад №1358" },
                    { 10504, 1, "Школа №1359" },
                    { 32927, 1, "Школа №1360" },
                    { 1662625, 1, "Школа №1361" },
                    { 1657427, 1, "Школа №1362" },
                    { 336243, 1, "Школа №1363" },
                    { 465366, 1, "Школа №1364" },
                    { 1091, 1, "Школа №1365" },
                    { 1535502, 1, "Школа №1366" },
                    { 5408, 1, "Центр образования №1367" },
                    { 136258, 1, "Лицей №1367 (бывш. шк. 1367)" },
                    { 245403, 1, "Школа №1368" },
                    { 7344, 1, "Школа №1370 (бывш. шк. 965)" },
                    { 1620488, 1, "Школа №1371" },
                    { 287170, 1, "Школа «Искусство» №1372" },
                    { 287007, 1, "Колледж №1372" },
                    { 786195, 1, "Школа №1373" },
                    { 899382, 1, "Школа №1374" },
                    { 537183, 1, "Школа №1375" },
                    { 533746, 1, "Школа №1376" },
                    { 438241, 1, "Школа №1378" },
                    { 239038, 1, "Школа №1379 (бывш. шк. 2022)" },
                    { 244063, 1, "Гимназия №1409" },
                    { 858, 1, "Школа №1411" },
                    { 24430, 1, "Школа №1412" },
                    { 13247, 1, "Школа №1413" },
                    { 685619, 1, "Центр образования №1444" },
                    { 27473, 1, "Центр образования №1445" },
                    { 2032, 1, "Центр образования №1446 (бывш. шк. 164)" },
                    { 1072484, 1, "Центр образования №1447" },
                    { 1662102, 1, "Центр образования №1448" },
                    { 1764300, 1, "Центр образования №1449" },
                    { 59339, 1, "Школа №1450 «Олимп» (бывш. ЦО 1450, шк. 653)" },
                    { 699877, 1, "Гимназия №1450" },
                    { 530, 1, "Лицей №1451 (бывш. ЦО 1451, шк. 675)" },
                    { 408865, 1, "Гимназия №1452 «Богородская»" },
                    { 4246, 1, "Центр образования №1453 (бывш. шк. 792)" },
                    { 2352, 1, "Центр образования №1454 (бывш. шк. 238)" },
                    { 1064129, 1, "Школа №1456" },
                    { 2756, 1, "Центр образования №1457 (бывш. шк. 1083)" },
                    { 626073, 1, "Центр образования №1458" },
                    { 1270246, 1, "Центр образования №1459" },
                    { 3593, 1, "Школа №1460 (бывш. шк. 1907)" },
                    { 3741, 1, "Центр образования №1461 (шк. 610)" },
                    { 912, 1, "Центр образования №1462 «Палитра» (бывш. шк. 1942)" },
                    { 1647517, 1, "Центр образования №1463" },
                    { 1283667, 1, "Центр образования №1464" },
                    { 10004, 1, "Школа №1465 им. Н. Г. Кузнецова (бывш. шк. 637, 665, 591, веч. шк. 124)" },
                    { 1048953, 1, "Школа №1466 им. Н. Рушевой" },
                    { 1098084, 1, "Центр образования №1443" },
                    { 7862, 1, "Школа №1357" },
                    { 1269415, 1, "Центр образования №1441" },
                    { 1067574, 1, "Центр образования №1438" },
                    { 10242, 1, "Школа №1414" },
                    { 512, 1, "Школа №1415" },
                    { 3114, 1, "Школа №1416" },
                    { 52117, 1, "Центр образования №1417" },
                    { 7962, 1, "Школа №1419" },
                    { 2143, 1, "Школа №1420 (ЦО 1420)" },
                    { 336244, 1, "Гимназия №1421" },
                    { 894942, 1, "Центр образования №1422" },
                    { 51593, 1, "Школа №1423" },
                    { 50118, 1, "Центр образования №1424" },
                    { 540963, 1, "Школа №1425" },
                    { 1687894, 1, "Школа №1426" },
                    { 1609, 1, "Центр образования №1428 (бывш. шк. 903)" },
                    { 560693, 1, "Детский сад №1428" },
                    { 3618, 1, "Школа №1429 (бывш. шк. 342, 348)" },
                    { 35924, 1, "Школа №1430" },
                    { 825273, 1, "Школа №1431" },
                    { 1642381, 1, "Школа №1432" },
                    { 545091, 1, "Центр образования №1433" },
                    { 457541, 1, "Школа №1434" },
                    { 1402337, 1, "Центр образования №1435" },
                    { 4139, 1, "Центр образования №1436 (бывш. шк. 1012)" },
                    { 1712301, 1, "Центр образования №1437" },
                    { 747168, 1, "Центр образования №1440" },
                    { 1501595, 1, "Школа №1467 (бывш.  ЦО 1467)" },
                    { 983018, 1, "Школа №1356" },
                    { 2016, 1, "Школа №1354" },
                    { 1109, 1, "Школа №1263" },
                    { 2697, 1, "Школа №1264" },
                    { 3072, 1, "Школа №1265" },
                    { 3271, 1, "Школа №1266" },
                    { 5060, 1, "Школа №1267" },
                    { 4355, 1, "Школа №1269" },
                    { 2650, 1, "Школа №1270" },
                    { 3864, 1, "Школа №1271" },
                    { 7055, 1, "Гимназия №1272" },
                    { 5400, 1, "Школа №1273" },
                    { 2807, 1, "Школа №1262" },
                    { 1357, 1, "Гимназия №1274 им. В. В. Маяковского" },
                    { 15547, 1, "Школа №1276" },
                    { 835, 1, "Школа №1277" },
                    { 2308, 1, "Школа №1278" },
                    { 1248, 1, "Школа №1279" },
                    { 4272, 1, "Школа №1280" },
                    { 5291, 1, "Школа №1282" },
                    { 5736, 1, "Школа №1283" },
                    { 1305308, 1, "Детский сад №1283" },
                    { 4293, 1, "Школа №1284" },
                    { 2418, 1, "Школа №1285" },
                    { 4557, 1, "Школа №1275" },
                    { 1642380, 1, "Детский сад №1260" },
                    { 5469, 1, "Школа №1260" },
                    { 3706, 1, "Школа №1259" },
                    { 1096, 1, "Школа №1236" },
                    { 4918, 1, "Школа №1237" },
                    { 2243, 1, "Школа №1238" },
                    { 1335, 1, "Школа №1239" },
                    { 623, 1, "Школа №1240" },
                    { 3309, 1, "Школа №1241" },
                    { 7174, 1, "Школа №1242" },
                    { 985, 1, "Школа №1243" },
                    { 3599, 1, "Школа №1244" },
                    { 3438, 1, "Школа №1245" },
                    { 1915, 1, "Школа №1246" },
                    { 2651, 1, "Школа №1247" },
                    { 1229, 1, "Школа №1248" },
                    { 8631, 1, "Школа №1249" },
                    { 4035, 1, "Школа №1250" },
                    { 2510, 1, "Школа №1251 им. генерала Шарля де Голля" },
                    { 2303, 1, "Школа №1252 им. Сервантеса" },
                    { 766, 1, "Школа №1253" },
                    { 8066, 1, "Школа №1254" },
                    { 1188, 1, "Школа №1256" },
                    { 1355, 1, "Гимназия №1257 (бывш. шк. 1257)" },
                    { 37693, 1, "Лицей №1257" },
                    { 3409, 1, "Школа №1258" },
                    { 6500, 1, "Школа №1286" },
                    { 4537, 1, "Школа №1287" },
                    { 3336, 1, "Школа №1288 им. Героя Советского Союза Н. В. Троян" },
                    { 51962, 1, "Школа №1289" },
                    { 340, 1, "Школа №1317" },
                    { 7072, 1, "Московская международная киношкола №1318" },
                    { 1769249, 1, "Детский сад №1318" },
                    { 7030, 1, "Школа №1319" },
                    { 678, 1, "Школа №1320" },
                    { 49979, 1, "Школа №1321 «Ковчег»" },
                    { 10716, 1, "Школа №1323" },
                    { 50869, 1, "Школа №1324" },
                    { 1482, 1, "Школа №1326" },
                    { 2367, 1, "Школа №1327" },
                    { 28863, 1, "Школа №1328" },
                    { 189133, 1, "Школа № 1329" },
                    { 33950, 1, "Школа №1331" },
                    { 3073, 1, "Школа №1332" },
                    { 58441, 1, "Гимназия №1333 (Донская)" },
                    { 47037, 1, "Школа №1338" },
                    { 32890, 1, "Школа №1344" },
                    { 1758006, 1, "Школа №1347" },
                    { 239982, 1, "Лицей №1347" },
                    { 49649, 1, "Лицей №1348" },
                    { 2866, 1, "Школа №1349" },
                    { 3583, 1, "Школа №1350" },
                    { 15150, 1, "Школа №1352" },
                    { 20473, 1, "Школа №1316" },
                    { 44381, 1, "Школа №1355" },
                    { 2647, 1, "Школа №1315" },
                    { 2330, 1, "Школа №1313" },
                    { 1072, 1, "Школа №1290" },
                    { 4217, 1, "Школа №1291" },
                    { 3272, 1, "Школа №1293 (бывш. шк. 389)" },
                    { 29417, 1, "Школа №1293 (бывш. шк. 701)" },
                    { 1785, 1, "Школа №1294" },
                    { 59078, 1, "Школа №1295" },
                    { 2636, 1, "Школа №1296" },
                    { 7678, 1, "Школа №1297" },
                    { 3236, 1, "Школа №1298" },
                    { 7940, 1, "Технологическая школа №1299 ОРТ" },
                    { 59624, 1, "Школа №1301 им. Е. Т. Гайдара (бывш. шк. 724, УВК 1813)" },
                    { 2828, 1, "Школа №1302" },
                    { 45442, 1, "Пироговская школа (1302)" },
                    { 1583, 1, "Лицей №1303" },
                    { 1486452, 1, "Детский сад №1303" },
                    { 3015, 1, "Школа №1304" },
                    { 22137, 1, "Школа №1305" },
                    { 1793, 1, "Гимназия №1306" },
                    { 2391, 1, "Школа №1307" },
                    { 57698, 1, "Школа №1308" },
                    { 7673, 1, "Школа №1309" },
                    { 3675, 1, "Лицей №1310" },
                    { 3777, 1, "Школа №1311" },
                    { 4028, 1, "Школа №1314" },
                    { 5577, 1, "Школа №1468" },
                    { 1673185, 1, "Центр образования №1469" },
                    { 1650916, 1, "Школа №1470 (бывш. ЦО 1470, шк. 270)" },
                    { 1672038, 1, "Центр образования №1613" },
                    { 10702, 1, "Школа №1614" },
                    { 14344, 1, "Школа №1615" },
                    { 5668, 1, "Учебно-воспитательный комплекс №1615" },
                    { 22273, 1, "Школа №1617" },
                    { 16357, 1, "Школа №1618" },
                    { 53897, 1, "Школа №1619 им. М. И. Цветаевой" },
                    { 1757882, 1, "Московский объединенный кадетский корпус Героев Севастополя (МОКК) Гимназии №1619" },
                    { 15920, 1, "Учебно-воспитательный комплекс №1620" },
                    { 4278, 1, "Школа №1621" },
                    { 1774472, 1, "Дeтский сад №1612" },
                    { 59594, 1, "Школа №1621 «Школа лидерства Лаудер Эц Хайм»" },
                    { 3337, 1, "Школа №1623 (бывш. шк. 1172, УВК 1623)" },
                    { 55734, 1, "Школа №1624 «Созвездие»" },
                    { 316596, 1, "Школа №1625" },
                    { 16864, 1, "Школа №1626" },
                    { 50542, 1, "Учебно-воспитательный комплекс №1627" },
                    { 6958, 1, "Школа №1631 (бывш. УВК 1631)" },
                    { 56968, 1, "Школа №1632" },
                    { 10861, 1, "Учебно-воспитательный комплекс №1633" },
                    { 322792, 1, "Учебно-воспитательный комплекс №1635" },
                    { 4023, 1, "Школа №1636 «Ника» (бывш. Гимназия №1636 «Ника», шк. 988, УВК 1636)" },
                    { 51674, 1, "Школа №1622" },
                    { 1534486, 1, "Школа №1611" },
                    { 627810, 1, "Детский сад №1610" },
                    { 226887, 1, "Учебно-воспитательный комплекс №1608" },
                    { 1781652, 1, "Школа № 1583 им. К. А. Керимова" },
                    { 716499, 1, "Гимназия №1583" },
                    { 240018, 1, "Гимназия №1584" },
                    { 646871, 1, "Лицей №1586" },
                    { 228432, 1, "Гимназия №1587" },
                    { 6695, 1, "Школа №1588 (бывш. шк. 803)" },
                    { 58206, 1, "Школа №1589" },
                    { 646131, 1, "Школа №1590 им. Героя Советского Союза В. В. Колесника (Гимназия №1590)" },
                    { 328551, 1, "Гимназия №1591" },
                    { 661566, 1, "Школа №1592 (бывш. гимназия)" },
                    { 1176212, 1, "Гимназия №1593" },
                    { 1597353, 1, "Гимназия №1595" },
                    { 1707133, 1, "Гимназия №1596" },
                    { 1660761, 1, "Гимназия №1597" },
                    { 457539, 1, "Лицей №1598" },
                    { 1368, 1, "Гимназия №1599 (бывш. шк. 1209)" },
                    { 38246, 1, "Учебно-воспитательный комплекс №1601" },
                    { 9933, 1, "Центр образования №1601 (бывш. шк. 209)" },
                    { 5148, 1, "Школа №1602 (ЦО 1602)" },
                    { 13953, 1, "Школа №1604" },
                    { 9454, 1, "Школа №1605" },
                    { 247445, 1, "Школа №1606" },
                    { 36390, 1, "Учебно-воспитательный комплекс №1607" },
                    { 5323, 1, "Гимназия №1637 (бывш. шк. 736, УВК 1637, ЦО 1637)" },
                    { 408531, 1, "Учебно-воспитательный комплекс №1638" },
                    { 10044, 1, "Школа №1640" },
                    { 1677714, 1, "Центр образования №1641" },
                    { 1343824, 1, "Школа №1672" },
                    { 128695, 1, "Школа №1673" }
                });

            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 19913, 1, "Учебно-воспитательный комплекс №1674" },
                    { 412229, 1, "Детский сад №1677" },
                    { 25054, 1, "Школа №1678 «Восточное Дегунино» (бывш. ЦО 1678)" },
                    { 2520, 1, "Центр образования «Школа здоровья» №1679 (бывш. шк. 202, УВК 1679, ЦО 1679)" },
                    { 58920, 1, "Школа №1680" },
                    { 4032, 1, "Школа №1681" },
                    { 3805, 1, "Центр образования №1681" },
                    { 55604, 1, "Учебно-воспитательный комплекс №1681" },
                    { 12929, 1, "Центр образования №1682" },
                    { 22304, 1, "Школа №1683" },
                    { 22301, 1, "Школа №1684" },
                    { 19947, 1, "Центр образования №1685 (бывш. УВК 1685, шк. 413)" },
                    { 15692, 1, "Учебно-воспитательный комплекс №1687" },
                    { 3628, 1, "Школа №1688" },
                    { 40665, 1, "Школа №1689" },
                    { 58104, 1, "Учебно-воспитательный комплекс №1690" },
                    { 1399, 1, "Школа №1690" },
                    { 30747, 1, "Учебно-воспитательный комплекс №1691" },
                    { 2791, 1, "Школа №1693 (бывш. УВК 1693)" },
                    { 3234, 1, "Школа №1694 (ЦО 1694)" },
                    { 5094, 1, "Школа №1696" },
                    { 54562, 1, "Школа №1669" },
                    { 438257, 1, "Гимназия №1582" },
                    { 7574, 1, "Школа №1666" },
                    { 880181, 1, "Детский сад №1664" },
                    { 646130, 1, "Школа №1642" },
                    { 51948, 1, "Учебно-воспитательный комплекс №1643" },
                    { 19187, 1, "Школа №1644" },
                    { 626135, 1, "Учебно-воспитательный комплекс №1645" },
                    { 1659059, 1, "Детский сад №1646" },
                    { 14434, 1, "Учебно-воспитательный комплекс №1647" },
                    { 639686, 1, "Детский сад №1648" },
                    { 169, 1, "Школа №1650 (бывш. УВК 1650)" },
                    { 56127, 1, "Учебно-воспитательный комплекс №1651" },
                    { 16956, 1, "Школа №1652 (бывш. УВК 1652)" },
                    { 465528, 1, "Детский сад №1652" },
                    { 52146, 1, "Учебно-воспитательный комплекс №1653" },
                    { 900446, 1, "Учебно-воспитательный комплекс №1654" },
                    { 127340, 1, "Учебно-воспитательный комплекс №1655" },
                    { 132846, 1, "Школа №1655" },
                    { 53510, 1, "Учебно-воспитательный комплекс №1656" },
                    { 1724862, 1, "Школа №1657" },
                    { 50410, 1, "Школа №1658" },
                    { 15514, 1, "Учебно-воспитательный комплекс №1659" },
                    { 26237, 1, "Учебно-воспитательный комплекс №1661" },
                    { 27839, 1, "Школа №1661" },
                    { 746582, 1, "Детский сад №1662" },
                    { 465238, 1, "Учебно-воспитательный комплекс №1664" },
                    { 905518, 1, "Учебно-воспитательный комплекс №1665" },
                    { 1675474, 1, "Детский сад №1581" },
                    { 58807, 1, "Лицей №1581 (при МГТУ им. Баумана)" },
                    { 1422, 1, "Лицей №1580 (при МГТУ им. Баумана)" },
                    { 7416, 1, "Пушкинский лицей №1500" },
                    { 1937, 1, "Лицей №1501" },
                    { 2013, 1, "Лицей №1502 (при МЭИ)" },
                    { 1775950, 1, "Школа №1503" },
                    { 4044, 1, "Гимназия №1503" },
                    { 3817, 1, "Гимназия №1504" },
                    { 10189, 1, "Гимназия №1505" },
                    { 6171, 1, "Гимназия №1506" },
                    { 1397, 1, "Гимназия №1507" },
                    { 277, 1, "Гимназия №1508" },
                    { 45699, 1, "Гимназия №1509" },
                    { 57929, 1, "Лицей №1510" },
                    { 19543, 1, "Лицей №1511 (при МИФИ)" },
                    { 873, 1, "Гимназия №1512" },
                    { 3707, 1, "Гимназия №1513" },
                    { 802, 1, "Гимназия №1514" },
                    { 1098080, 1, "Детский сад №1514" },
                    { 5805, 1, "Гимназия №1515" },
                    { 3650, 1, "Гимназия №1516" },
                    { 1927, 1, "Гимназия №1517" },
                    { 3671, 1, "Гимназия №1518" },
                    { 4308, 1, "Гимназия №1519" },
                    { 1551, 1, "Гимназия №1520" },
                    { 480390, 1, "Школа №1499" },
                    { 824, 1, "Гимназия №1521" },
                    { 1608918, 1, "Школа №1498 «Московская Международная школа»  (бывш. ЦО 1498)" },
                    { 1668275, 1, "Центр образования №1496" },
                    { 1648, 1, "Центр образования №1472 (бывш. шк. 872)" },
                    { 1777166, 1, "Школа №1474" },
                    { 786198, 1, "Центр образования №1474" },
                    { 960798, 1, "Центр образования №1475" },
                    { 1048467, 1, "Центр образования №1476" },
                    { 1665448, 1, "Школа №1477" },
                    { 907527, 1, "Центр образования №1479" },
                    { 639687, 1, "Центр образования №1480" },
                    { 1519689, 1, "Центр образования №1481" },
                    { 801490, 1, "Детский сад №1481" },
                    { 2705, 1, "Центр образования №1482 (бывш. шк. 1732)" },
                    { 894651, 1, "Школа №1483" },
                    { 1596763, 1, "Центр образования №1484" },
                    { 15571, 1, "Центр образования №1485 (бывш. шк. 1255)" },
                    { 1075662, 1, "Центр образования №1486" },
                    { 532974, 1, "Центр образования №1487" },
                    { 28573, 1, "Школа №1488" },
                    { 1656355, 1, "Школа №1489" },
                    { 5840, 1, "Центр образования №1490 (бывш. шк. 206)" },
                    { 1486437, 1, "Центр образования №1491" },
                    { 22152, 1, "Центр образования №1492" },
                    { 1675416, 1, "Центр образования №1494" },
                    { 187165, 1, "Центр образования №1495 (бывш. шк. 2015)" },
                    { 853110, 1, "Школа №1497" },
                    { 12122, 1, "Гимназия №1699" },
                    { 744311, 1, "Детский сад №1521" },
                    { 50595, 1, "Лицей №1523 (при МИФИ)" },
                    { 2700, 1, "Лицей №1553" },
                    { 10398, 1, "Гимназия №1554 (бывш. шк. 746, УВК 1628)" },
                    { 49293, 1, "Лицей №1555" },
                    { 864, 1, "Гимназия №1558 им. Росалии де Кастро (шк. 1410)" },
                    { 31202, 1, "Школа №1560 «Лидер» (бывш. лицей)" },
                    { 5249, 1, "Школа № 1561 (бывш. лицей)" },
                    { 16019, 1, "Школа им. Артема Боровика (бывш. Гимназия №1562 им. Артёма Боровика)" },
                    { 14072, 1, "Гимназия №1563" },
                    { 16493, 1, "Лицей №1564" },
                    { 27386, 1, "Гимназия №1565" },
                    { 24639, 1, "Школа №1566 «Марьинская гимназия с кадетскими классами памяти Героев Сталинградской битвы»" },
                    { 1228, 1, "Гимназия №1567" },
                    { 127339, 1, "Лицей №1568" },
                    { 565443, 1, "Гимназия №1569 «Созвездие»" },
                    { 13932, 1, "Гимназия №1570" },
                    { 58288, 1, "Лицей №1571" },
                    { 378088, 1, "Школа №1572" },
                    { 254931, 1, "Гимназия №1573" },
                    { 1513890, 1, "Лицей №1574" },
                    { 465183, 1, "Лицей №1575" },
                    { 4087, 1, "Гимназия №1576" },
                    { 2034, 1, "Гимназия №1577" },
                    { 4914, 1, "Гимназия №1579" },
                    { 29120, 1, "Гимназия №1552" },
                    { 14172, 1, "Гимназия №1522" },
                    { 2550, 1, "Гимназия №1551" },
                    { 20802, 1, "Гимназия №1549" },
                    { 2115, 1, "Лицей №1524" },
                    { 191, 1, "Лицей №1525 «Воробьёвы горы»" },
                    { 3875, 1, "Гимназия №1526" },
                    { 1118, 1, "Гимназия №1527" },
                    { 55505, 1, "Гимназия №1529" },
                    { 43831, 1, "Гимназия №1530 «Школа Ломоносова»" },
                    { 3672, 1, "Гимназия №1531 (бывш. шк. 21 специальная, 1217)" },
                    { 14335, 1, "Гимназия №1532" },
                    { 84, 1, "Лицей №1533" },
                    { 1590, 1, "Школа №1534 (бывш. Гимназия №1534)" },
                    { 4474, 1, "Лицей №1535" },
                    { 59650, 1, "Лицей №1536" },
                    { 3137, 1, "Лицей №1537" },
                    { 9420, 1, "Гимназия №1538 (бывш. шк. 1185, 1339, 1743)" },
                    { 901152, 1, "Гимназия №1539 (бывш. шк. 303)" },
                    { 1423172, 1, "Гимназия №1540" },
                    { 243, 1, "Школа № 1541 (Гимназия № 1541)" },
                    { 1316, 1, "Гимназия №1542" },
                    { 946, 1, "Гимназия №1543" },
                    { 13838, 1, "Гимназия №1544" },
                    { 3663, 1, "Лицей №1546 (бывш. МЦФЭО при РЭА им. Г. В. Плеханова)" },
                    { 9295, 1, "Лицей №1547" },
                    { 2804, 1, "Лицей №1548" },
                    { 5083, 1, "Лицей №1550" },
                    { 44999, 1, "Школа №1235" },
                    { 8227, 1, "Детско-юношеский центр «Пречистенские ворота»" },
                    { 1046248, 1, "Джазовая музыкальная школа «C-Jam Club»" },
                    { 48125, 1, "Частная школа «Приоритет»" },
                    { 16491, 1, "Частная школа «Ретро»" },
                    { 57888, 1, "Частная школа «Школьная академия»" },
                    { 1852, 1, "Частная школа-детский сад «Линия плюс»" },
                    { 5860, 1, "Школа «BNA»" },
                    { 57098, 1, "Школа «Oxford International School»" },
                    { 32313, 1, "Школа «XXI век»" },
                    { 15268, 1, "Школа «Академия языка»" },
                    { 1581, 1, "Школа «Алеф»" },
                    { 41956, 1, "Школа «Альтернатива»" },
                    { 54337, 1, "Частная школа «Наследник»" },
                    { 57193, 1, "Школа «Альфа»" },
                    { 32980, 1, "Школа «Афина»" },
                    { 6284, 1, "Школа «Бакалавр»" },
                    { 49700, 1, "Школа «Бет-Егудит»" },
                    { 45804, 1, "Школа «Бриз»" },
                    { 16976, 1, "Школа «Будущее»" },
                    { 22050, 1, "Школа «Вдохновение»" },
                    { 53091, 1, "Школа «Вектор»" },
                    { 45265, 1, "Школа «Виктория»" },
                    { 1688011, 1, "Школа «Возможность»" },
                    { 49714, 1, "Школа «Выбор»" },
                    { 8435, 1, "Школа «Апогей»" },
                    { 1769930, 1, "Частная школа «Классическое образование»" },
                    { 40551, 1, "Частная школа «Классика»" },
                    { 2404, 1, "Частная школа «Кладезь»" },
                    { 5125, 1, "Центр образования «Дельта»" },
                    { 18804, 1, "Центр образования «Класс-Центр»" },
                    { 5309, 1, "Центр образования «Лицей Столичный»" },
                    { 50626, 1, "Центр образования «Олимп»" },
                    { 49742, 1, "Центр образования «Спарта»" },
                    { 1507019, 1, "Центр образования «Технологии обучения»" },
                    { 1660743, 1, "Центр образования «Центральная школа обучения»" },
                    { 135000, 1, "Центр образования «Юниор»" },
                    { 1772884, 1, "Центр онлайн-обучения «Нетология-групп»" },
                    { 1774567, 1, "Центр педагогического мастерства" },
                    { 1709804, 1, "Центр профессионального изучения танцевальной культуры Востока «АидА»" },
                    { 1712741, 1, "Центр профессионального макияжа и грима «Make-up Atelier»" },
                    { 1749056, 1, "Центр профессионального обучения «Карьера»" },
                    { 58136, 1, "Центр развития «Розовый слон»" },
                    { 1771704, 1, "Центр реабилитации инвалидов детства «Наш солнечный мир»" },
                    { 1772067, 1, "Центр спорта и образования «Локомотив»" },
                    { 56961, 1, "Центр среднего профессионального образования (ЦСПО)" },
                    { 58464, 1, "Центр творчества детей и подростков «Останкино»" },
                    { 1752859, 1, "Центр эстетического воспитания детей «Иверия»" },
                    { 1860, 1, "Центральная средняя специальная музыкальная школа при МГК им. Чайковского" },
                    { 47410, 1, "Центральная школа высшего спортивного мастерства (ЦШВСМ)" },
                    { 26343, 1, "Церковно-приходская школа «Косинская»" },
                    { 27604, 1, "Частная школа «Венда»" },
                    { 489413, 1, "Школа «Генезис» (Росток +)" },
                    { 1773750, 1, "Школа «Глория»" },
                    { 24484, 1, "Школа «Город солнца»" },
                    { 29979, 1, "Школа «Данко»" },
                    { 39509, 1, "Школа «Максима»" },
                    { 10633, 1, "Школа «Малая школа»" },
                    { 49182, 1, "Школа «Маленький принц»" },
                    { 50637, 1, "Школа «Мини-школа»" },
                    { 40517, 1, "Школа «Московиты»" },
                    { 20107, 1, "Школа «Муми Тролль»" },
                    { 18018, 1, "Школа «Мыслитель»" },
                    { 16194, 1, "Школа «Надежда»" },
                    { 1663042, 1, "Школа «Наследие»" },
                    { 25831, 1, "Школа «Наука-сервис»" },
                    { 51592, 1, "Школа «Наши пенаты»" },
                    { 49394, 1, "Школа «Ника»" },
                    { 8142, 1, "Школа «Новое образование»" },
                    { 50546, 1, "Школа «Образ»" },
                    { 43049, 1, "Школа «Олимп-плюс»" },
                    { 1721836, 1, "Школа «Остеопрактика»" },
                    { 47385, 1, "Школа «Откровение»" },
                    { 27605, 1, "Школа «Первая школа»" },
                    { 21707, 1, "Школа «Перспектива»" },
                    { 9308, 1, "Школа «Петровская школа»" },
                    { 26727, 1, "Школа «Пионер»" },
                    { 1703849, 1, "Школа «Позиция»" },
                    { 42752, 1, "Школа «Познание»" },
                    { 3399, 1, "Школа «Лучик» (Луч и Ко)" },
                    { 187186, 1, "Центр образования «Вступление»" },
                    { 5511, 1, "Школа «Лотос»" },
                    { 28673, 1, "Школа «Логос»" },
                    { 43999, 1, "Школа «Дельта-Прометей»" },
                    { 59002, 1, "Школа «Ералаш»" },
                    { 1680604, 1, "Школа «Живоносный источник»" },
                    { 35076, 1, "Школа «Знак»" },
                    { 59618, 1, "Школа «Знание»" },
                    { 5190, 1, "Школа «Золотое сечение»" },
                    { 13459, 1, "Школа «Импульс»" },
                    { 38334, 1, "Школа «Имя»" },
                    { 1681120, 1, "Школа «Интеграл»" },
                    { 8612, 1, "Школа «Интеграция XXI век»" },
                    { 29868, 1, "Школа «Интеграция»" },
                    { 15898, 1, "Школа «Интеллект-XXI»" },
                    { 36033, 1, "Школа «Интеллект»" },
                    { 29414, 1, "Школа «Интенсив»" },
                    { 44562, 1, "Школа «Ирида»" },
                    { 51577, 1, "Школа «Ирмос»" },
                    { 59260, 1, "Школа «Исток»" },
                    { 52097, 1, "Школа «Карьера»" },
                    { 40415, 1, "Школа «Киприда»" },
                    { 44003, 1, "Школа «Континент»" },
                    { 51081, 1, "Школа «Кредо»" },
                    { 1777703, 1, "Школа «Летово»" },
                    { 44724, 1, "Школа «Личность»" },
                    { 30908, 1, "Школа «Ломоносовская школа»" },
                    { 54961, 1, "Школа «Поиск»" },
                    { 1763296, 1, "Центр НС «Кадры»" },
                    { 136684, 1, "Центр интенсивных технологий образования (ЦИТО)" },
                    { 56943, 1, "Торгово-экономический колледж (МТЭК)" },
                    { 49381, 1, "Торгово-экономический техникум (МТЭТ) РГТЭУ" },
                    { 31774, 1, "Универсальный центр образования (УЦО)" },
                    { 1781306, 1, "Университет Практической Психологии" },
                    { 1764276, 1, "Университетская гимназия (школа-интернат) МГУ имени М. В. Ломоносова" },
                    { 40758, 1, "Университетский гуманитарный лицей при МГУ" },
                    { 32477, 1, "Учебно-воспитательный комплекс «Интерколледж»" },
                    { 1775127, 1, "Учебно-консультационный центр «Кадровый Резерв»" },
                    { 1768198, 1, "Учебно-методический центр Российского Союза аудиторов «Интеркон-Интеллект»" },
                    { 805202, 1, "Учебно-производственный центр «Время»" },
                    { 25711, 1, "Технологический колледж питания (МТКП) РЭУ им. Г. В. Плеханова" },
                    { 157128, 1, "Учебный центр «Language Link» (Раменки)" },
                    { 1762243, 1, "Учебный центр «А. Ф. Конто»" },
                    { 1782126, 1, "Учебный центр «Академия рынка труда»" },
                    { 1761679, 1, "Учебный центр «АртСтилист»" },
                    { 1770742, 1, "Учебный центр «Бриз»" },
                    { 1318976, 1, "Учебный центр «Европа»" },
                    { 1742192, 1, "Учебный центр «Информзащита»" },
                    { 1318980, 1, "Учебный центр «Косметологический российский центр»" },
                    { 40403, 1, "Учебный центр «Лингварекс»" },
                    { 1759443, 1, "Учебный центр «Образование и карьера»" },
                    { 1746864, 1, "Учебный центр «Профессионал»" },
                    { 938646, 1, "Учебный центр «Language Link» (Центральная)" },
                    { 1653450, 1, "Технологический колледж (МТК)" },
                    { 37105, 1, "Технический колледж (МТК) Мосэнерго" },
                    { 48823, 1, "Технический колледж (МТК)" },
                    { 1741913, 1, "Театральная студия «Я — Актер»" },
                    { 1657440, 1, "Театральная школа «Бенефис»" },
                    { 48088, 1, "Театральная школа «Образ»" },
                    { 369770, 1, "Театральное училище «Монотон»" },
                    { 1670560, 1, "Театральный колледж им. Леонида Филатова" },
                    { 1624263, 1, "Театральный колледж при Московском театре под руководством О. Табакова" },
                    { 31795, 1, "Театральный центр на Дубровке" },
                    { 1652671, 1, "Театроведческая секция РАМТ" },
                    { 29528, 1, "Теннисный центр «Спартак – Ширяево поле»" },
                    { 967317, 1, "Теплоэнергетический колледж (ТЭК)" },
                    { 317926, 1, "Технико-экономический колледж (МТЭК)" },
                    { 369806, 1, "Техникум инновационных технологий «Стеллариум»" },
                    { 2751, 1, "Техникум информатики и вычислительной техники (МТИВТ)" },
                    { 100980, 1, "Техникум космического машиностроения (МТКМ, бывш. МАСТ)" },
                    { 44448, 1, "Техникум космического приборостроения (МТКП, бывш. МРПТ)" },
                    { 102162, 1, "Техникум легкой промышленности (ТЛП)" },
                    { 465207, 1, "Техникум при МОСА" },
                    { 294174, 1, "Техникум профессионального обучения незанятого населения (ТПОНН)" },
                    { 507164, 1, "Техникум реабилитационного центра для инвалидов" },
                    { 454401, 1, "Техникум социально-информационных технологий (ТСИТ)" },
                    { 63451, 1, "Техникум технологии, экономики и права им. Л. Б. Красина (МГТТЭП)" },
                    { 102097, 1, "Техникум технологий и права (МГТТиП)" },
                    { 244363, 1, "Техникум транспортного строительства (МТТС)" },
                    { 960846, 1, "Учебный центр «Рубикон»" },
                    { 1720078, 1, "Учебный центр «Специалист» при МГТУ им. Н.Э.Баумана" },
                    { 1781727, 1, "Учебный центр «ЦИБИТ»" },
                    { 1776488, 1, "Учебный центр «ЭкоСфера»" },
                    { 1627973, 1, "Хореографическое училище им. Л. М. Лавровского" },
                    { 48579, 1, "Хоровая студия «Веснянка»" },
                    { 55879, 1, "Хоровое училище им. А. В. Свешникова (МГХУ)" },
                    { 1564528, 1, "Хоровое училище при ПСТГУ" },
                    { 1775834, 1, "Хорошевская школа (Хорошкола)" },
                    { 46948, 1, "Христианско-гуманитарный лицей" },
                    { 42730, 1, "Художественная школа «Геликон»" },
                    { 35189, 1, "Художественная школа «Надежда»" },
                    { 1672315, 1, "Художественная школа «Покров»" },
                    { 35316, 1, "Художественная школа «Ракурс»" },
                    { 1779372, 1, "Художественная школа «Солнцево»" },
                    { 47513, 1, "Художественная школа «Старт»" },
                    { 1721409, 1, "Художественная школа МГЦДТ «Культура и образование»" },
                    { 148844, 1, "Художественная школа при МХПИ" },
                    { 1772156, 1, "Художественная школа рисования «Вдохновение»" },
                    { 909764, 1, "Художественная школа САО" },
                    { 1759994, 1, "Художественная школа-студия «Арт-курс»" },
                    { 27181, 1, "Художественно-педагогический колледж технологии и дизайна (МХПКТиД)" },
                    { 53867, 1, "Художественный гуманитарный колледж (ХГК)" },
                    { 36836, 1, "Центр детского творчества «Подснежник»" },
                    { 53804, 1, "Центр детского творчества «Солнцево»" },
                    { 786743, 1, "Центр довузовского образования «Уникум» РУДН" },
                    { 1779457, 1, "Центр изучения иностранных языков МГИМО" },
                    { 45714, 1, "Хореографический ансамбль «Надежда»" },
                    { 1761543, 1, "Центр научных работников и преподавателей иудаики в вузах «Сэфер»" },
                    { 48958, 1, "Хореографическая школа при ГААНТ Игоря Моисеева" },
                    { 1722479, 1, "Футбольная академия «Динамо» им. Л. И. Яшина" },
                    { 3541, 1, "Учебный центр Британского совета" },
                    { 1771921, 1, "Учебный центр кино и телевидения UHD" },
                    { 1774672, 1, "Учебный центр профессиональной переподготовки и повышения квалификации «ПРОФАКАДЕМИЯ»" },
                    { 45771, 1, "Учебный центр Федерации горнолыжного спорта и сноуборда (ФГСС)" },
                    { 39244, 1, "Училище (колледж) духового искусства" },
                    { 53672, 1, "Училище циркового и эстрадного искусства (ГУЦЭИ)" },
                    { 48573, 1, "Факультет среднего профессионального образования МГУПИ (МРМТ)" },
                    { 1733600, 1, "Фармацевтический колледж «Новые знания»" },
                    { 57048, 1, "Федерация традиционного карате (РФТК)" },
                    { 1773858, 1, "Физкультурно-оздоровительный комплекс «Братеево»" },
                    { 1682126, 1, "Филиал Нью-Йоркской академии киноискусства (New York Film Academy)" },
                    { 1674574, 1, "Финансово-промышленный колледж (МФПК)" },
                    { 27718, 1, "Финансово-экономическая школа (ФЭШ)" },
                    { 69889, 1, "Финансовый колледж (МФК)" },
                    { 11676, 1, "Финансовый колледж при АБиК Министерства финансов РФ" },
                    { 1771870, 1, "Фоксфорд" },
                    { 489324, 1, "Фотошкола «Fotoart-School»" },
                    { 1773845, 1, "Фотошкола «Фото-Класс»" },
                    { 1711439, 1, "Фотошкола «Фотостарт»" },
                    { 1780442, 1, "Фотошкола Глянец" },
                    { 98046, 1, "Французский культурный центр при пос. Франции в РФ" },
                    { 13121, 1, "Французский лицей им. А. Дюма (LFM Alexandre Dumas)" },
                    { 791970, 1, "Французский университетский колледж МГУ" },
                    { 1757104, 1, "Футбольный лагерь FCBEscola Camp Russia" },
                    { 1740902, 1, "Школа «Покровский квартал»" },
                    { 48717, 1, "Школа «Полярная звезда»" },
                    { 48920, 1, "Школа «Правда»" },
                    { 56495, 1, "Школа при посольстве Югославии" },
                    { 55838, 1, "Школа при РАТИ-ГИТИС" },
                    { 1729551, 1, "Школа программирования" },
                    { 1768320, 1, "Школа Радио" },
                    { 1652672, 1, "Школа рисования для детей и взрослых «Дом Изо»" },
                    { 41866, 1, "Школа рок-музыки «Красный Химик»" },
                    { 39881, 1, "Школа РЭА им. Г. В. Плеханова" },
                    { 1722872, 1, "Школа современного искусства «Свободные мастерские» ММОМА" },
                    { 1412228, 1, "Школа современной фотографии «Photoplay»" },
                    { 54122, 1, "Школа Сотрудничества" },
                    { 51365, 1, "Школа при посольстве Чехии" },
                    { 1763782, 1, "Школа социального волонтёрства" },
                    { 1701204, 1, "Школа стилистов «Персона»" },
                    { 973241, 1, "Школа сценического искусства при Музыкально-драматическом театре  «Лица»" },
                    { 185810, 1, "Школа танца «Танцкласс»" },
                    { 1491338, 1, "Школа танцев «Dance Paradise»" },
                    { 53719, 1, "Школа танцев «Dream House»" },
                    { 1734512, 1, "Школа телевидения и дизайна МГУДТ" },
                    { 1660820, 1, "Школа успеха «Победитель»" },
                    { 34266, 1, "Школа финансов МГУ" },
                    { 1766985, 1, "Школа флористов-дизайнеров «Николь»" },
                    { 1775580, 1, "Школа фотографии «Fine Art»" },
                    { 1480713, 1, "Школа спортивного бального танца «Топ-Данс»" },
                    { 1762822, 1, "Школа при посольстве Хорватии" },
                    { 1405961, 1, "Школа при посольстве Польши" },
                    { 48190, 1, "Школа при посольстве Германии" },
                    { 130628, 1, "Школа молодого экономиста-международника при ЭФ МГУ" },
                    { 45508, 1, "Школа Московской государственной академии хореографии (МГАХ)" },
                    { 1677634, 1, "Школа музмейкеров" },
                    { 1772921, 1, "Школа музыки Mezzo" },
                    { 1772922, 1, "Школа музыки Форте" },
                    { 1775106, 1, "Школа на Юго-Востоке им. Маршала В. И. Чуйкова" },
                    { 59011, 1, "Школа наездников" },
                    { 36156, 1, "Школа Натальи Нестеровой" },
                    { 1742658, 1, "Школа образных решений «Idea Class»" },
                    { 1271037, 1, "Школа Олега Андреева" },
                    { 884799, 1, "Школа организации и безопасности дорожного движения" },
                    { 454548, 1, "Школа организации и технологии защиты информации" },
                    { 1722112, 1, "Школа охраны и сыска «Кодексъ»" },
                    { 316605, 1, "Школа парикмахерского искусства Павла Баженова" },
                    { 360885, 1, "Школа политики и бизнеса" },
                    { 14798, 1, "Школа полного дня «Радуга+»" },
                    { 1780685, 1, "Школа права и экономики" },
                    { 1781049, 1, "Школа права при юридическом факультете МГУ" },
                    { 50913, 1, "Школа при агентстве «Modus Vivendis»" },
                    { 50685, 1, "Школа при Андреевском монастыре" },
                    { 1544649, 1, "Школа при ГУ-ВШЭ" },
                    { 763194, 1, "Школа при посольстве Армении" },
                    { 47540, 1, "Школа при посольстве Венгрии" },
                    { 1671489, 1, "Школа фотографии и мультимедиа им. А. Родченко" },
                    { 37867, 1, "Школа экономики (МШЭ)" },
                    { 32434, 1, "Школа этикета и всестороннего развития (ШЭВР)" },
                    { 988228, 1, "Школа юного географа при МГУ" },
                    { 36841, 1, "Экономико-математическая школа при ЭФ МГУ" },
                    { 44451, 1, "Экономико-правовая школа «Потенциал»" },
                    { 895753, 1, "Экономико-технический колледж железнодорожного транспорта (МЭТКЖТ)" },
                    { 29424, 1, "Экономико-технологический колледж (МЭТК)" },
                    { 34597, 1, "Экономико-энергетический колледж (МЭЭК, бывш. МЭТ)" },
                    { 42947, 1, "Экономико-юридический колледж (ЭЮК)" },
                    { 50700, 1, "Экономико-юридический колледж при МАЭП (МЭЮК)" },
                    { 7386, 1, "Экономическая школа (МЭШ)" },
                    { 46667, 1, "Экономическая школа-лицей (ЭШЛ)" },
                    { 48693, 1, "Экономический бизнес-колледж (ЭБК)" },
                    { 1764650, 1, "Экономический лицей РЭУ им. Г. В. Плеханова" },
                    { 24814, 1, "Экспериментальная подростковая школа адаптивного обучения (ЭПШАО)" },
                    { 1706864, 1, "Экспериментальный комплекс социальной помощи детям и подросткам «Лосиный остров» (ЭКСПДиП)" },
                    { 28919, 1, "Электронно-технологический техникум (МЭТТ при ГАИ)" },
                    { 1284817, 1, "Эрикссон Трейнинг Центр (Ericsson Training Center)" },
                    { 59088, 1, "Эстрадно-хореографический ансамбль «Гном»" },
                    { 49359, 1, "Юридический колледж (МЮК)" },
                    { 146489, 1, "Юридический колледж «Лекс»" },
                    { 35641, 1, "Юридический колледж «Третье тысячелетие»" },
                    { 45788, 1, "Юридический колледж МГУ" },
                    { 1771560, 1, "Юридический колледж МИИТ (Правовой колледж)" },
                    { 455021, 1, "Юридический колледж МНЮИ" },
                    { 48945, 1, "Юридический колледж РАП" },
                    { 59046, 1, "Школьный факультет МГРИ-РГГРУ" },
                    { 57405, 1, "Школа молодого предпринимателя (ШМП)" },
                    { 1772154, 1, "Школа-экстернат при МАИ" },
                    { 30004, 1, "Школа-студия МХАТ" },
                    { 1756649, 1, "Школа юного германиста МГУ" },
                    { 26816, 1, "Школа юного журналиста при МГУ" },
                    { 1671484, 1, "Школа юного испаниста при МГУ" },
                    { 1046249, 1, "Школа юного историка при МГУ" },
                    { 1691918, 1, "Школа юного политолога при МГУ" },
                    { 26356, 1, "Школа юного психолога при МГУ" },
                    { 49857, 1, "Школа юного филолога при филфаке МГУ" },
                    { 9157, 1, "Школа ЮССТ" },
                    { 1778743, 1, "Школа японского языка «Оока – Цветы сакуры»" },
                    { 887715, 1, "Школа-детский сад «Солнечный ветер»" },
                    { 1781696, 1, "Школа-ИКС" },
                    { 26682, 1, "Школа-интернат «Интеллектуал»" },
                    { 1767296, 1, "Школа-интернат «Уэйверли Хаус»" },
                    { 6884, 1, "Школа-интернат МИД РФ" },
                    { 56157, 1, "Школа-колледж «Ромашка»" },
                    { 627204, 1, "Школа-колледж «Экономика и экология» при МГУП" },
                    { 50910, 1, "Школа-лаборатория В. А. Гольдберга" },
                    { 48934, 1, "Школа-лицей «Запад-восток»" },
                    { 1719006, 1, "Школа-студия «Остров»" },
                    { 35609, 1, "Школа-студия «Тодес»" },
                    { 1628435, 1, "Школа-студия Александра Митты" },
                    { 2729, 1, "Школа-студия архитектурного дизайна" },
                    { 1284240, 1, "Школа-студия им. Т. А. Устиновой при Государственном академическом русском народном хоре РФ им. М. Е. Пятницкого" },
                    { 1665140, 1, "Школа-студия ЭКТВ" },
                    { 1269413, 1, "Школа молодого востоковеда (ШМВ)" },
                    { 54624, 1, "Школа моделей Славы Зайцева" },
                    { 1716702, 1, "Школа менеджеров «Арсенал»" },
                    { 7113, 1, "Школа «Эдельвейс»" },
                    { 58341, 1, "Школа «Эйдос» (экстернат)" },
                    { 9404, 1, "Школа «Экстерн»" },
                    { 43921, 1, "Школа «Эпос»" },
                    { 59274, 1, "Школа «Эрудит»" },
                    { 101632, 1, "Школа «Этернус»" },
                    { 56243, 1, "Школа «Ювенес»" },
                    { 43139, 1, "Школа «Юджин-центр»" },
                    { 256660, 1, "Школа «Ясенево»" },
                    { 1781317, 1, "Школа актерского мастерства «АктэМ»" },
                    { 960804, 1, "Школа актерского мастерства при к/к «Мосфильм»" },
                    { 1733747, 1, "Школа анализа данных (Яндекс)" },
                    { 1756923, 1, "Школа английского языка «EF English First» (Багратионовская)" },
                    { 160309, 1, "Школа английского языка «EF English First» (ВДНХ)" },
                    { 1058258, 1, "Школа английского языка «EF English First» (Дегунино)" },
                    { 528540, 1, "Школа английского языка «EF English First» (Жулебино)" },
                    { 97625, 1, "Школа английского языка «EF English First» (Маяковская)" },
                    { 49156, 1, "Школа английского языка «EF English First» (Митино)" },
                    { 41483, 1, "Школа английского языка «EF English First» (Никулино)" },
                    { 157120, 1, "Школа английского языка «EF English First» (Ново-Переделкино)" },
                    { 144554, 1, "Школа английского языка «EF English First» (Новые Черемушки)" },
                    { 1737992, 1, "Школа английского языка «EF English First» (Севастопольская)" },
                    { 1773313, 1, "Школа английского языка «EF English First» (Тверская)" },
                    { 44750, 1, "Школа «Эврика»" },
                    { 1036075, 1, "Школа английского языка «EF English First» (Университет)" },
                    { 49027, 1, "Школа «Фристайл»" },
                    { 35968, 1, "Школа «Филипп Хауз»" },
                    { 56779, 1, "Школа «Президент» (President School)" },
                    { 2759, 1, "Школа «Премьер»" },
                    { 44601, 1, "Школа «Престиж»" },
                    { 31771, 1, "Школа «Промо-М»" },
                    { 33265, 1, "Школа «Просвещение»" },
                    { 805904, 1, "Школа «Путь зерна»" },
                    { 1684837, 1, "Школа «Развитие»" },
                    { 30591, 1, "Школа «Риск»" },
                    { 18177, 1, "Школа «Рольф»" },
                    { 50105, 1, "Школа «Росинка»" },
                    { 57056, 1, "Школа «РОШ-Образование»" },
                    { 40936, 1, "Школа «Самсон»" },
                    { 1773262, 1, "Школа «Свиблово»" },
                    { 55411, 1, "Школа «Семейный Лад»" },
                    { 1853, 1, "Школа «Современное образование»" },
                    { 29869, 1, "Школа «Сосны»" },
                    { 54126, 1, "Школа «Союз»" },
                    { 518962, 1, "Школа «Сподвижник»" },
                    { 16349, 1, "Школа «Студиум»" },
                    { 1765903, 1, "Школа «Ступени»" },
                    { 1740790, 1, "Школа «Татьянинская школа»" },
                    { 23290, 1, "Школа «Уна»" },
                    { 10667, 1, "Школа «Феникс»" },
                    { 285934, 1, "Школа «Филипповская школа»" },
                    { 51379, 1, "Театр-школа «Арт-стиль»" },
                    { 1759081, 1, "Школа английского языка «Wall Street English»" },
                    { 1723945, 1, "Школа африканских барабанов «Sun Drums»" },
                    { 1769445, 1, "Школа иностранных языков «Alibra School»" },
                    { 50098, 1, "Школа иностранных языков «BKC»" },
                    { 56351, 1, "Школа иностранных языков «Лингвист»" },
                    { 133558, 1, "Школа Института им. Гёте при консульстве ФРГ в России" },
                    { 18496, 1, "Школа Института международной торговли и права (ИМТП)" },
                    { 1767940, 1, "Школа интенсивного обучения «Первый экстернат»" },
                    { 59423, 1, "Школа искусств «Аккорд»" },
                    { 43426, 1, "Школа искусств «Родник»" },
                    { 44442, 1, "Школа искусств «Юность»" },
                    { 29106, 1, "Школа искусств им. И. С. Козловского (бывш. Музыкальная школа им. И. С. Козловского)" },
                    { 1761615, 1, "Школа искусств МакSим" },
                    { 1769106, 1, "Школа испанского языка «Espalabra»" },
                    { 1780869, 1, "Школа карьерного менеджмента" },
                    { 1773826, 1, "Школа кино и телевидения «Индустрия»" },
                    { 43433, 1, "Школа классического образования «Луч» при МАИ" },
                    { 67175, 1, "Школа классического танца им. Г. В. Ледяха" },
                    { 39890, 1, "Школа компьютерной графики RealTime School" },
                    { 1670735, 1, "Школа компьютерной графики Scream School" },
                    { 1632259, 1, "Школа кукольного дизайна С. Воскресенской" },
                    { 1772393, 1, "Школа лезгинки и других кавказских танцев Аскера Энеева «AssaParty»" },
                    { 1712740, 1, "Школа макияжа «Icon Face»" },
                    { 1762428, 1, "Школа маникюра и педикюра «Золотая Ника»" },
                    { 506075, 1, "Школа МГУП" },
                    { 1769947, 1, "Школа им. Н. М. Карамзина" },
                    { 57771, 1, "Школа архитектуры и дизайна (ШАД)" },
                    { 58330, 1, "Школа им. Инессы Светловой" },
                    { 58578, 1, "Школа им. А. С. Попова" },
                    { 1733748, 1, "Школа биоинформатики" },
                    { 1563321, 1, "Школа битбокса Вахтанга" },
                    { 1772904, 1, "Школа боевых искусств Дмитрия Носова" },
                    { 1741785, 1, "Школа бортпроводников" },
                    { 44409, 1, "Школа будущего «Радуга»" },
                    { 1762095, 1, "Школа визажа Nikk Mole" },
                    { 1710208, 1, "Школа визажа «SolingStudio»" },
                    { 1764827, 1, "Школа вина «Энотрия»" },
                    { 48316, 1, "Школа во имя Евангелиста Иоанна Богослова" },
                    { 29523, 1, "Школа во имя Святого благоверного князя Александра Невского" },
                    { 1662131, 1, "Школа водолазов ФГУ Подводречстрой" },
                    { 1556464, 1, "Школа вокала «MusicWay»" },
                    { 1743525, 1, "Школа высшего водительского мастерства «ASport»" },
                    { 59372, 1, "Школа высшего спортивного мастерства «Москвич»" },
                    { 1742191, 1, "Школа диджеев «Make DJ»" },
                    { 1738414, 1, "Школа дизайна и компьютерной графики МГУДТ" },
                    { 1632260, 1, "Школа драмы Г. Сидакова" },
                    { 1739404, 1, "Школа духовного пения (ШДП)" },
                    { 1698816, 1, "Школа живописи Михаила Сатарова" },
                    { 4384, 1, "Школа журналистики «Известия»" },
                    { 15126, 1, "Школа журналистики «Интерньюс»" },
                    { 53017, 1, "Школа журналистики им. В. Мезенцева (Школа тележурналистики, рекламы и PR при ЦДЖ)" },
                    { 1765783, 1, "Школа звукорежиссуры Musicheads" },
                    { 36401, 1, "Школа им. В. М. Комарова" },
                    { 1715788, 1, "Детско-юношеский центр «Россия молодая»" },
                    { 40921, 1, "Суворовское военное училище (МсСВУ)" },
                    { 1779017, 1, "Студия Иваны Чаббак (Ivana Chubbuck Studio Moscow)" },
                    { 1096282, 1, "Колледж МНЭПУ" },
                    { 189136, 1, "Колледж моделирования обуви и маркетинга (МГТМОМ - МТТЛП)" },
                    { 47633, 1, "Колледж МосГУ" },
                    { 1742227, 1, "Колледж МТИ «ВТУ»" },
                    { 1670559, 1, "Колледж МУ им. С. Ю. Витте (МИЭМП)" },
                    { 19848, 1, "Колледж музыкального исполнительства им. Ф. Шопена (МГКМИ)" },
                    { 1772014, 1, "Колледж МФПУ «Синергия»" },
                    { 146852, 1, "Колледж МФЮА" },
                    { 1698564, 1, "Колледж при Институте русского театра (ИРТ)" },
                    { 1763263, 1, "Колледж при Институте управления и информатики" },
                    { 904800, 1, "Колледж многоуровневого профессионального образования АНХ" },
                    { 1669885, 1, "Колледж при МИПП" },
                    { 1752418, 1, "Колледж приборостроения и информационных технологий" },
                    { 1698814, 1, "Колледж профессиональных технологий (МКПТ)" },
                    { 1771989, 1, "Колледж РГУ им. А. Н. Косыгина (МГУДТ)" },
                    { 112684, 1, "Колледж РосНОУ" },
                    { 146850, 1, "Колледж Российского университета инноваций (РУИ, УГМУ)" },
                    { 52001, 1, "Колледж сервиса, туризма и менеджмента МГУС" },
                    { 35858, 1, "Колледж современного управления (КСУ)" },
                    { 1747268, 1, "Колледж современных технологий им. Героя Советского Союза М. Ф. Панова" },
                    { 743595, 1, "Колледж станкостроения, экономики и управления (МГКСЭУ)" },
                    { 19422, 1, "Колледж телекоммуникаций МТУСИ" },
                    { 102501, 1, "Колледж при МИР" },
                    { 40633, 1, "Колледж МИД России" },
                    { 21716, 1, "Колледж Международного юридического института (МЮИ при МЮ РФ)" },
                    { 59706, 1, "Колледж мебельной промышленности (МКМП)" },
                    { 49041, 1, "Колледж государственного администрирования (КГА)" },
                    { 56795, 1, "Колледж дизайна и декоративного искусства МГХПА им С. Г. Строганова (бывш. КПИ МГХПА им. Строганова, МХУПИ им. Калинина)" },
                    { 380369, 1, "Колледж дизайна и новых технологий" },
                    { 1507020, 1, "Колледж дизайна при ИДНТ" },
                    { 1656923, 1, "Колледж дизайна при НИМ" },
                    { 1746004, 1, "Колледж Евразийского открытого института" },
                    { 57004, 1, "Колледж железнодорожного транспорта (МКЖТ, бывш. МТКЖДТ, МТЖДТ)" },
                    { 35976, 1, "Колледж ИГУМО" },
                    { 97700, 1, "Колледж импровизационной музыки (МКИМ)" },
                    { 1756590, 1, "Колледж инновационных технологий и сервиса «Галактика»" },
                    { 36501, 1, "Колледж иностранных языков при РГГУ" },
                    { 17737, 1, "Колледж информатики и программирования (КИП Финуниверситета, бывш. Колледж информатики и электронной техники, МГКИЭТ, МГКИП)" },
                    { 35882, 1, "Колледж информационных технологий (УНИКИТ, бывш. МГКИТ)" },
                    { 217313, 1, "Колледж кино, телевидения и мультимедиа ВГИК" },
                    { 40282, 1, "Колледж МАИ" },
                    { 44629, 1, "Колледж МАТГРБ" },
                    { 1739403, 1, "Колледж МГАВТ" },
                    { 23983, 1, "Колледж МГАДА (МГИДА)" },
                    { 360968, 1, "Колледж МГСУ" },
                    { 1663342, 1, "Колледж МГТА" },
                    { 43629, 1, "Колледж МГУКИ" },
                    { 29897, 1, "Колледж МГЭУ" },
                    { 23951, 1, "Колледж МГЮА" },
                    { 58613, 1, "Колледж УНН (Натальи Нестеровой)" },
                    { 28862, 1, "Колледж управления и новых технологий (МКУиНТ, бывш. МАПТ)" },
                    { 32128, 1, "Колледж управления и права (МКУиП)" },
                    { 1720129, 1, "Колледж физической культуры и спорта «Спарта»" },
                    { 18582, 1, "Лицей «Знак»" },
                    { 12342, 1, "Лицей «Интеграл»" },
                    { 10912, 1, "Лицей «Ключ»" },
                    { 45296, 1, "Лицей «Ковчег XXI»" },
                    { 25507, 1, "Лицей «Луч»" },
                    { 721681, 1, "Лицей «Мир грамотности» Т. В. Зотовой" },
                    { 144854, 1, "Лицей «Морозко»" },
                    { 40256, 1, "Лицей «Москвич»" },
                    { 3829, 1, "Лицей «Музей»" },
                    { 58720, 1, "Лицей «Надежда»" },
                    { 30610, 1, "Лицей «Преодоление»" },
                    { 7535, 1, "Лицей «Разум-Л»" },
                    { 700705, 1, "Лицей «Рассвет»" },
                    { 14042, 1, "Лицей «Ренессанс»" },
                    { 1771862, 1, "Лицей «Учёный фитнес»" },
                    { 52428, 1, "Лицей «Физико-техническая школа» при ФТИ им. Иоффе" },
                    { 59125, 1, "Лицей «Эдвайс»" },
                    { 51214, 1, "Лицей «Юмла»" },
                    { 30846, 1, "Лицей «Юность»" },
                    { 103065, 1, "Лицей духовной культуры им. преп. Саровского (МЛДК)" },
                    { 17010, 1, "Лицей МГАВТ (I ступень)" },
                    { 1766346, 1, "Лицей МГИМО им. А. М. Горчакова" },
                    { 58965, 1, "Лицей Международного университета (МУМ)" },
                    { 27606, 1, "Лицей «Замоскворечье»" },
                    { 29517, 1, "Колледж ГМПИ им. Ипполитова-Иванова" },
                    { 24923, 1, "Лицей «Возрождение»" },
                    { 1660829, 1, "Литературный лицей при ЛИ им. Горького" },
                    { 54344, 1, "Колледж философии, теологии и истории Св. Фомы Аквинского (КФТИ)" },
                    { 1732834, 1, "Колледж фитнеса и бодибилдинга им. Бена Вейдера" },
                    { 684039, 1, "Колледж художественных ремесел (МКХР)" },
                    { 54297, 1, "Колледж экономики и информатики (КЭИ)" },
                    { 47328, 1, "Колледж экономики и менеджмента (КЭиМ)" },
                    { 489211, 1, "Колледж экономики и юриспруденции «Инфолайн»" },
                    { 18325, 1, "Колледж экономики, страхового дела и информационных технологий КЭСИ (бывш. Колледж МЭСИ)" },
                    { 47182, 1, "Колледж электромеханики и информационных технологий (МГКЭИТ)" },
                    { 25997, 1, "Колледж ювелирного искусства (КЮИ)" },
                    { 30509, 1, "Колледж-XXI" },
                    { 1699148, 1, "Колледжа (факультет среднего профессионального образования) РУК" },
                    { 1770491, 1, "Компьютерная Академия ШАГ" },
                    { 1759030, 1, "Консалтинговый центр" },
                    { 245407, 1, "Кооперативный техникум им. Г. Н. Альтшуля" },
                    { 1691898, 1, "Корейская школа Вон-Гван (Won-Kwang Korean School)" },
                    { 17885, 1, "Краснопресненская детская художественная школа" },
                    { 1765786, 1, "Культурный центр ЗИЛ" },
                    { 10692, 1, "Кунцевский радиомеханический техникум (КРМТ)" },
                    { 1737743, 1, "Курсы МИД" },
                    { 1768290, 1, "Лаборатория режиссуры под руководством К. Богомолова на базе Московского Художественного театра им. А. П. Чехова" },
                    { 1767305, 1, "Летняя экологическая школа (ЛЭШ)" },
                    { 135016, 1, "Лианозовский радиотехнический техникум (ЛРТТ)" },
                    { 58391, 1, "Лингвистический лицей при ИИЯ" },
                    { 25510, 1, "Лицей «Авогадро» при МГАТХТ (МИТХТ) им. М. В. Ломоносова" },
                    { 26332, 1, "Лицей молодых предпринимателей (ЛМП)" },
                    { 29666, 1, "Колледж геодезии и картографии (МКГиК)" },
                    { 32575, 1, "Колледж бизнеса и права МВШ" },
                    { 1752302, 1, "Иешива «Торат Хаим»" },
                    { 51331, 1, "Издательско-полиграфический колледж им. И. Федорова (МИПК)" },
                    { 57924, 1, "Израильская международная школа" }
                });

            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 1775143, 1, "Израильский культурный центр при Посольстве Государства Израиль «Натив»" },
                    { 960847, 1, "Индийская школа (при посольстве Индии)" },
                    { 1069006, 1, "Индустриальный колледж (МИК)" },
                    { 19042, 1, "Инженерная школа метрологии и качества (МИШМиК)" },
                    { 1777835, 1, "Инженерная школа Московского политехнического университета" },
                    { 1774530, 1, "Инженерно-техническая школа им. дважды Героя Советского Союза П. Р. Поповича" },
                    { 1667758, 1, "Институт восстановительной медицины (МИВМ)" },
                    { 1770744, 1, "Западный комплекс непрерывного образования" },
                    { 1781285, 1, "Институт восточной медицины РУДН" },
                    { 1781603, 1, "Институт естественных наук и экологии (ИНЕСНЭК)" },
                    { 1765785, 1, "Институт звукового дизайна / Sound Design Institute" },
                    { 1717294, 1, "Институт инновационных психотехнологий" },
                    { 1780925, 1, "Институт интегративной психологии и психотерапии" },
                    { 1776524, 1, "Институт интегративной семейной терапии (ИИСТ)" },
                    { 1765045, 1, "Институт исследования товародвижения и конъюнктуры оптового рынка (ИТКОР)" },
                    { 1764327, 1, "Институт Йоги" },
                    { 1766509, 1, "Институт консультативной психологии и  консалтинга" },
                    { 1781583, 1, "Институт консультирования и системных решений (ИКСР)" },
                    { 1782117, 1, "Институт Конфуция РГГУ" },
                    { 1776525, 1, "Институт групповой и семейной психологии и психотерапии (ИГиСП)" },
                    { 312978, 1, "Заочный техникум МИФИ" },
                    { 1679311, 1, "Заочный техникум жилищно-коммунальный МЖКХ РСФСР" },
                    { 1778787, 1, "Заочный народный университет искусств (ЗНУИ)" },
                    { 1752248, 1, "Дистанционная школа «Научные кадры будущего»" },
                    { 58856, 1, "Дом детского творчества «Крылатское»" },
                    { 57958, 1, "Дом детского творчества «Строгино»" },
                    { 1768560, 1, "Дом культуры «Гайдаровец»" },
                    { 18742, 1, "Дом культуры «Дружба»" },
                    { 805905, 1, "Дом культуры «Заветы Ильича»" },
                    { 408517, 1, "Дом культуры «Москворечье»" },
                    { 1728853, 1, "Дом культуры «Смена»" },
                    { 144779, 1, "Дом культуры «Стимул»" },
                    { 1773857, 1, "Дом культуры Братеево" },
                    { 1774815, 1, "Дом культуры им. Зуева" },
                    { 1725128, 1, "Дом научно-технического творчества молодёжи (ДНТТМ)" },
                    { 1772429, 1, "Домашняя школа (Первая народная школа)" },
                    { 14763, 1, "ДОСААФ" },
                    { 1672253, 1, "Еврейская школа «Мигдал-Ор»" },
                    { 51245, 1, "Европейская гимназия" },
                    { 1717370, 1, "Елизаветинская гимназия" },
                    { 1677991, 1, "Ешива «Мекор Хаим»" },
                    { 37943, 1, "Женская гимназия (МЖГ)" },
                    { 1769241, 1, "Женский деловой Центр" },
                    { 1751469, 1, "Заочная физико-техническая школа при МФТИ" },
                    { 1675534, 1, "Заочная школа МИФИ" },
                    { 56130, 1, "Заочный лицей при МГУ им. Ломоносова" },
                    { 1767315, 1, "Институт косметологии, эстетической медицины и визажного искусства – Дом Русской Косметики" },
                    { 1745513, 1, "Институт логистики и управления цепями поставок «Ин-Лог»" },
                    { 1759865, 1, "Институт массажа и косметологии" },
                    { 1777614, 1, "Институт непрерывного образования «Профессионал»" },
                    { 47613, 1, "Кадетская школа-интернат «Навигацкая школа» (навигацких и математических наук)" },
                    { 976960, 1, "Кадетский корпус «Пансион воспитанниц Министерства обороны РФ»" },
                    { 1765279, 1, "Кадетский пожарно-спасательный корпус Академии гражданской защиты МЧС России" },
                    { 1658185, 1, "Кинологический колледж (бывш. Ветеринарно-кинологическая школа) при МГАВМиБ им. К. И. Скрябина" },
                    { 1671443, 1, "Кинологический центр «Школа Орлова»" },
                    { 1773898, 1, "Киношкола  «Свободное кино»" },
                    { 1780494, 1, "Киношкола MovieBand" },
                    { 1096283, 1, "Киношкола «Лестница»" },
                    { 1781495, 1, "Киношкола Студии Снегири" },
                    { 36963, 1, "Классическая гимназия (МКГ)" },
                    { 8131, 1, "Классическая гимназия при Греко-латинском кабинете Ю. А. Шичалина" },
                    { 49315, 1, "Классический пансион МГУ им. М. В. Ломоносова" },
                    { 1759758, 1, "Клуб «Тори» кекусинкан карате-до" },
                    { 1652670, 1, "Клуб искусств РАМТ" },
                    { 56443, 1, "Колледж «Академия профессий»" },
                    { 41526, 1, "Колледж «Консорт»" },
                    { 19284, 1, "Колледж «Лидер»" },
                    { 48697, 1, "Колледж «Царицыно» (Колледж управления, гостиничного бизнеса и информационных технологий «Царицыно»)" },
                    { 48655, 1, "Колледж авиационного моторостроения (МКАМ)" },
                    { 1777298, 1, "Колледж администрирования и современных технологий" },
                    { 3713, 1, "Колледж Академии менеджмента инноваций (АМИ)" },
                    { 71630, 1, "Колледж Американского института передового обучения (МК АИПО)" },
                    { 1746744, 1, "Колледж архитектуры и градостроительства (бывш. МКГиП)" },
                    { 1744269, 1, "Итальянский институт культуры в Москве (Instituto Italiano di Cultura a Mosca)" },
                    { 698376, 1, "Колледж водного транспорта (КВТ)" },
                    { 2374, 1, "Итальянская школа «Costanza Vinci» (при посольстве Италии)" },
                    { 39841, 1, "Интернациональная школа «Планета»" },
                    { 1778677, 1, "Институт новых технологий и управления (ИНТиУ)" },
                    { 1778998, 1, "Институт организационной психологии" },
                    { 1779860, 1, "Институт перинатальной и репродуктивной психологии" },
                    { 1779871, 1, "Институт Пилатеса России" },
                    { 1776526, 1, "Институт практической психологии и психоанализа (ИППиП)" },
                    { 1778750, 1, "Институт проблем современного искусства" },
                    { 1761087, 1, "Институт профессионального массажа" },
                    { 1778865, 1, "Институт профессионального образования" },
                    { 1781622, 1, "Институт профессиональных управляющих «Аскери»" },
                    { 1780735, 1, "Институт психодрамы, коучинга и ролевого тренинга" },
                    { 1764121, 1, "Институт репутационных технологий «Арт & Имидж»" },
                    { 1749814, 1, "Институт святого Фомы (ИФТИ)" },
                    { 1712348, 1, "Институт Сервантеса" },
                    { 1764199, 1, "Институт современных психологических технологий «Парацельс»" },
                    { 1770927, 1, "Институт среднего профессионального образования им. К. Д. Ушинского" },
                    { 1709051, 1, "Институт традиционных систем оздоровления" },
                    { 1764497, 1, "Институт трейдинга и инвестиций «Феникс»" },
                    { 1759851, 1, "Институт финансового планирования" },
                    { 1767836, 1, "Институт фондового рынка и управления (ИФРУ)" },
                    { 1779563, 1, "Институт христианской психологии" },
                    { 1759602, 1, "Институт экзистенциально-аналитической психологии и психотерапии" },
                    { 1781683, 1, "Институт электронных систем безопасности (ИЭСБ)" },
                    { 1763921, 1, "Институт эстетической медицины" },
                    { 1711374, 1, "Интернет-школа НИУ ВШЭ" },
                    { 1739247, 1, "Лицей МПГУ (бывш. Лицей гуманитарных технологий МГГУ им. М. А. Шолохова)" },
                    { 1724839, 1, "Лицей НИУ ВШЭ" },
                    { 1765431, 1, "Лицей Президентской академии" },
                    { 10685, 1, "Политехнический колледж им. Н. Н. Годовикова – Отделение Общеобразовательная школа им. Героя Советского Союза Н. И. Кузнецова" },
                    { 2326, 1, "Православная классическая гимназия «Радонеж»" },
                    { 1778349, 1, "Православная классическая гимназия во имя иконы Божией Матери «Знамение» в Ховрине" },
                    { 58284, 1, "Православная Свято-Петровская школа (бывш. Традиционная гимназия)" },
                    { 42476, 1, "Православная школа искусств" },
                    { 54300, 1, "Православный центр непрерывного образования во имя преп. Серафима Саровского" },
                    { 1759515, 1, "Православный центр образования Святителя Николая Чудотворца" },
                    { 1777824, 1, "Представительство Международного института комплексной сказкотерапии" },
                    { 1764120, 1, "Предуниверсарий МГМУ им. Сеченова" },
                    { 1756551, 1, "Предуниверсарий РГГУ" },
                    { 56364, 1, "Политехнический колледж им. Н. Н. Годовикова – Отделение книжного бизнеса (бывш. МГКБИТ)" },
                    { 17337, 1, "Приборостроительный техникум (МПТ) РЭУ им. Г. В. Плеханова" },
                    { 37487, 1, "Прогимназия «Пересвет»" },
                    { 1774693, 1, "Проект «Свободное образование»" },
                    { 6867, 1, "Промышленно-экономический колледж (МПЭК, бывш. ММТТТП) РЭУ им. Г. В. Плеханова" },
                    { 59146, 1, "Промышленно-экономический техникум (МПЭТ)" },
                    { 27499, 1, "Промышленный колледж (МПК)" },
                    { 1749072, 1, "Профессиональная психотерапевтическая лига (ППЛ)" },
                    { 1767594, 1, "Профессиональная школа бодибилдинга и фитнеса" },
                    { 17219, 1, "Профессионально-педагогический колледж (МГППК)" },
                    { 465211, 1, "Профессиональный лицей административного сервиса и менеджмента" },
                    { 1722607, 1, "Профколледж" },
                    { 1675188, 1, "Прогимназия «Белоснежка»" },
                    { 21673, 1, "Политехнический колледж им. Н. Н. Годовикова – Отделение авиастроения и информационных систем (бывш. МАВИАТ)" },
                    { 50876, 1, "Политехнический колледж им. Моссовета" },
                    { 47323, 1, "Подготовительный лицей при МГУ" },
                    { 1775291, 1, "Образовательный центр «Lancman School»" },
                    { 1773093, 1, "Образовательный центр «Академия Фитнеса»" },
                    { 39536, 1, "Образовательный центр «Белст»" },
                    { 134738, 1, "Образовательный центр «Колибри»" },
                    { 1737609, 1, "Образовательный центр им. С. Н. Олехника" },
                    { 51910, 1, "Образовательный центр ОАО «ГАЗПРОМ»" },
                    { 1774968, 1, "Онлайн-университет Arzamas" },
                    { 1771166, 1, "Онлайн-школа «Алгоритм»" },
                    { 1772663, 1, "Онлайн-школа «Медина»" },
                    { 1776478, 1, "Онлайн-школа дизайна Bang Bang Education" },
                    { 1765820, 1, "Останкинская детская школа телевидения" },
                    { 1765818, 1, "Останкинский колледж современного управления, кино и телевидения (ОКСоУ КиТ)" },
                    { 1772650, 1, "Отдел японской культуры «Japan Foundation»" },
                    { 1741121, 1, "Отделение сестринского дела РГУФКСМиТ" },
                    { 8300, 1, "Открытая русская школа (ОРШ)" },
                    { 40505, 1, "Открытый лицей «Всероссийская заочная многопредметная школа» при МГУ" },
                    { 1782131, 1, "Открытый медико-психологический университет (ОМПУ)" },
                    { 489260, 1, "Отраслевой автомобильный колледж (ОАК)" },
                    { 1780568, 1, "Педкампус" },
                    { 1761267, 1, "Первая Медиа Школа (First Media School)" },
                    { 104364, 1, "Первая московская гимназия (ПМГ)" },
                    { 1764302, 1, "Первая Школа Фитнеса (First Fitness School)" },
                    { 58615, 1, "Подготовительные курсы МГУ" },
                    { 32309, 1, "Радиотехнический колледж им. А. А. Расплетина (МРТК)" },
                    { 408893, 1, "Регентско-певческая семинария (МРПС)" },
                    { 697760, 1, "Республиканский заочный политехникум" },
                    { 738937, 1, "Речной техникум (МРТ)" },
                    { 45736, 1, "Специализированная детско-юношеская школа олимпийского резерва «Труд» СК «Олимпийский»" },
                    { 146923, 1, "Специализированная детско-юношеская школа олимпийского резерва «Трудовые резервы»" },
                    { 132151, 1, "Специализированная детско-юношеская школа олимпийского резерва МГФСО" },
                    { 285936, 1, "Специализированная детско-юношеская школа олимпийского резерва по единоборствам «Свиблово»" },
                    { 58821, 1, "Специализированная детско-юношеская школа олимпийского резерва при ДМ на Ленинских горах" },
                    { 56630, 1, "Специализированная детско-юношеская школа олимпийского резерва ЦСКА" },
                    { 51534, 1, "Специализированная школа акварели Сергея Андрияки" },
                    { 217152, 1, "Специальная средняя школа полиции (милиции) МВД России (МССШМ МВД)" },
                    { 52550, 1, "Спортивная школа «На Рублёвке»" },
                    { 1349855, 1, "Спортивная школа «Сетунь»" },
                    { 56649, 1, "Спортивная школа «Чертаново Северное»" },
                    { 18291, 1, "Спортивная школа МСХА им. Тимирязева" },
                    { 1776047, 1, "Спортивная школа олимпийского резерва «Юность Москвы» по гребным видам спорта" },
                    { 1739966, 1, "Спортивная школа олимпийского резерва «Юность Москвы» по легкой атлетике им. братьев Знаменских" },
                    { 58700, 1, "Спортивно-педагогический колледж (СПК)" },
                    { 27744, 1, "Средняя специальная музыкальная школа им. сестёр Гнесиных (МССМШ им. Гнесиных)" },
                    { 1744213, 1, "Старообрядческое духовное училище (МСДУ)" },
                    { 491396, 1, "Столичный бизнес-колледж" },
                    { 1781504, 1, "Столичный колледж индустрии сервиса и гостеприимства (СКИСиГ)" },
                    { 960807, 1, "Столичный профессиональный бизнес-колледж" },
                    { 1758211, 1, "Столичный профессиональный колледж" },
                    { 1775152, 1, "Столичный учебный центр" },
                    { 53591, 1, "Строительный техникум (МСТ)" },
                    { 51421, 1, "Специализированная детско-юношеская школа олимпийского резерва «Торпедо»" },
                    { 1750467, 1, "Образовательный комплекс дизайна и технологий" },
                    { 44744, 1, "Специализированная детско-юношеская школа олимпийского резерва «Спартак»" },
                    { 58397, 1, "Специализированная детско-юношеская школа олимпийского резерва «Локомотив»" },
                    { 1768695, 1, "Рок-Академия «Москворечье»" },
                    { 1766508, 1, "Российско-австрийский институт гуманистической детской психологии и психотерапии «Генезис»" },
                    { 26216, 1, "Российско-норвежская старшая школа" },
                    { 789305, 1, "Русская горнолыжная школа «Столица»" },
                    { 1667740, 1, "Русская техническая школа (РТШ)" },
                    { 1752359, 1, "Русская школа управления" },
                    { 780604, 1, "Русский гуманитарно-технический колледж «Тантал»" },
                    { 1778476, 1, "Санкт-Петербургская Школа Телевидения" },
                    { 7866, 1, "Саудовская школа (Арабская академия при пос. Саудовской Аравии)" },
                    { 18823, 1, "Свято-Владимирская православная школа" },
                    { 1718786, 1, "Свято-Дмитриевская православная школа" },
                    { 129228, 1, "Свято-Дмитриевское училище сестер милосердия (СДУСМ)" },
                    { 497599, 1, "Скандинавская школа (Nordic School)" },
                    { 57367, 1, "Славянско-англо-американская школа «Марина» (SAAS Marina)" },
                    { 1780546, 1, "Современная научно-технологическая академия (СНТА)" },
                    { 1712697, 1, "Современная школа дизайна" },
                    { 7521, 1, "Социально-педагогический колледж МГППУ" },
                    { 55325, 1, "Социальный колледж РГСУ" },
                    { 1744913, 1, "Союз танцевального спорта России" },
                    { 429317, 1, "Специализированная детско-юношеская спортивная школа олимпийского резерва по зимним видам спорта «Огонёк»" },
                    { 1709112, 1, "Специализированная детско-юношеская школа олимпийского резерва «Атлант»" },
                    { 36451, 1, "Специализированная детско-юношеская школа олимпийского резерва «Буревестник»" },
                    { 363574, 1, "Специализированная детско-юношеская школа олимпийского резерва «Крылья Советов»" },
                    { 51420, 1, "Специализированная детско-юношеская школа олимпийского резерва «Спартак-Щелково»" },
                    { 1765540, 1, "Образовательный комплекс градостроительства «Столица»" },
                    { 1766542, 1, "Образовательный комплекс «Юго-Запад»" },
                    { 102805, 1, "Областной медицинский колледж (МосОМК)" },
                    { 35587, 1, "Международная школа завтрашнего дня (IST)" },
                    { 1759759, 1, "Международная школа имиджелогии «Art in Style»" },
                    { 37404, 1, "Международная школа иностранных языков и бизнеса «Benedict School»" },
                    { 1742429, 1, "Международная школа молодежной дипломатии при МГИМО (У) МИД России" },
                    { 1778481, 1, "Международный институт интегральной превентивной и антивозрастной медицины «PreventAge»" },
                    { 1781736, 1, "Международный институт Монтессори-педагогики (МИМП)" },
                    { 1744210, 1, "Международный институт сотрудничества Восток-Запад" },
                    { 1781621, 1, "Международный институт тренеров «Профессионал» (ИППК «Профессионал»)" },
                    { 1779072, 1, "Международный технологический колледж МГУПП" },
                    { 1744161, 1, "Международный центр образования «Атлантик» (Atlantic International School)" },
                    { 17013, 1, "Международный центр обучения (МЦО)" },
                    { 1774117, 1, "Международный центр профессионального коучинга ICP Centre" },
                    { 1781861, 1, "Международный центр профессионального образования (МЦПО)" },
                    { 1765819, 1, "Международный Эриксоновский Университет коучинга" },
                    { 1762097, 1, "Межкультурный институт языков Liden & Denz" },
                    { 1781731, 1, "Межрегиональный институт гуманистической психотерапии (МИГп)" },
                    { 34176, 1, "Механико-технологический техникум мясной и холодильной промышленности (ММТТМиХП)" },
                    { 57538, 1, "Механический техникум Мосгорисполкома" },
                    { 1762856, 1, "Многопрофильный образовательный комплекс «Кузьминки»" },
                    { 1764772, 1, "Многопрофильный социально-экономический колледж" },
                    { 1778399, 1, "Многопрофильный техникум им. Л. Б. Красина" },
                    { 50021, 1, "Модельная школа завтрашнего дня" },
                    { 1763223, 1, "Московская академия профессиональных компетенций (МАПК)" },
                    { 1677505, 1, "Международная школа дизайна (International Design School)" },
                    { 287302, 1, "Московская армянская гимназия им. Сержа Джилавяна" },
                    { 1781483, 1, "Международная школа бизнеса Московской торгово-промышленной палаты" },
                    { 1779886, 1, "Международная детская гуманитарная академия при ИЯиК им. Л. Толстого" },
                    { 59864, 1, "Лицей при ИМТП" },
                    { 20731, 1, "Лицей при РГГУ (ЦДО РГГУ)" },
                    { 32190, 1, "Лицей при ЮНЕСКО (UNESCO)" },
                    { 1777021, 1, "Лицей Финансового Университета" },
                    { 1772881, 1, "Малый мехмат МГУ" },
                    { 1541358, 1, "Мастерская Юрия Грымова" },
                    { 8852, 1, "Математический колледж (ММК, бывш. ММТ)" },
                    { 1748641, 1, "Машиностроительный техникум им. Ф. Э. Дзержинского" },
                    { 44614, 1, "Медико-биологическая школа «Вита»" },
                    { 51955, 1, "Медицинский колледж (бывш. Медицинский колледж РАМН)" },
                    { 1771967, 1, "Медицинский колледж ВМедА им. Кирова (филиал в Москве)" },
                    { 34344, 1, "Медицинский колледж ВУНМЦ Росздрава" },
                    { 26717, 1, "Медицинский колледж им. С. П. Боткина" },
                    { 1778601, 1, "Медицинский колледж при МГМУ им. И. М. Сеченова (бывш. Медицинское училище)" },
                    { 54442, 1, "Медицинский колледж при МИИТе" },
                    { 56532, 1, "Медицинский колледж при ЦКБ им. Семашко" },
                    { 49728, 1, "Медицинский колледж Управления делами Президента РФ" },
                    { 2589, 1, "Медицинское училище при ГВКГ им. Н. Н. Бурденко" },
                    { 1781690, 1, "Международная академия биржевой торговли «Форекс Клуб»" },
                    { 1771545, 1, "Международная Академия исследования лжи (IARL)" },
                    { 1757226, 1, "Международная Академия Коучинга" },
                    { 1743440, 1, "Международная ассоциация музыкального искусства «Живая Гармония»" },
                    { 1770119, 1, "Международная гимназия Инновационного центра «Сколково»" },
                    { 17078, 1, "Международная школа «Дом Филиппа»" },
                    { 1774115, 1, "Су Джок Академия" },
                    { 1781689, 1, "Московская ассоциация аналитической психологии (МААП)" },
                    { 58406, 1, "Московская международная гимназия (ММГ)" },
                    { 17150, 1, "Музыкальная школа Академического музыкального колледжа при МГК" },
                    { 4014, 1, "Музыкальная школа им. Блажевича" },
                    { 477913, 1, "Музыкальная школа им. В. Ф. Одоевского" },
                    { 54656, 1, "Музыкальная школа им. Гнесиных при ГМУ им. Гнесиных" },
                    { 489191, 1, "Музыкальная школа МГУМИ им. Ф. Шопена" },
                    { 1781656, 1, "Музыкально-драматический театр-студия «Tempera»" },
                    { 52468, 1, "Музыкально-педагогический колледж (ММПК)" },
                    { 48671, 1, "Музыкально-хоровая школа «Касталия»" },
                    { 22147, 1, "Музыкально-хоровая школа «Радость»" },
                    { 43260, 1, "Музыкально-эстетический центр «Аллегро»" },
                    { 16783, 1, "Музыкальное училище им. Гнесиных (ГМУ)" },
                    { 28800, 1, "Музыкальный колледж МГИМ им. Шнитке" },
                    { 1344431, 1, "Муниципальная экспериментальная школа (МЭШ)" },
                    { 59374, 1, "Налоговый колледж" },
                    { 1781616, 1, "Национальная академия современных технологий" },
                    { 1778518, 1, "Национальный технологический университет" },
                    { 56231, 1, "Немецкая Посольская школа (German Diplomatic School)" },
                    { 26300, 1, "Немецкая школа в Москве - Deutsche Schule Moskau (при посольстве ФРГ)" },
                    { 2373, 1, "Новая гуманитарная школа" },
                    { 1774406, 1, "Новая школа" },
                    { 44839, 1, "НОУ «Дом Станкевича»" },
                    { 1656322, 1, "НП «Телешкола»" },
                    { 45948, 1, "Областной государственный колледж (МОГК)" },
                    { 228850, 1, "Музыкальная школа «Орфей»" },
                    { 1732415, 1, "Московская еврейская школа «Месивта»" },
                    { 9118, 1, "Музыкальная школа «Встреча»" },
                    { 1780563, 1, "Московский центр дистанционного образования «Бакалавр-Магистр»" },
                    { 1749080, 1, "Московская Школа Кино" },
                    { 1747876, 1, "Московская школа нового кино (МШНК)" },
                    { 1759995, 1, "Московская школа политических исследований (МШПИ)" },
                    { 1772814, 1, "Московская школа радио и телевидения" },
                    { 1773770, 1, "Московская школа церковных звонарей Ильи Дроздихина" },
                    { 59215, 1, "Московский автомобильный колледж при АМО ЗиЛ" },
                    { 58000, 1, "Московский банковский колледж Банка России (бывш. МБШ ЦБ РФ)" },
                    { 1764338, 1, "Московский Гештальт Институт (МГИ)" },
                    { 1771966, 1, "Московский городской открытый колледж" },
                    { 1775824, 1, "Московский государственный образовательный комплекс (МГОК)" },
                    { 1781735, 1, "Московский институт гештальт-терапии и консультирования (МИГТиК)" },
                    { 1776523, 1, "Московский институт гештальта и психодрамы (МИГИП)" },
                    { 1777681, 1, "Московский институт по повышению квалификации и профессиональной переподготовке специалистов" },
                    { 1765236, 1, "Московский институт профессиональной и любительской фотографии" },
                    { 1776527, 1, "Московский институт психоанализа (МИП) — Дополнительное образование" },
                    { 1759564, 1, "Московский институт экспертизы и испытаний (МИЭИ)" },
                    { 1769006, 1, "Московский исламский колледж" },
                    { 43770, 1, "Московский коммерческий колледж (МКК)" },
                    { 16025, 1, "Московский лицей «Ступени»" },
                    { 1775729, 1, "Московский Международный Колледж" },
                    { 1782159, 1, "Московский образовательный комплекс Запад" },
                    { 1766543, 1, "Московский политехнический колледж" },
                    { 1781829, 1, "Московский учебно-спортивный центр Москомспорта" },
                    { 185257, 1, "Московское президентское кадетское училище им. М. А. Шолохова войск национальной гвардии РФ (бывш. Кадетская школа-интернат №" },
                    { 2951, 1, "Школа №1234" },
                    { 6926, 1, "Школа №1233" },
                    { 2883, 1, "Школа №1232" },
                    { 5769, 1, "Школа №108" },
                    { 331079, 1, "Музыкальная школа №108" },
                    { 420, 1, "Школа №109 (бывш. УВК Лицей 109, ЦО 109)" },
                    { 47489, 1, "Музыкальная школа №109 им. П. Г. Чеснокова" },
                    { 1061040, 1, "Профессиональное училище №109" },
                    { 54662, 1, "Спортивная школа олимпийского резерва №111 (СДЮШОР 111)" },
                    { 4525, 1, "Школа №112" },
                    { 58948, 1, "Вечерняя школа №112" },
                    { 757929, 1, "Профессионально-техническое училище №112" },
                    { 3614, 1, "Школа №113" },
                    { 377557, 1, "Музыкальная школа №107 им. С.И. Танеева" },
                    { 1717382, 1, "Среднее профессионально-техническое училище №113" },
                    { 15209, 1, "Школа №115" },
                    { 1033, 1, "Школа №116" },
                    { 78380, 1, "Школа №117" },
                    { 36977, 1, "Школа №118" },
                    { 19215, 1, "Гимназия №118" },
                    { 1866, 1, "Школа №119" },
                    { 4283, 1, "Школа №120" },
                    { 403449, 1, "Школа искусств №120" },
                    { 4021, 1, "Школа №121" },
                    { 28227, 1, "Школа №122" },
                    { 4771, 1, "Школа №114" },
                    { 3349, 1, "Школа №107" },
                    { 40552, 1, "Музыкально-хоровая школа №106" },
                    { 9007, 1, "Школа №106" },
                    { 20816, 1, "Музыкальная школа №96" },
                    { 1769393, 1, "Профессиональное училище №96" },
                    { 4056, 1, "Школа №97" },
                    { 7099, 1, "Музыкальная школа №97" },
                    { 960806, 1, "Детский сад №97" },
                    { 1763379, 1, "Профессиональное училище №98" },
                    { 2932, 1, "Школа №98" },
                    { 20299, 1, "Музыкальная школа №98" },
                    { 1303, 1, "Школа №99" },
                    { 49402, 1, "Детская музыкальная школа им. Н. П. Будашкина (бывш. ДМШ №99) (МГОДШИ «Кусково»)" },
                    { 1197, 1, "Школа №100 (ныне шк. 1010)" },
                    { 1715623, 1, "Музыкальная школа №100" },
                    { 465225, 1, "Профессионально-техническое училище №100" },
                    { 6777, 1, "Школа №101" },
                    { 254976, 1, "Школа-интернат №101 для глухих и слабослышащих детей" },
                    { 40407, 1, "Спортивная школа олимпийского резерва №101 (СДЮШОР 101)" },
                    { 9425, 1, "Школа №102" },
                    { 4323, 1, "Музыкальная школа им. В. А. Моцарта (ДМШ 102)" },
                    { 3303, 1, "Школа №103" },
                    { 8935, 1, "Музыкальная школа №103" },
                    { 4178, 1, "Школа №104" },
                    { 18383, 1, "Музыкальная школа №104" },
                    { 97698, 1, "Музыкальная школа №105" },
                    { 4086, 1, "Музыкальная школа №122" },
                    { 1684, 1, "Школа №123" },
                    { 1986, 1, "Школа №124" },
                    { 3800, 1, "Школа №125" },
                    { 594, 1, "Школа №146" },
                    { 1603, 1, "Школа №147" },
                    { 5329, 1, "Школа №148" },
                    { 215266, 1, "Вечерняя школа №148" },
                    { 4041, 1, "Школа №149" },
                    { 9476, 1, "Среднее профессионально-техническое училище №149" },
                    { 869, 1, "Школа №150" },
                    { 868528, 1, "Профессионально-техническое училище №150" },
                    { 814, 1, "Школа №151" },
                    { 1685740, 1, "Профессионально-техническое училище №151 (до 1995 г.)" },
                    { 3358, 1, "Школа №152" },
                    { 294192, 1, "Школа искусств №152" },
                    { 8560, 1, "Школа №153" },
                    { 1334428, 1, "Профессионально-техническое училище №153" },
                    { 73598, 1, "Школа №154" },
                    { 216245, 1, "Профессионально-техническое училище №154" },
                    { 3709, 1, "Школа №155" },
                    { 25253, 1, "Школа №156" },
                    { 22270, 1, "Школа №157" },
                    { 1075660, 1, "Профессионально-техническое училище №157" },
                    { 287631, 1, "Школа искусств №157" },
                    { 4324, 1, "Школа №158" },
                    { 1662100, 1, "Профессионально-техническое училище №158" },
                    { 24834, 1, "Школа №145" },
                    { 320427, 1, "Вечерняя школа №96" },
                    { 33435, 1, "Профессионально-техническое училище №144" },
                    { 3613, 1, "Школа №144" },
                    { 1396, 1, "Школа №126" },
                    { 1888, 1, "Школа №127" },
                    { 148877, 1, "Вечерняя школа №127" },
                    { 4156, 1, "Школа №128" },
                    { 9250, 1, "Школа №129" },
                    { 5124, 1, "Школа №130" },
                    { 1672255, 1, "Вечерняя школа №130" },
                    { 10209, 1, "Школа №131" },
                    { 14940, 1, "Школа №132" },
                    { 815, 1, "Школа №134" },
                    { 16236, 1, "Школа №135" },
                    { 41717, 1, "Школа №136" },
                    { 12048, 1, "Лицей №136" },
                    { 10704, 1, "Школа №137" },
                    { 2553, 1, "Школа №138" },
                    { 17736, 1, "Школа №139" },
                    { 825274, 1, "Школа №140" },
                    { 5617, 1, "Школа №141" },
                    { 10231, 1, "Школа №142" },
                    { 1672254, 1, "Профессиональное училище №142" },
                    { 16077, 1, "Школа №143" },
                    { 1676683, 1, "Детский сад №143" },
                    { 895312, 1, "Профессиональное училище №143" },
                    { 244087, 1, "Вечерняя школа №144" },
                    { 312746, 1, "Детский сад №158" },
                    { 451211, 1, "Школа-интернат №96" },
                    { 18843, 1, "Детская музыкальная школа им. Т. А. Докшицера (бывш. ДМШ №95 им. Т. А. Докшицера)" },
                    { 4100, 1, "Школа №72" },
                    { 217160, 1, "Школа-интернат №72" },
                    { 6011, 1, "Музыкальная школа №72 «Весна»" },
                    { 579785, 1, "Спортивная школа олимпийского резерва №72 «Афина»" },
                    { 3934, 1, "Школа №73" },
                    { 1447879, 1, "Школа-интернат №73" },
                    { 1680840, 1, "Вечерняя школа №73" },
                    { 19003, 1, "Музыкальная школа №73 им. Л. Н. Власенко" },
                    { 32345, 1, "Детско-юношеская спортивная школа №73" },
                    { 41990, 1, "Спортивная детско-юношеская школа олимпийского резерва №73 «Виктория»" },
                    { 39848, 1, "Специализированная детско-юношеская школа олимпийского резерва №71 «Тимирязевская»" },
                    { 836, 1, "Школа №74" },
                    { 52469, 1, "Спортивная школа олимпийского резерва №74 (СДЮШОР 74)" },
                    { 8465, 1, "Школа №75" },
                    { 431923, 1, "Школа-интернат №75" },
                    { 238861, 1, "Детская музыкальная школа им. Кара Караева (бывш. Музыкальная школа №75)" },
                    { 579788, 1, "Школа №76" },
                    { 2630, 1, "Школа-интернат №76" },
                    { 509435, 1, "Музыкальная школа №76" },
                    { 59485, 1, "Спортивная детско-юношеская школа олимпийского резерва №76 «Тимирязевец»" },
                    { 1280884, 1, "Профессионально-техническое училище №76" },
                    { 1749914, 1, "Открытая (сменная) школа №77" },
                    { 10467, 1, "Музыкальная школа №74" },
                    { 37563, 1, "Школа-интернат №71" },
                    { 3275, 1, "Школа №71" },
                    { 1291516, 1, "Профессионально-техническое училище №70" },
                    { 244112, 1, "Профессиональное училище №63" },
                    { 16991, 1, "Школа №64" },
                    { 3720, 1, "Музыкальная школа №64" },
                    { 9889, 1, "Детско-юношеская спортивная школа №64" },
                    { 36787, 1, "Спортивная школа олимпийского резерва №64 (СДЮСШОР 64)" },
                    { 2012, 1, "Школа №65" },
                    { 38270, 1, "Музыкальная школа №65 им. А. Б. Гольденвейзера" },
                    { 100978, 1, "Спортивная школа олимпийского резерва №65 по волейболу  «Ника»" },
                    { 26939, 1, "Школа №66" },
                    { 23574, 1, "Школа-интернат №66" },
                    { 44686, 1, "Музыкальная школа №66" },
                    { 1658184, 1, "Колледж парикмахерского искусства №66" },
                    { 24835, 1, "Гимназия №67" },
                    { 41503, 1, "Музыкальная школа №67 им. А. М. Иванова-Крамского" },
                    { 1668211, 1, "Техникум малого бизнеса № 67" },
                    { 12850, 1, "Школа №68" },
                    { 21992, 1, "Музыкальная школа №68 им. Р. К. Щедрина" },
                    { 3347, 1, "Школа №69 им. Б. Ш. Окуджавы" },
                    { 37874, 1, "Кадетская школа-интернат №69 «Второй Московский кадетский корпус (МЧС)»" },
                    { 102699, 1, "Музыкальная школа №69" },
                    { 10848, 1, "Школа №70" },
                    { 24680, 1, "Музыкальная школа №70 «Восход»" },
                    { 3865, 1, "Центр спорта и образования «Самбо-70»" },
                    { 35444, 1, "Школа №77" },
                    { 30423, 1, "Лицей №77" },
                    { 3847, 1, "Музыкальная школа №77" },
                    { 42140, 1, "Школа №78" },
                    { 56650, 1, "Школа №88" },
                    { 18635, 1, "Музыкальная школа №88 им. А. Ф. Гедике" },
                    { 646911, 1, "Профессионально-техническое училище №88" },
                    { 1504, 1, "Школа №89 им. А. П. Маресьева" },
                    { 20181, 1, "Музыкальная школа №89 им. А. П. Бородина" },
                    { 19834, 1, "Школа №90" },
                    { 35004, 1, "Вечерняя школа №90" },
                    { 58819, 1, "Детская музыкальная школа им. В. П. Соловьёва-Седого (бывш. ДМШ №90)" },
                    { 2903, 1, "Школа №91 РАО" },
                    { 58169, 1, "Музыкальная школа №91" },
                    { 373548, 1, "Училище №91" },
                    { 1039, 1, "Школа №92" },
                    { 51897, 1, "Музыкальная школа №92" },
                    { 901794, 1, "Специализированная детско-юношеская школа олимпийского резерва №92 по бадминтону" },
                    { 2637, 1, "Школа №93" },
                    { 13864, 1, "Музыкальная школа №93" },
                    { 38072, 1, "Спортивная школа №93 «На Можайке»" },
                    { 31413, 1, "Школа №94" },
                    { 501089, 1, "Школа-интернат №94" },
                    { 144619, 1, "Специализированная детско-юношеская школа олимпийского резерва №94" },
                    { 99486, 1, "Школа №95 (до 1997 г.)" },
                    { 24060, 1, "Лицей №95" },
                    { 455015, 1, "Школа-интернат №95" },
                    { 1667459, 1, "Профессионально-техническое училище №87" },
                    { 68099, 1, "Школа №96" },
                    { 40536, 1, "Музыкальная школа им. В. И. Сафонова (бвш. ДМШ №87)" },
                    { 1667744, 1, "Детско-юношеская спортивная школа №86" },
                    { 55012, 1, "Музыкальная школа №78 им. Майкапара" },
                    { 1761085, 1, "Профессиональное училище №79" },
                    { 2074, 1, "Школа №79" },
                    { 40935, 1, "Детская музыкальная школа им. Ференца Листа (бывш. ДМШ №79) (МГОДШИ «Кусково»)" },
                    { 36028, 1, "Спортивная школа олимпийского резерва №79 «Ленинградка»" },
                    { 4329, 1, "Школа №80" },
                    { 5118, 1, "Музыкальная школа №80" },
                    { 1563751, 1, "Профессиональное училище №80" },
                    { 59180, 1, "Школа №81" },
                    { 20404, 1, "Детская музыкальная школа №81 им. Д. Д. Шостаковича (МГОДШИ «Кусково»)" },
                    { 217153, 1, "Спортивный клуб «Самбо-81»" },
                    { 7985, 1, "Школа №82" },
                    { 533747, 1, "Музыкальная школа №82" },
                    { 30733, 1, "Музыкальная школа №83 им. М. И. Табакова" },
                    { 15735, 1, "Школа №84" },
                    { 34412, 1, "Музыкальная школа №84 им. Ф. И. Шаляпина" },
                    { 518309, 1, "Детско-юношеская спортивная школа №84" },
                    { 2327, 1, "Колледж №84" },
                    { 5208, 1, "Школа №85" },
                    { 1687566, 1, "Спортивная школа олимпийского резерва №85 «Синяя птица»" },
                    { 51919, 1, "Профессиональное училище №85" },
                    { 3656, 1, "Школа №86" },
                    { 16757, 1, "Музыкальная школа №86" },
                    { 5117, 1, "Школа №87" },
                    { 4961, 1, "Школа №159" },
                    { 14617, 1, "Школа №160" },
                    { 33823, 1, "Школа №161" },
                    { 19320, 1, "Школа №278" },
                    { 1328, 1, "Школа №279" },
                    { 14499, 1, "Школа №280" },
                    { 9393, 1, "Школа №281" },
                    { 3440, 1, "Школа №282" },
                    { 30253, 1, "Школа №283" },
                    { 5593, 1, "Гимназия №283" },
                    { 216916, 1, "Школа №284" },
                    { 1460, 1, "Школа №285" },
                    { 6906, 1, "Школа №286" },
                    { 11206, 1, "Школа №277" },
                    { 3660, 1, "Школа №287" },
                    { 5629, 1, "Школа №289" },
                    { 8150, 1, "Школа №290" },
                    { 39002, 1, "Школа №291" },
                    { 1989, 1, "Школа №292" },
                    { 9087, 1, "Школа №293" },
                    { 4381, 1, "Школа №294" },
                    { 251675, 1, "Школа №295" },
                    { 2894, 1, "Школа №296" },
                    { 1516899, 1, "Детский сад №296" },
                    { 2084, 1, "Школа №297" },
                    { 9021, 1, "Школа №288" },
                    { 2737, 1, "Школа №276" },
                    { 225042, 1, "Школа №275 (до 2000 г.)" },
                    { 1479, 1, "Школа №274" },
                    { 3924, 1, "Школа №252" },
                    { 908530, 1, "Школа №253" },
                    { 5172, 1, "Школа №254" },
                    { 27202, 1, "Школа №255" },
                    { 24000, 1, "Школа №256" },
                    { 9473, 1, "Школа №257" },
                    { 3237, 1, "Школа №258" },
                    { 16490, 1, "Школа №259" },
                    { 13337, 1, "Школа №260" },
                    { 673, 1, "Школа №261" },
                    { 7095, 1, "Школа №262" },
                    { 25295, 1, "Школа №263" },
                    { 18133, 1, "Школа №264" },
                    { 4253, 1, "Детско-юношеская спортивная школа №264" },
                    { 57990, 1, "Школа №265" },
                    { 545092, 1, "Детский сад №265" },
                    { 1148, 1, "Школа №266" },
                    { 7217, 1, "Школа №267" },
                    { 49307, 1, "Школа №268" },
                    { 5080, 1, "Школа №269" },
                    { 7364, 1, "Школа №271" },
                    { 4377, 1, "Школа №272" },
                    { 18530, 1, "Школа №273" },
                    { 8649, 1, "Школа №298" },
                    { 2261, 1, "Школа №299" },
                    { 1300, 1, "Школа №300" },
                    { 5273, 1, "Школа №301" },
                    { 8166, 1, "Школа №319" },
                    { 5566, 1, "Лицей №320" },
                    { 30797, 1, "Школа №321" },
                    { 804152, 1, "Профессиональный лицей №321" },
                    { 13279, 1, "Лицей №322" },
                    { 9530, 1, "Школа №323" },
                    { 12076, 1, "Школа №324" },
                    { 51780, 1, "Банковский профессиональный лицей №324" },
                    { 955, 1, "Школа №325" },
                    { 7694, 1, "Школа-интернат №325" },
                    { 384400, 1, "Профессиональный лицей трикотажного дизайна №325" },
                    { 3894, 1, "Школа №326" },
                    { 2440, 1, "Школа №327" },
                    { 36652, 1, "Школа №328" },
                    { 20096, 1, "Лицей №328" },
                    { 4212, 1, "Школа №329" },
                    { 33390, 1, "Гимназия №329" },
                    { 1766544, 1, "Профессиональный лицей №329" },
                    { 3652, 1, "Школа №330" },
                    { 34175, 1, "Школа №331" },
                    { 56147, 1, "Лицей №331" },
                    { 5481, 1, "Школа №332" },
                    { 29802, 1, "Школа №333" },
                    { 17387, 1, "Лицей №318" },
                    { 1817, 1, "Школа №251" },
                    { 133387, 1, "Школа №318" },
                    { 548, 1, "Школа №316" },
                    { 1763641, 1, "Профессиональный лицей административного сервиса и менеджмента №301" },
                    { 9742, 1, "Школа №302" },
                    { 52183, 1, "Художественный профессиональный лицей №303 (МХПЛ)" },
                    { 6357, 1, "Школа №304" },
                    { 685647, 1, "Профессиональный лицей №304" },
                    { 913, 1, "Школа №305" },
                    { 2027, 1, "Школа №306" },
                    { 16108, 1, "Школа №307" },
                    { 311558, 1, "Профессиональный лицей швейного дизайна №307" },
                    { 324539, 1, "Профессиональный лицей №307" },
                    { 1744699, 1, "Школа №308" },
                    { 268, 1, "Гимназия №308" },
                    { 3299, 1, "Школа №310" },
                    { 47275, 1, "Школа №311" },
                    { 33271, 1, "Лицей №311" },
                    { 4338, 1, "Школа №312" },
                    { 10701, 1, "Школа №313" },
                    { 622, 1, "Школа №314" },
                    { 41495, 1, "Лицей №314" },
                    { 41687, 1, "Колледж №314" },
                    { 53983, 1, "Профессиональный полиграфический лицей №314" },
                    { 4143, 1, "Школа №315" },
                    { 516154, 1, "Колледж парикмахерского искусства №315" },
                    { 6955, 1, "Школа №317" },
                    { 3002, 1, "Школа №250" },
                    { 3591, 1, "Школа №249" },
                    { 189071, 1, "Школа №248" },
                    { 43308, 1, "Школа №181" },
                    { 6982, 1, "Школа №183" },
                    { 1208, 1, "Школа №184" },
                    { 12819, 1, "Школа №185" },
                    { 1037082, 1, "Вечерняя школа №185 (экстернат)" },
                    { 1683, 1, "Школа №186" },
                    { 1698423, 1, "Профессионально-техническое училище №186 (до 1994 г.)" },
                    { 3041, 1, "Школа №187" },
                    { 7431, 1, "Школа №188" },
                    { 411347, 1, "Профессионально-техническое училище №188" },
                    { 20508, 1, "Школа №189" },
                    { 1412268, 1, "Профессиональное училище №189" },
                    { 1438, 1, "Школа №190" },
                    { 1412227, 1, "Профессионально-техническое училище №190" },
                    { 287000, 1, "Школа искусств №190" },
                    { 4758, 1, "Школа №191" },
                    { 884843, 1, "Среднее профессионально-техническое училище №191" },
                    { 47525, 1, "Школа №192" },
                    { 3138, 1, "Лицей №192" },
                    { 3402, 1, "Школа №193" },
                    { 17379, 1, "Школа №194" },
                    { 4754, 1, "Школа №195" },
                    { 43353, 1, "Школа №196" },
                    { 7967, 1, "Многопрофильный комплекс «Бибирево» (бывш. шк. 180)" },
                    { 21722, 1, "Школа №197" },
                    { 4873, 1, "Школа №179 (бывш. шк. 179 МИОО)" },
                    { 58064, 1, "Школа №177" },
                    { 475335, 1, "Детский сад №161" },
                    { 251664, 1, "Школа №162" },
                    { 527898, 1, "Детский сад №162" },
                    { 5026, 1, "Школа №163" },
                    { 1496, 1, "Школа №165" },
                    { 294151, 1, "Детский сад №165" },
                    { 686404, 1, "Профессиональное училище №165" },
                    { 8811, 1, "Школа №166" },
                    { 1547152, 1, "Вечерняя школа №166" },
                    { 489251, 1, "Детский сад №166" },
                    { 8900, 1, "Школа №167" },
                    { 3375, 1, "Школа №168" },
                    { 34133, 1, "Школа №169" },
                    { 24424, 1, "Школа №170 им. А. П. Чехова (бывш. УВК 1695, ЦО 170)" },
                    { 764, 1, "Школа №171" },
                    { 16449, 1, "Школа №172" },
                    { 457540, 1, "Профессиональное училище №172" },
                    { 287290, 1, "Школа искусств №172" },
                    { 5018, 1, "Школа №173" },
                    { 2101, 1, "Школа №174" },
                    { 1305475, 1, "Профессионально-техническое училище №174" },
                    { 3408, 1, "Школа №175" },
                    { 9522, 1, "Школа №176" },
                    { 360973, 1, "Детско-юношеская спортивная школа №178" },
                    { 238093, 1, "Специализированная детско-юношеская школа олимпийского резерва №63 «Смена»" },
                    { 8518, 1, "Школа №198" },
                    { 57147, 1, "Школа-лаборатория №199" },
                    { 795, 1, "Политехнический колледж им. Н. Н. Годовикова – Отделение Школа (бывш. шк. 225)" },
                    { 20402, 1, "Школа №226" },
                    { 22602, 1, "Вечерняя школа №226" },
                    { 7807, 1, "Школа №227" },
                    { 9828, 1, "Школа №228" }
                });

            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 27586, 1, "Школа №229" },
                    { 13669, 1, "Школа №230" },
                    { 8206, 1, "Школа №231" },
                    { 11628, 1, "Школа №232" },
                    { 5045, 1, "Школа №233" },
                    { 11093, 1, "Школа №234" },
                    { 3676, 1, "Школа №235" },
                    { 18171, 1, "Школа №236" },
                    { 7136, 1, "Школа №237" },
                    { 33961, 1, "Школа №239" },
                    { 6293, 1, "Школа №240" },
                    { 15749, 1, "Школа №241" },
                    { 2809, 1, "Школа №242" },
                    { 2617, 1, "Школа №243" },
                    { 58290, 1, "Классический лицей №243" },
                    { 5214, 1, "Школа №245" },
                    { 3027, 1, "Школа №246" },
                    { 56227, 1, "Школа №247" },
                    { 1266, 1, "Школа №224" },
                    { 3134, 1, "Школа №199" },
                    { 3588, 1, "Школа №223" },
                    { 4988, 1, "Школа №221" },
                    { 31243, 1, "Профессиональное училище №199" },
                    { 24913, 1, "Школа №200" },
                    { 32651, 1, "Школа №201 им. Зои и Александра Космодемьянских" },
                    { 1779570, 1, "Среднее профессионально-техническое училище №201" },
                    { 9659, 1, "Школа №203" },
                    { 288593, 1, "Вечерняя школа №203" },
                    { 7610, 1, "Школа №204" },
                    { 4679, 1, "Школа №205" },
                    { 44568, 1, "Учебно-воспитательный комплекс №206" },
                    { 1647518, 1, "Среднее профессионально-техническое училище №206" },
                    { 780, 1, "Школа №207" },
                    { 717, 1, "Школа №208" },
                    { 7193, 1, "Школа №210" },
                    { 13891, 1, "Школа №211" },
                    { 3014, 1, "Школа №212" },
                    { 4442, 1, "Школа №213" },
                    { 3517, 1, "Школа №214" },
                    { 4742, 1, "Школа №215" },
                    { 14647, 1, "Школа №216" },
                    { 134747, 1, "Школа №217" },
                    { 779, 1, "Школа №218" },
                    { 3739, 1, "Школа №219" },
                    { 1231, 1, "Школа №220" },
                    { 2666, 1, "Школа №222" },
                    { 14690, 1, "Лицей №333" },
                    { 10082, 1, "Музыкальная школа №63" },
                    { 52554, 1, "Детско-юношеская спортивная школа №62" },
                    { 32864, 1, "Фармацевтический колледж (ФК ДЗМ, бывш. МФУ 10)" },
                    { 1762724, 1, "Школа искусств №10" },
                    { 37244, 1, "Школа №11" },
                    { 12043, 1, "Гимназия №11" },
                    { 50917, 1, "Лицей №11" },
                    { 29968, 1, "Школа-интернат №11" },
                    { 1745338, 1, "Кадетская школа-интернат №11 «Московский дипломатический кадетский корпус»" },
                    { 15470, 1, "Музыкальная школа №11 им. В. И. Мурадели" },
                    { 31565, 1, "Колледж предпринимательства №11" },
                    { 31292, 1, "Школа искусств №11" },
                    { 22845, 1, "Педагогический колледж №10" },
                    { 17740, 1, "Школа №12" },
                    { 52211, 1, "Лицей №12" },
                    { 100521, 1, "Художественная школа №12" },
                    { 97437, 1, "Педагогический колледж №12" },
                    { 260188, 1, "Строительный колледж №12" },
                    { 18309, 1, "Колледж №12" },
                    { 3620, 1, "Школа искусств им. А. А. Алябьева (бывш. ДМШ 12)" },
                    { 1671740, 1, "Профессиональное училище №12" },
                    { 1758465, 1, "Школа-интернат №13" },
                    { 49325, 1, "Школа №13" },
                    { 22241, 1, "Гимназия №13" },
                    { 44855, 1, "Гимназия №12" },
                    { 37036, 1, "Колледж сферы услуг №10" },
                    { 37970, 1, "Колледж №10" },
                    { 22274, 1, "Художественная школа №10" },
                    { 287321, 1, "Вечерняя школа №8" },
                    { 45307, 1, "Музыкальная школа №8 им. А. Островского" },
                    { 49493, 1, "Художественная школа им. М. А. Врубеля (бывш. ДХШ 8)" },
                    { 35231, 1, "Педагогический колледж №8" },
                    { 489280, 1, "Политехнический колледж №8 им. И. Ф. Павлова" },
                    { 465184, 1, "Медицинский колледж №8 (бывш. ММУ 23)" },
                    { 33548, 1, "Колледж №8" },
                    { 12117, 1, "Медицинское училище №8 (ММУ 8)" },
                    { 1685515, 1, "Детский сад №8" },
                    { 629, 1, "Школа №9" },
                    { 44192, 1, "Гимназия №9" },
                    { 384406, 1, "Школа-интернат №9" },
                    { 1668259, 1, "Кадетская школа-интернат №9 «Московский пансион государственных воспитанниц»" },
                    { 30625, 1, "Вечерняя школа №9" },
                    { 49527, 1, "Музыкальная школа №9" },
                    { 36728, 1, "Педагогический колледж №9 «Арбат»" },
                    { 55541, 1, "Колледж автомобильного транспорта (КАТ, бывш. ТК 9, Технологический)" },
                    { 1782158, 1, "Колледж автомобильного транспорта № 9" },
                    { 117242, 1, "Медицинское училище №9 (ММУ 9)" },
                    { 14010, 1, "Школа №10" },
                    { 1727462, 1, "Кадетская школа-интернат №10 «Московский кадетский корпус полиции»" },
                    { 127765, 1, "Школа-интернат №10 для слабослышащих и позднооглохших детей" },
                    { 7368, 1, "Музыкальная школа №10 им. Бетховена" },
                    { 40776, 1, "Лицей №13" },
                    { 5764, 1, "Музыкальная школа №13 им. А. Н. Александрова" },
                    { 46263, 1, "Художественная школа №13" },
                    { 27725, 1, "Педагогический колледж №13" },
                    { 1723240, 1, "Школа искусств №16 им. В. В. Крайнева" },
                    { 1855, 1, "Школа №17" },
                    { 646870, 1, "Школа-интернат №17" },
                    { 41144, 1, "Вечерняя школа №17" },
                    { 19327, 1, "Музыкальная школа №17  им. Л. Н. Оборина" },
                    { 27526, 1, "Колледж архитектуры и менеджмента в строительстве №17 (МКАМС 17)" },
                    { 439877, 1, "Профессионально-техническое училище №17" },
                    { 36615, 1, "Медицинское училище №17 (ММУ 17)" },
                    { 29679, 1, "Школа №18 (французская)" },
                    { 48659, 1, "Специализированный учебно-научный центр МГУ (СУНЦ им. А. Н. Колмогорова) (бывш. ФМШ №18)" },
                    { 102738, 1, "Школа №18" },
                    { 26486, 1, "Вечерняя школа №18" },
                    { 17930, 1, "Музыкальная школа №18" },
                    { 97671, 1, "Колледж ландшафтного дизайна №18" },
                    { 33802, 1, "Педагогический колледж №18 «Митино»" },
                    { 2503, 1, "Учебно-производственный комбинат №18" },
                    { 21456, 1, "Колледж №18" },
                    { 29453, 1, "Школа №19 им. В. Г. Белинского" },
                    { 16484, 1, "Школа-интернат №19" },
                    { 9712, 1, "Вечерняя школа №19" },
                    { 23212, 1, "Музыкальная школа №19 им. Н. П. Ракова" },
                    { 102702, 1, "Политехнический колледж №19" },
                    { 439882, 1, "Техникум №19 (бывш. ПТУ 164)" },
                    { 57174, 1, "Колледж №16 по подготовке социальных работников (бывш. 327)" },
                    { 55089, 1, "Кадетская школа-интернат №8 «Московский кадетский корпус юстиции»" },
                    { 41248, 1, "Педагогический колледж №16" },
                    { 19167, 1, "Музыкальная школа №16 им. Я. В. Флиера" },
                    { 134572, 1, "Политехнический колледж №13" },
                    { 32640, 1, "Педагогический колледж №13 им. С. Я. Маршака" },
                    { 97415, 1, "Медицинское училище №13 (ММУ 13)" },
                    { 1670467, 1, "Школа искусств №13 им. И. Ф. Стравинского" },
                    { 407106, 1, "Учебно-воспитательный комплекс №14" },
                    { 3806, 1, "Школа №14" },
                    { 27077, 1, "Школа-интернат №14" },
                    { 50702, 1, "Первый Московский образовательный комплекс (бывш. ТК 14, ТК 309, ПЛ 320, ПУ 8, ТХР 59)" },
                    { 12993, 1, "Педагогический колледж №14" },
                    { 44491, 1, "Школа искусств №14" },
                    { 7583, 1, "Детская школа искусств им. Ю. С. Саульского (бывш. ДМШ им. Ю. С. Саульского, ДМШ №14)" },
                    { 15609, 1, "Школа №15" },
                    { 465198, 1, "Школа-интернат №15 (немецкий язык)" },
                    { 33840, 1, "Музыкальная школа №15 им. А. К. Лядова" },
                    { 31179, 1, "Педагогический колледж №15" },
                    { 53090, 1, "Колледж предпринимательства №15" },
                    { 360875, 1, "Колледж №15" },
                    { 36906, 1, "Медицинское училище №15 (ММУ 15)" },
                    { 1675537, 1, "Школа искусств №15" },
                    { 1779350, 1, "Школа «ШИК 16»" },
                    { 36328, 1, "Школа №16" },
                    { 21276, 1, "Гимназия №16" },
                    { 21870, 1, "Школа-интернат №16" },
                    { 57452, 1, "Колледж №16" },
                    { 53200, 1, "Медицинское училище №19 (ММУ 19)" },
                    { 10602, 1, "Школа №8" },
                    { 47339, 1, "Педагогический колледж №7 «Маросейка»" },
                    { 44401, 1, "Гимназия №2" },
                    { 53301, 1, "Лицей №2 «Вторая школа»" },
                    { 130860, 1, "Школа-интернат №2" },
                    { 10334, 1, "Музыкальная школа №2 им. И. О. Дунаевского" },
                    { 135030, 1, "Спортивная школа олимпийского резерва №2 (СДЮШОР 2)" },
                    { 7987, 1, "Детская художественная школа им. В. Ф. Стожарова (ДХШ №2)" },
                    { 56757, 1, "Медицинский колледж №2 (ММК 2)" },
                    { 18569, 1, "Юридический колледж (бывш. МКМ 2)" },
                    { 59727, 1, "Медицинский колледж им. Клары Цеткин (бывш. ММУ 2 им. К. Цеткин)" },
                    { 1766545, 1, "Профессионально-техническое училище №2" },
                    { 28453, 1, "Школа №2" },
                    { 97697, 1, "Училище олимпийского резерва №2 (МССУОР 2, бывш. Спортивный интернат 6)" },
                    { 30705, 1, "Школа №3 МКК" },
                    { 6230, 1, "Центр образования «Бескудниковский» — Корпус №3 (бывш. шк. №1121)" },
                    { 2609, 1, "Школа №3" },
                    { 57844, 1, "Гимназия №3" },
                    { 48643, 1, "Лицей №3" },
                    { 43590, 1, "Кадетская школа-интернат «Третий Московский кадетский корпус им. Александра Невского» (3 МКК)" },
                    { 34781, 1, "Вечерняя школа №3" },
                    { 45341, 1, "Музыкальная школа №3" },
                    { 55032, 1, "Художественная школа №3 им. В. А. Ватагина" },
                    { 133595, 1, "Педагогический колледж №3 (бывш. ПУ им. Крупской)" },
                    { 27787, 1, "Школа искусств №2 им. С. И. Мамонтова" },
                    { 57926, 1, "Школа «Эрудит-2»" },
                    { 17915, 1, "Центр образования «Бескудниковский» — Корпус №2 (бывш. шк. №244)" },
                    { 25330, 1, "Политехнический техникум №2 (бывш. Политехнический колледж 2)" },
                    { 416430, 1, "Церковно-приходская школа №1 им. Победоносцева" },
                    { 3717, 1, "Центр образования «Бескудниковский» — Корпус №1 (бывш. шк. №849)" },
                    { 5046, 1, "Школа «Образование плюс - 1»" },
                    { 1763006, 1, "Центр искусств №1 «Артис»" },
                    { 20538, 1, "Гимназия №1" },
                    { 1366, 1, "Гимназия МИИТ (гимн. 1 МПС РФ, шк. 123 МЖД)" },
                    { 52978, 1, "Лицей №1" },
                    { 29117, 1, "Школа-интернат №1 для обучения и реабилитации слепых" },
                    { 37255, 1, "Кадетская школа-интернат №1 «Первый Московский кадетский корпус»" },
                    { 35888, 1, "Музыкальная школа №1 им. С. С. Прокофьева" },
                    { 30900, 1, "Спортивная школа олимпийского резерва №1 (СДЮШОР 1)" },
                    { 7630, 1, "Художественная школа им. В. А. Серова (ДХШ 1)" },
                    { 27921, 1, "Колледж №1" },
                    { 58926, 1, "Педагогический колледж №1 им. К.Д. Ушинского" },
                    { 501086, 1, "Автомобильный колледж (МАК, 1-й Амбулаторный пр.)" },
                    { 54281, 1, "Колледж городской инфраструктуры и строительства №1 (бывш. Строительный колледж 1)" },
                    { 53344, 1, "Медицинский колледж №1 (ММК 1)" },
                    { 146485, 1, "Колледж полиции (бывш. Колледж милиции №1 ГУВД по г. Москве)" },
                    { 41521, 1, "Профессионально-техническое училище №1" },
                    { 54646, 1, "Медицинское училище №1 (ММУ 1)" },
                    { 16220, 1, "Училище олимпийского резерва №1 (МССУОР 1)" },
                    { 37328, 1, "Детская школа искусств №1 им. Н. А. Римского-Корсакова (МГОДШИ «Кусково»)" },
                    { 1733749, 1, "Дорожная техническая школа (МДТШ 2)" },
                    { 115998, 1, "Медицинский колледж №3 (бывш. ММУ 12)" },
                    { 102094, 1, "Колледж сферы услуг №3" },
                    { 33948, 1, "Училище олимпийского резерва №3 (МССУОР 3)" },
                    { 30172, 1, "Медицинское училище №3 (ММУ 3)" },
                    { 37991, 1, "Школа искусств №5" },
                    { 32507, 1, "Школа №6" },
                    { 58151, 1, "Гимназия №6" },
                    { 54428, 1, "Лицей №6" },
                    { 48818, 1, "Кадетская школа-интернат №6 «Московский Георгиевский кадетский корпус» (бывш. шк.-инт. 36)" },
                    { 56071, 1, "Музыкальная школа №6 им. Дж. Гершвина" },
                    { 1672089, 1, "Детско-юношеская спортивная школа №6 им. В. Н. Шадрина" },
                    { 51714, 1, "Художественная школа №6" },
                    { 4653, 1, "Педагогический колледж №6" },
                    { 38970, 1, "Медицинский колледж №6 (бывш. ММУ 22)" },
                    { 43365, 1, "Колледж бизнес-технологий (МКБТ, бывш. Коммерческо-банковский колледж №6, МКБК, Планово-бухгалтерский Мосгорисполкома)" },
                    { 1713229, 1, "Школа искусств №6" },
                    { 899820, 1, "Профессиональное училище №6" },
                    { 27727, 1, "Школа №7 (театральная)" },
                    { 41677, 1, "Школа №7" },
                    { 1759498, 1, "Профессиональное училище №7" },
                    { 30692, 1, "Школа-экстернат №7" },
                    { 54540, 1, "Лицей №7" },
                    { 19740, 1, "Вечерняя школа №7" },
                    { 18572, 1, "Музыкальная школа №7 им. Р. М. Глиэра" },
                    { 97633, 1, "Детско-юношеская спортивная школа №7 «Радуга»" },
                    { 18303, 1, "Художественная школа №7" },
                    { 25405, 1, "Медицинский колледж №7 (ММК 7)" },
                    { 29768, 1, "Медицинское училище №5 (ММУ 5)" },
                    { 7204, 1, "Колледж архитектуры и строительства №7 (бывш. МКАСИ)" },
                    { 13210, 1, "Колледж легкой промышленности №5" },
                    { 41682, 1, "Педагогический колледж №5" },
                    { 49992, 1, "Школа искусств №3 им. Святослава Рихтера" },
                    { 1760467, 1, "Школа «Art4Studio»" },
                    { 54948, 1, "Школа №4" },
                    { 44265, 1, "Гимназия №4" },
                    { 21828, 1, "Учебно-производственный комбинат №4" },
                    { 57831, 1, "Лицей №4" },
                    { 42814, 1, "Музыкальная школа №4" },
                    { 51427, 1, "Детско-юношеская спортивная школа №4" },
                    { 5019, 1, "Художественная школа №4" },
                    { 236022, 1, "Колледж малого бизнеса №4" },
                    { 51609, 1, "Медицинский колледж №4 (бывш. ММУ 18)" },
                    { 45411, 1, "Педагогический колледж №4" },
                    { 14513, 1, "Медицинское училище №4 (ММУ 4)" },
                    { 1672091, 1, "Училище олимпийского резерва №4 им. А. Я. Гомельского (МССУОР 4)" },
                    { 53543, 1, "Школа искусств №4" },
                    { 27045, 1, "Учебно-воспитательный комплекс №5" },
                    { 17666, 1, "Школа №5" },
                    { 24411, 1, "Гимназия №5" },
                    { 132959, 1, "Кадетская школа-интернат №5 «Преображенский кадетский корпус»" },
                    { 313006, 1, "Школа-интернат №5 для слабовидящих детей" },
                    { 24441, 1, "Музыкальная школа №5 им. К. Н. Игумнова" },
                    { 17259, 1, "Художественная школа №5 им. И. Е. Репина" },
                    { 59081, 1, "Медицинский колледж №5 (бывш. ММУ 37)" },
                    { 31487, 1, "Колледж №5" },
                    { 3888, 1, "Школа №20" },
                    { 7651, 1, "Музыкальная школа №20 им. Д. Б. Кабалевского" },
                    { 42106, 1, "Колледж автоматизации и информационных технологий №20" },
                    { 48107, 1, "Школа №46" },
                    { 15652, 1, "Музыкальная школа №46 им. А. И. Хачатуряна" },
                    { 1499, 1, "Детско-юношеская спортивная школа №46" },
                    { 52707, 1, "Строительный колледж №46" },
                    { 10601, 1, "Школа №47" },
                    { 28229, 1, "Музыкальная школа им. Н. П. Осипова (ДМШ 47)" },
                    { 1762019, 1, "Специализированная детско-юношеская школа олимпийского резерва №47" },
                    { 26755, 1, "Политехнический техникум №47 им. В. Г. Федорова (бывш. Политехнический колледж 47)" },
                    { 1712330, 1, "Профессионально-техническое училище №47 (до 1995 г.)" },
                    { 14326, 1, "Школа №48" },
                    { 19838, 1, "Банковский колледж №45" },
                    { 960811, 1, "Школа-интернат №48" },
                    { 5687, 1, "Музыкальная школа №48 им. В. Я. Шебалина" },
                    { 36749, 1, "Колледж малого бизнеса №48" },
                    { 3032, 1, "Школа №49" },
                    { 58777, 1, "Музыкальная школа №49 им. В. В. Андреева" },
                    { 57586, 1, "Детско-юношеская спортивная школа №49" },
                    { 7970, 1, "Спортивная школа олимпийского резерва №49 «Тринта»" },
                    { 7120, 1, "Школа №50" },
                    { 13863, 1, "Музыкальная школа №50 им. А. С. Даргомыжского" },
                    { 651, 1, "Школа №51" },
                    { 53262, 1, "Вечерняя школа №51" },
                    { 19198, 1, "Вечерняя школа №48" },
                    { 33939, 1, "Колледж №45" },
                    { 8407, 1, "Музыкальная школа №45" },
                    { 38222, 1, "Гимназия №45 им. Л. И. Мильграма" },
                    { 51800, 1, "Школа-экстернат №41" },
                    { 168, 1, "Гимназия №41" },
                    { 23317, 1, "Вечерняя школа №41" },
                    { 3592, 1, "Музыкальная школа №41 им. В. С. Калинникова" },
                    { 20825, 1, "Спортивная школа олимпийского резерва №41 «Москворечье» (СДЮШОР 41)" },
                    { 260183, 1, "Колледж градостроительства, транспорта и технологий №41 (бывш. Строительный колледж 41)" },
                    { 323738, 1, "Профессиональное училище №41" },
                    { 903, 1, "Школа №42" },
                    { 16179, 1, "Школа-интернат №42" },
                    { 5038, 1, "Музыкальная школа №42" },
                    { 6653, 1, "Детско-юношеская спортивная школа №42" },
                    { 127663, 1, "Политехнический колледж №42 (бывш. лиц. 319)" },
                    { 801529, 1, "Профессионально-техническое училище №42" },
                    { 34910, 1, "Школа №43" },
                    { 26148, 1, "Лицей №43" },
                    { 13873, 1, "Музыкальная школа №43" },
                    { 38709, 1, "Технологический колледж №43" },
                    { 32532, 1, "Колледж №43" },
                    { 25324, 1, "Школа №44" },
                    { 4858, 1, "Музыкальная школа №44 им. Н. Я. Мясковского" },
                    { 31002, 1, "Детско-юношеская спортивная школа №44" },
                    { 53540, 1, "Колледж сферы услуг №44" },
                    { 24486, 1, "Школа №45" },
                    { 19481, 1, "Музыкальная школа №51 им. Н. С. Голованова" },
                    { 474675, 1, "Специализированная детско-юношеская школа олимпийского резерва №51" },
                    { 696986, 1, "Колледж кондитерских производств №51" },
                    { 23697, 1, "Колледж №51" },
                    { 57746, 1, "Музыкальная школа №57 им. М. Ростроповича" },
                    { 52713, 1, "Технический пожарно-спасательный колледж им. Героя РФ В. М. Максимчука (Пожарный колледж №57)" },
                    { 1269773, 1, "Школа №58 Немецкая специализированная" },
                    { 10014, 1, "Школа №58" },
                    { 679, 1, "Школа-интернат №58" },
                    { 5936, 1, "Музыкальная школа №58 им. М. И. Глинки" },
                    { 130017, 1, "Гуманитарный колледж информационно-библиотечных технологий (бывш. Библиотечный 58) (до 2013 г.)" },
                    { 9437, 1, "Школа №59 им. Н. В. Гоголя" },
                    { 145400, 1, "Школа-интернат №59" },
                    { 1076824, 1, "Детский сад №59" },
                    { 49204, 1, "Учебно-воспитательный комплекс №60" },
                    { 7974, 1, "Школа №60" },
                    { 1734936, 1, "Школа-интернат №60" },
                    { 3687, 1, "Музыкальная школа №60" },
                    { 41658, 1, "Театральный художественно-технический колледж (бывш. ТХТК №60, ТХК)" },
                    { 4639, 1, "Школа №61" },
                    { 294170, 1, "Школа-интернат №61" },
                    { 53449, 1, "Спортивная детско-юношеская школа олимпийского резерва №61" },
                    { 30699, 1, "Колледж музыкально-театрального искусства №61 им. Г. Вишневской (КМТИ)" },
                    { 1699095, 1, "Профессионально-техническое училище №61" },
                    { 10487, 1, "Школа искусств им. Д. С. Бортнянского (бывш. ДМШ 61)" },
                    { 132394, 1, "Школа №62" },
                    { 15689, 1, "Музыкальная школа №62 им. Н. А. Петрова" },
                    { 1771125, 1, "Вечерняя (сменная) школа №57" },
                    { 31503, 1, "Школа №41" },
                    { 1378, 1, "Школа №57" },
                    { 54507, 1, "Полиграфический колледж №56" },
                    { 224978, 1, "Среднее профессионально-техническое училище №51" },
                    { 144569, 1, "Профессиональное училище №51" },
                    { 784, 1, "Школа №52" },
                    { 287230, 1, "Школа-интернат №52" },
                    { 5071, 1, "Музыкальная школа №52 им. Г. В. Свиридова" },
                    { 42078, 1, "Спортивная школа олимпийского резерва №52 (СДЮШОР 52)" },
                    { 52022, 1, "Колледж железнодорожного и городского транспорта (бывш. Железнодорожный колледж 52)" },
                    { 8126, 1, "Школа №53" },
                    { 49403, 1, "Детско-юношеская спортивная школа №53" },
                    { 255732, 1, "Колледж метростроя №53 им. М. Ф. Панова (бывш. ПУ 72)" },
                    { 247451, 1, "Профессиональное училище №53 им. П. М. Вострухина" },
                    { 1754, 1, "Школа №54" },
                    { 49989, 1, "Школа-интернат №54" },
                    { 58325, 1, "Музыкальная школа №54 им. Грига" },
                    { 31200, 1, "Колледж связи №54" },
                    { 4699, 1, "Школа №55" },
                    { 465229, 1, "Школа-интернат №55" },
                    { 38494, 1, "Музыкальная школа №55" },
                    { 51574, 1, "Электромеханический колледж №55 (ЭМК, бывш. ЭМТ)" },
                    { 275, 1, "Школа №56 им. академика В. А. Легасова" },
                    { 100976, 1, "Международная школа-интернат №56 (ММШИ)" },
                    { 46320, 1, "Музыкальная школа им. Б. В. Асафьева (бывш. шк. 56)" },
                    { 362738, 1, "Специализированная детско-юношеская спортивная школа олимпийского резерва №56" },
                    { 18946, 1, "Колледж №56" },
                    { 47295, 1, "Колледж №40" },
                    { 59058, 1, "Колледж малого бизнеса №40" },
                    { 42515, 1, "Музыкальная школа №40 им. Новикова" },
                    { 17795, 1, "Медицинское училище №24 (ММУ 24)" },
                    { 2758, 1, "Школа №25" },
                    { 97683, 1, "Санаторная школа-интернат №25" },
                    { 11050, 1, "Музыкальная школа №25" },
                    { 658124, 1, "Спортивная школа олимпийского резерва №25 (СДЮШОР 25)" },
                    { 26404, 1, "Колледж №25" },
                    { 36446, 1, "Школа-экстернат №26" },
                    { 1865, 1, "Школа №26" },
                    { 40773, 1, "Лицей №26" },
                    { 43832, 1, "Музыкальная школа №26 им. П. И. Юргенсона" },
                    { 97686, 1, "Колледж архитектуры, дизайна и реинжиниринга №26 (бывш. МКГИЭиП, Строительный колледж 26)" },
                    { 1106, 1, "Школа №27" },
                    { 16871, 1, "Музыкальная школа №27 им. С. В. Рахманинова" },
                    { 18455, 1, "Колледж автоматизации и радиоэлектроники №27 (МКАиР 27, бывш. МТАиР)" },
                    { 1075661, 1, "Профессиональное училище №27" },
                    { 1749877, 1, "Школа-интернат №28 V вида" },
                    { 10599, 1, "Школа №28" },
                    { 43261, 1, "Музыкальная школа №28 им. А. Т. Гречанинова" },
                    { 1500, 1, "Детско-юношеская спортивная школа №28" },
                    { 18695, 1, "Технологический колледж №28" },
                    { 1705108, 1, "Профессионально-техническое училище №28" },
                    { 380365, 1, "Медицинское училище №28 (ММУ 28)" },
                    { 6158, 1, "Школа №29" },
                    { 130214, 1, "Колледж легкой промышленности №24" },
                    { 3265, 1, "Специальная (коррекционная) школа-интернат №29" },
                    { 1176236, 1, "Колледж №24" },
                    { 55806, 1, "Детско-юношеская спортивная школа №24" },
                    { 1778582, 1, "Школа 21 (Сбербанк)" },
                    { 40279, 1, "Межшкольный учебный комбинат №21 «Коньково»" },
                    { 4169, 1, "Школа №21" },
                    { 405987, 1, "Спортивная школа олимпийского резерва №21 (СДЮШОР 21)" },
                    { 59393, 1, "Лицей №21" },
                    { 15833, 1, "Музыкальная школа №21 им. Баха" },
                    { 99948, 1, "Технологический колледж №21 (бывш. ПУ 119, ПЛ 345, УВК 128 «Политехнический»)" },
                    { 44713, 1, "Медицинское училище №21 (ММУ 21)" },
                    { 1679431, 1, "Школа №22" },
                    { 36627, 1, "Школа-интернат №22" },
                    { 1659027, 1, "Школа-интернат №22 Детский дом" },
                    { 45228, 1, "Музыкальная школа №22 им. Шапорина" },
                    { 3885, 1, "Детско-юношеская спортивная школа №22" },
                    { 79077, 1, "Колледж сферы услуг №22" },
                    { 1628436, 1, "Экономико-технологический колледж №22" },
                    { 901796, 1, "Профессиональное училище №22" },
                    { 3682, 1, "Школа №23" },
                    { 38062, 1, "Музыкальная школа №23 им. А. Н. Скрябина" },
                    { 59128, 1, "Спортивная школа олимпийского резерва №23 «Олимп Центр»" },
                    { 133196, 1, "Колледж индустрии гостеприимства и менеджмента №23 (КБО 23, лиц. 336)" },
                    { 22271, 1, "Школа №24" },
                    { 294169, 1, "Школа-интернат №24" },
                    { 35331, 1, "Музыкальная школа №24" },
                    { 43510, 1, "Технологический колледж №24" },
                    { 6383, 1, "Школа №63" },
                    { 63454, 1, "Техникум сервиса и туризма №29" },
                    { 57703, 1, "Школа-интернат №30 им. К. А. Микаэльяна" },
                    { 8244, 1, "Школа №36" },
                    { 97419, 1, "Вечерняя (сменная) школа №36" },
                    { 5120, 1, "Музыкальная школа №36 им. В. В. Стасова" },
                    { 23396, 1, "Колледж декоративно-прикладного искусства им. К. Фаберже (№36)" },
                    { 1777395, 1, "Детский сад №36" },
                    { 3428, 1, "Школа №37" },
                    { 49704, 1, "Музыкальная школа №37" },
                    { 1043588, 1, "Детско-юношеская спортивная школа №37" },
                    { 1636814, 1, "Профессионально-техническое училище №37" },
                    { 5312, 1, "Школа №38" },
                    { 2464, 1, "Школа-интернат №38" },
                    { 31407, 1, "Музыкальная школа №38 им. Э. Г. Гилельса" },
                    { 260179, 1, "Строительный колледж №38" },
                    { 24642, 1, "Колледж №38" },
                    { 1791, 1, "Школа №39" },
                    { 52608, 1, "Лицей №39" },
                    { 32375, 1, "Колледж №39" },
                    { 54756, 1, "Политехнический колледж №39" },
                    { 23018, 1, "Педагогический колледж №39" },
                    { 29425, 1, "Школа искусств им. М. А. Балакирева (бывш. ДМШ 39)" },
                    { 1606, 1, "Школа №40" },
                    { 1677499, 1, "Школа-интернат №40" },
                    { 254950, 1, "Вечерняя школа №40" },
                    { 1270322, 1, "Детский сад №35" },
                    { 8198, 1, "Школа №30" },
                    { 7611, 1, "Колледж №35" },
                    { 287205, 1, "Детско-юношеская спортивная школа №35" },
                    { 48595, 1, "Музыкальная школа №30 им. Н. А. Алексеева" },
                    { 260193, 1, "Строительный колледж №30" },
                    { 45674, 1, "Медицинское училище №30 (ММУ 30)" },
                    { 5396, 1, "Школа №31" },
                    { 406409, 1, "Школа-интернат №31" },
                    { 54569, 1, "Музыкальная школа №31 им. Ипполитова-Иванова" },
                    { 53982, 1, "Специализированная детско-юношеская школа олимпийского резерва №31 «Черёмушки»" },
                    { 37115, 1, "Политехнический колледж №31" },
                    { 322440, 1, "Школа №32 (французская)" },
                    { 627296, 1, "Лицей №32" },
                    { 749435, 1, "Санаторная школа-интернат №32" },
                    { 10088, 1, "Музыкальная школа №32 им. А. С. Аренского" },
                    { 47367, 1, "Колледж сферы услуг №32" },
                    { 429307, 1, "Техникум №32" },
                    { 173207, 1, "Школа №33 (закрыта)" },
                    { 59470, 1, "Музыкальная школа №33 им. Глазунова" },
                    { 5051, 1, "Специализированная детско-юношеская школа олимпийского резерва №33" },
                    { 133425, 1, "Пищевой колледж №33 (МПК)" },
                    { 6184, 1, "Гимназия №34 (бывш. шк. 34)" },
                    { 22703, 1, "Музыкальная школа №34 им. Г. Г. Нейгауза" },
                    { 57279, 1, "Технологический колледж №34 (ПУ 111)" },
                    { 49920, 1, "Школа №35" },
                    { 26302, 1, "Музыкальная школа №35" },
                    { 27958, 1, "Финансовый колледж №35" },
                    { 32760, 1, "Школа №334" },
                    { 735588, 1, "Профессиональный лицей экономики и управления №334" },
                    { 40074, 1, "Школа №335" },
                    { 49230, 1, "Детско-юношеская спортивная школа №903" },
                    { 2577, 1, "Школа №904" },
                    { 8177, 1, "Школа №905" },
                    { 273, 1, "Школа №906" },
                    { 6834, 1, "Школа №907" },
                    { 244116, 1, "Школа №908" },
                    { 8436, 1, "Школа №910" },
                    { 3507, 1, "Школа №911" },
                    { 11575, 1, "Школа №912" },
                    { 7047, 1, "Школа №913" },
                    { 5276, 1, "Школа №902" },
                    { 2790, 1, "Школа №914" },
                    { 4149, 1, "Школа №916" },
                    { 5165, 1, "Школа №917" },
                    { 15683, 1, "Школа №918" },
                    { 21487, 1, "Школа №919" },
                    { 3562, 1, "Школа №920" },
                    { 4054, 1, "Школа №921" },
                    { 2703, 1, "Школа №922" },
                    { 25027, 1, "Школа №923" },
                    { 1719845, 1, "Детский сад №923" },
                    { 4641, 1, "Школа №924" },
                    { 14564, 1, "Школа №915" },
                    { 21081, 1, "Школа №901" },
                    { 16350, 1, "Школа №899" },
                    { 4902, 1, "Школа №898" },
                    { 1299, 1, "Школа №875" },
                    { 3166, 1, "Школа №876" },
                    { 4388, 1, "Школа №877" },
                    { 5669, 1, "Школа №878" },
                    { 4431, 1, "Школа №879" },
                    { 1675711, 1, "Детский сад №879" },
                    { 8808, 1, "Школа №880" },
                    { 9524, 1, "Школа №881" },
                    { 3496, 1, "Школа №882" },
                    { 855857, 1, "Детский сад №882" },
                    { 2271, 1, "Школа №883" },
                    { 128647, 1, "Школа №884" },
                    { 13644, 1, "Школа №885" },
                    { 8115, 1, "Школа №886" },
                    { 1843, 1, "Школа №887" },
                    { 2731, 1, "Школа №888" },
                    { 4006, 1, "Школа №891" },
                    { 5570, 1, "Школа №892" },
                    { 5630, 1, "Школа №893" },
                    { 1652664, 1, "Школа №894" },
                    { 12405, 1, "Детско-юношеская спортивная школа №894" },
                    { 254974, 1, "Школа №895" },
                    { 518, 1, "Школа №896" },
                    { 5864, 1, "Школа №925" },
                    { 4296, 1, "Школа №926" },
                    { 9214, 1, "Школа №927" },
                    { 2473, 1, "Школа №928" },
                    { 30798, 1, "Школа №955" },
                    { 4252, 1, "Школа №956" },
                    { 1660830, 1, "Школа №957" },
                    { 9345, 1, "Школа №958" },
                    { 1718, 1, "Школа №959" },
                    { 7969, 1, "Школа №960" },
                    { 3129, 1, "Школа №961" },
                    { 859, 1, "Школа №962" },
                    { 5491, 1, "Школа №963" },
                    { 4011, 1, "Школа №964" },
                    { 2156, 1, "Школа №966" },
                    { 4658, 1, "Школа №967" },
                    { 3278, 1, "Школа №968" },
                    { 13906, 1, "Школа №969" },
                    { 3825, 1, "Школа №970" },
                    { 3228, 1, "Школа №971" },
                    { 36941, 1, "Школа №973" },
                    { 8110, 1, "Школа №975" },
                    { 3573, 1, "Школа №978" },
                    { 20452, 1, "Школа «Рацон Латет» на базе шк. 978" },
                    { 5953, 1, "Школа №979" },
                    { 3606, 1, "Школа №980" },
                    { 1819, 1, "Школа №981" },
                    { 3872, 1, "Школа №954" },
                    { 2745, 1, "Школа №874" },
                    { 1191, 1, "Школа №953" },
                    { 5070, 1, "Школа №951" },
                    { 8288, 1, "Школа №929" },
                    { 2442, 1, "Школа №930" },
                    { 7732, 1, "Школа №931" },
                    { 2467, 1, "Школа №932" },
                    { 3903, 1, "Школа №933" },
                    { 10834, 1, "Школа №934" },
                    { 27638, 1, "Школа №935" },
                    { 3535, 1, "Школа №936" },
                    { 5588, 1, "Школа №937 им. Героя Российской Федерации А. В. Перова" },
                    { 53906, 1, "Школа №938" },
                    { 3470, 1, "Гимназия №938" },
                    { 4247, 1, "Школа №939" },
                    { 3244, 1, "Школа №940" },
                    { 3044, 1, "Школа №941" },
                    { 4845, 1, "Школа №942" },
                    { 9253, 1, "Школа №943" },
                    { 14566, 1, "Школа №944" },
                    { 6636, 1, "Школа №945" },
                    { 4227, 1, "Школа №946" },
                    { 2778, 1, "Школа №947" },
                    { 15806, 1, "Школа №948" },
                    { 2623, 1, "Школа №949" },
                    { 3197, 1, "Школа №950" },
                    { 9940, 1, "Школа №952" },
                    { 830, 1, "Школа №982" },
                    { 8711, 1, "Школа №873" },
                    { 9149, 1, "Школа №870" },
                    { 7741, 1, "Школа №788" },
                    { 2398, 1, "Школа №789" },
                    { 5768, 1, "Школа №790" },
                    { 4628, 1, "Школа №791" },
                    { 32402, 1, "Школа №793" },
                    { 21862, 1, "Гимназия №793" },
                    { 2648, 1, "Школа №794" },
                    { 10512, 1, "Школа №795" },
                    { 5865, 1, "Школа №796" },
                    { 6667, 1, "Школа №797" },
                    { 699466, 1, "Детский сад №787" },
                    { 3538, 1, "Школа №798" },
                    { 2340, 1, "Гимназия №799" },
                    { 15562, 1, "Школа №800" },
                    { 455036, 1, "Детский сад №800" },
                    { 295908, 1, "Школа №801" },
                    { 1165, 1, "Детско-юношеская спортивная школа №801" },
                    { 59181, 1, "Школа №802" },
                    { 57575, 1, "Специальная (коррекционная) школа VIII вида №804" },
                    { 4973, 1, "Школа №806" },
                    { 4241, 1, "Школа №807" },
                    { 9392, 1, "Школа №808" },
                    { 1321327, 1, "Школа №799" },
                    { 58659, 1, "Школа №787" },
                    { 3900, 1, "Школа №786" },
                    { 7097, 1, "Школа №785" },
                    { 1326, 1, "Школа №763" },
                    { 3439, 1, "Школа №764" },
                    { 8041, 1, "Школа №765" },
                    { 16848, 1, "Школа №766" },
                    { 1614, 1, "Школа №767" },
                    { 504355, 1, "Школа №768" },
                    { 3594, 1, "Школа №769" },
                    { 56483, 1, "Олимпийский учебно-спортивный центр «Пла́нерная»" },
                    { 3142, 1, "Школа №770" },
                    { 15832, 1, "Школа №771" },
                    { 244230, 1, "Школа №772" },
                    { 2543, 1, "Школа №773" },
                    { 53266, 1, "Школа №774" },
                    { 5989, 1, "Школа №775" },
                    { 2908, 1, "Школа №776" },
                    { 2954, 1, "Школа №777" },
                    { 8528, 1, "Школа №778" },
                    { 4821, 1, "Школа №779" },
                    { 2699, 1, "Школа №780" },
                    { 4901, 1, "Школа №781" },
                    { 2127, 1, "Школа №782" },
                    { 13295, 1, "Школа №783" },
                    { 45193, 1, "Школа №784" },
                    { 16447, 1, "Школа №809" },
                    { 14454, 1, "Школа №810" },
                    { 5076, 1, "Школа №811" },
                    { 3649, 1, "Школа №812" },
                    { 5270, 1, "Школа №840" },
                    { 2395, 1, "Школа №841" },
                    { 3048, 1, "Школа №843" },
                    { 20705, 1, "Школа №844" },
                    { 6790, 1, "Школа №846" },
                    { 5598, 1, "Школа №847" },
                    { 3177, 1, "Школа №848" },
                    { 4568, 1, "Школа №850" },
                    { 62472, 1, "Школа №851" },
                    { 4127, 1, "Школа №855" },
                    { 3863, 1, "Школа №856" },
                    { 4593, 1, "Школа №858" },
                    { 20137, 1, "Школа №860" },
                    { 7796, 1, "Школа №861" },
                    { 3866, 1, "Школа №862" },
                    { 9382, 1, "Школа №863" },
                    { 4244, 1, "Школа №864" },
                    { 4513, 1, "Школа №865" },
                    { 5163, 1, "Школа №866" },
                    { 1688, 1, "Школа №867" },
                    { 11481, 1, "Школа №868" },
                    { 789304, 1, "Детский сад №868" },
                    { 801491, 1, "Школа №869" },
                    { 3837, 1, "Школа №839" },
                    { 16266, 1, "Школа №871" },
                    { 3987, 1, "Школа №838" },
                    { 4175, 1, "Школа №836" },
                    { 9180, 1, "Школа №813" },
                    { 4072, 1, "Школа №814" },
                    { 3243, 1, "Школа №815" },
                    { 3364, 1, "Школа №816" },
                    { 8899, 1, "Школа №817" },
                    { 1007, 1, "Школа №818" },
                    { 5017, 1, "Школа №819" },
                    { 1031, 1, "Школа №820" },
                    { 8409, 1, "Школа №821" },
                    { 114136, 1, "Школа №822" },
                    { 9389, 1, "Школа №823" },
                    { 1008, 1, "Школа №824" },
                    { 4504, 1, "Школа №825" },
                    { 8200, 1, "Школа №826" },
                    { 709, 1, "Школа №827" },
                    { 497, 1, "Школа №828" },
                    { 2920, 1, "Школа №829" },
                    { 28397, 1, "Школа №830" },
                    { 172452, 1, "Школа №831" },
                    { 5456, 1, "Школа №832" },
                    { 6403, 1, "Школа №833" },
                    { 1744708, 1, "Специальная (коррекционная) школа VIII вида №834" },
                    { 13556, 1, "Школа №835" },
                    { 52995, 1, "Школа №837" },
                    { 4061, 1, "Школа №983" },
                    { 51799, 1, "Музыкальная школа №983" },
                    { 3502, 1, "Гимназия №985" },
                    { 56947, 1, "Школа №1140" },
                    { 9501, 1, "Школа №1141" },
                    { 2718, 1, "Школа №1142" },
                    { 3384, 1, "Школа №1143" },
                    { 16211, 1, "Лицей №1144" },
                    { 9059, 1, "Школа №1145" },
                    { 10362, 1, "Школа №1146" }
                });

            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 1711, 1, "Школа №1147" },
                    { 2293, 1, "Школа №1148 им. Ф. М. Достоевского" },
                    { 33655, 1, "Школа №1149" },
                    { 17824, 1, "Школа №1139" },
                    { 11829, 1, "Школа №1155" },
                    { 44644, 1, "Школа №1157" },
                    { 2624, 1, "Школа №1158" },
                    { 10330, 1, "Школа №1159" },
                    { 14728, 1, "Школа №1160" },
                    { 13689, 1, "Школа №1161" },
                    { 9398, 1, "Школа №1162" },
                    { 3655, 1, "Школа №1163" },
                    { 3643, 1, "Школа №1164" },
                    { 2157, 1, "Школа №1166" },
                    { 3639, 1, "Школа №1167" },
                    { 10927, 1, "Школа №1156" },
                    { 7384, 1, "Школа №1138" },
                    { 3218, 1, "Школа №1137" },
                    { 2526, 1, "Школа №1136" },
                    { 1716669, 1, "Школа №1111" },
                    { 9506, 1, "Школа №1112" },
                    { 5397, 1, "Школа №1113" },
                    { 17400, 1, "Школа №1114" },
                    { 2569, 1, "Школа №1115" },
                    { 2823, 1, "Школа №1117" },
                    { 4112, 1, "Школа №1118" },
                    { 1151, 1, "Школа №1119" },
                    { 29237, 1, "Школа №1120" },
                    { 16833, 1, "Школа №1122" },
                    { 134748, 1, "Школа №1123" },
                    { 5223, 1, "Гимназия №1123" },
                    { 3764, 1, "Школа №1124" },
                    { 23255, 1, "Школа №1125 им. Я. Н. Федоренко" },
                    { 40863, 1, "Школа №1126" },
                    { 17104, 1, "Школа №1127" },
                    { 4380, 1, "Школа №1128" },
                    { 2524, 1, "Школа №1129" },
                    { 929, 1, "Школа №1130 (ЦО 1130)" },
                    { 1802, 1, "Школа №1131" },
                    { 4477, 1, "Школа №1132" },
                    { 5420, 1, "Школа №1133 (экспериментальная)" },
                    { 3522, 1, "Школа №1134" },
                    { 1679234, 1, "Детский сад №1167" },
                    { 9305, 1, "Школа №1168" },
                    { 10600, 1, "Школа №1169" },
                    { 6637, 1, "Школа №1171" },
                    { 1241, 1, "Школа №1207" },
                    { 3095, 1, "Школа №1208" },
                    { 3693, 1, "Школа №1210" },
                    { 15727, 1, "Школа №1211" },
                    { 1071, 1, "Школа №1212" },
                    { 4587, 1, "Школа №1213" },
                    { 1527, 1, "Школа №1214" },
                    { 9093, 1, "Школа №1215" },
                    { 4860, 1, "Школа №1216" },
                    { 2839, 1, "Школа №1218" },
                    { 3869, 1, "Школа №1219" },
                    { 6815, 1, "Школа №1220" },
                    { 10104, 1, "Школа №1221" },
                    { 59449, 1, "Школа №1222" },
                    { 12049, 1, "Гимназия №1223" },
                    { 5025, 1, "Школа №1224" },
                    { 3083, 1, "Школа №1225" },
                    { 2588, 1, "Школа №1226" },
                    { 1576, 1, "Школа №1227" },
                    { 7069, 1, "Школа №1228" },
                    { 14622, 1, "Школа №1229" },
                    { 2230, 1, "Школа №1230" },
                    { 338, 1, "Школа №1231" },
                    { 2953, 1, "Школа №1206" },
                    { 32261, 1, "Школа №1110" },
                    { 525349, 1, "Детский сад №1205" },
                    { 6967, 1, "Школа №1204" },
                    { 1092, 1, "Школа №1173 (бывш. шк. 857)" },
                    { 3078, 1, "Школа №1174" },
                    { 1402338, 1, "Школа №1175" },
                    { 29374, 1, "Детско-юношеская спортивная школа №1175" },
                    { 3489, 1, "Школа №1178" },
                    { 1243, 1, "Школа №1179" },
                    { 1388, 1, "Школа №1180" },
                    { 1725337, 1, "Школа №1181" },
                    { 1534, 1, "Школа №1184" },
                    { 31462, 1, "Школа №1186" },
                    { 10569, 1, "Школа №1188 с углублённым изучением ИЗО" },
                    { 589, 1, "Курчатовская школа (Шк. №1189 им. И. В. Курчатова)" },
                    { 6927, 1, "Школа №1190" },
                    { 8642, 1, "Школа №1191" },
                    { 20801, 1, "Школа №1192" },
                    { 1705, 1, "Школа №1195" },
                    { 36511, 1, "Школа №1197" },
                    { 11581, 1, "Школа №1198" },
                    { 1678, 1, "Школа №1199" },
                    { 1372, 1, "Школа №1200 (+ Школа №1351)" },
                    { 26879, 1, "Школа №1201" },
                    { 9436, 1, "Школа №1202" },
                    { 3082, 1, "Школа №1203" },
                    { 5983, 1, "Школа №1205" },
                    { 36783, 1, "Школа №1109" },
                    { 2111, 1, "Школа №1108" },
                    { 1395, 1, "Школа №1107" },
                    { 58677, 1, "Школа №1015" },
                    { 1637, 1, "Школа №1016" },
                    { 13880, 1, "Школа №1017" },
                    { 822, 1, "Школа №1018" },
                    { 2925, 1, "Школа №1019" },
                    { 5232, 1, "Школа №1020" },
                    { 18373, 1, "Школа №1021" },
                    { 7874, 1, "Школа №1022" },
                    { 465208, 1, "Школа №1023" },
                    { 1101, 1, "Школа №1024" },
                    { 8568, 1, "Школа №1025" },
                    { 5512, 1, "Школа №1026" },
                    { 63918, 1, "Школа №1028" },
                    { 5095, 1, "Школа №1029" },
                    { 483512, 1, "Детский сад №1031" },
                    { 1799, 1, "Школа №1032" },
                    { 43655, 1, "Школа №1033" },
                    { 7582, 1, "Школа №1034" },
                    { 24551, 1, "Школа №1035" },
                    { 17855, 1, "Школа №1036" },
                    { 720, 1, "Школа №1037" },
                    { 56226, 1, "Школа №1038" },
                    { 2863, 1, "Школа №1039" },
                    { 4097, 1, "Школа №1014" },
                    { 1632, 1, "Школа №1040" },
                    { 3809, 1, "Школа №1013" },
                    { 12994, 1, "Школа №1010" },
                    { 19968, 1, "Школа №986" },
                    { 9246, 1, "Школа №987" },
                    { 55349, 1, "Школа №990" },
                    { 1677486, 1, "Школа №991 (коррекционная)" },
                    { 34784, 1, "Школа №992" },
                    { 6272, 1, "Школа №993" },
                    { 4042, 1, "Школа №994" },
                    { 1850, 1, "Школа №995" },
                    { 2838, 1, "Школа №996" },
                    { 6046, 1, "Школа №997" },
                    { 22637, 1, "Школа №998" },
                    { 4248, 1, "Школа №999" },
                    { 5991, 1, "Школа №1000" },
                    { 3758, 1, "Школа №1001" },
                    { 13410, 1, "Школа №1002" },
                    { 1440, 1, "Школа №1003" },
                    { 4874, 1, "Школа №1004" },
                    { 33551, 1, "Школа №1005" },
                    { 1317, 1, "Школа №1006" },
                    { 960821, 1, "Детский сад №1006" },
                    { 4299, 1, "Школа №1007" },
                    { 13758, 1, "Школа №1008" },
                    { 1947, 1, "Школа №1009" },
                    { 1492, 1, "Школа №1011" },
                    { 20562, 1, "Школа №762" },
                    { 2935, 1, "Школа №1041" },
                    { 7284, 1, "Школа №1043" },
                    { 2837, 1, "Школа №1078" },
                    { 7824, 1, "Школа №1080" },
                    { 28656, 1, "Школа №1082" },
                    { 3076, 1, "Школа №1084" },
                    { 8437, 1, "Школа №1085" },
                    { 1872, 1, "Школа №1086" },
                    { 485245, 1, "Школа №1087" },
                    { 53957, 1, "Школа №1088" },
                    { 3474, 1, "Школа №1089" },
                    { 5564, 1, "Школа №1090" },
                    { 17175, 1, "Школа №1094" },
                    { 821, 1, "Школа №1095" },
                    { 1726, 1, "Школа №1096" },
                    { 719, 1, "Школа №1097" },
                    { 5679, 1, "Школа №1098" },
                    { 1337, 1, "Школа №1099" },
                    { 963, 1, "Школа №1100" },
                    { 3405, 1, "Школа №1101" },
                    { 4819, 1, "Школа №1102" },
                    { 18950, 1, "Школа №1103 им. А. В. Соломатина" },
                    { 48753, 1, "Школа №1104" },
                    { 3799, 1, "Школа №1105" },
                    { 1772, 1, "Школа №1106" },
                    { 10831, 1, "Школа №1077" },
                    { 33943, 1, "Школа №1042" },
                    { 3902, 1, "Школа №1076" },
                    { 2631, 1, "Школа №1073" },
                    { 4834, 1, "Школа №1044" },
                    { 56682, 1, "Школа №1046" },
                    { 2452, 1, "Школа №1047" },
                    { 21848, 1, "Школа №1049" },
                    { 18511, 1, "Детско-юношеская спортивная школа №1049" },
                    { 43628, 1, "Школа №1050" },
                    { 6740, 1, "Школа №1051" },
                    { 5489, 1, "Школа №1054" },
                    { 1104, 1, "Школа №1055" },
                    { 5432, 1, "Школа №1056" },
                    { 15825, 1, "Школа №1057" },
                    { 4286, 1, "Школа №1058" },
                    { 23611, 1, "Школа №1059" },
                    { 10357, 1, "Школа №1060" },
                    { 3587, 1, "Школа №1061" },
                    { 10517, 1, "Школа №1062" },
                    { 9329, 1, "Школа №1064" },
                    { 5078, 1, "Школа №1065" },
                    { 7241, 1, "Школа №1066" },
                    { 2904, 1, "Школа №1067" },
                    { 12351, 1, "Школа №1068" },
                    { 4170, 1, "Школа №1069" },
                    { 2351, 1, "Школа №1071" },
                    { 2145, 1, "Школа №1075" },
                    { 2033, 1, "Школа №761" },
                    { 1324, 1, "Школа №760 им. А. П. Маресьева" },
                    { 7815, 1, "Школа №759" },
                    { 9478, 1, "Школа №461" },
                    { 17483, 1, "Школа №462" },
                    { 1132, 1, "Школа №463" },
                    { 12359, 1, "Школа №464" },
                    { 2769, 1, "Школа №465" },
                    { 6543, 1, "Школа №466" },
                    { 2228, 1, "Школа №467" },
                    { 6542, 1, "Школа №468" },
                    { 6226, 1, "Школа №469" },
                    { 1662, 1, "Школа №470 им. Надежды Рушевой" },
                    { 2476, 1, "Школа №460" },
                    { 3469, 1, "Школа №471" },
                    { 9725, 1, "Школа №473" },
                    { 819334, 1, "Школа №474" },
                    { 11438, 1, "Школа №475" },
                    { 22624, 1, "Школа №476" },
                    { 22331, 1, "Школа №477" },
                    { 16680, 1, "Школа №478" },
                    { 3434, 1, "Школа №479 им. Маршала В. И. Чуйкова" },
                    { 10535, 1, "Школа №480" },
                    { 17422, 1, "Школа №481" },
                    { 189093, 1, "Школа №482" },
                    { 10120, 1, "Школа №472" },
                    { 12329, 1, "Школа №459" },
                    { 19104, 1, "Школа №458" },
                    { 3760, 1, "Школа №457" },
                    { 21340, 1, "Школа №435" },
                    { 4931, 1, "Школа №436" },
                    { 1703, 1, "Школа №437" },
                    { 9362, 1, "Школа №438" },
                    { 50267, 1, "Школа №439" },
                    { 5015, 1, "Школа №440" },
                    { 31354, 1, "Школа №441" },
                    { 1341715, 1, "Школа №442" },
                    { 7966, 1, "Школа №443" },
                    { 711, 1, "Школа №444" },
                    { 1350, 1, "Школа №445" },
                    { 18301, 1, "Школа №446" },
                    { 1702030, 1, "Детский сад №446" },
                    { 560690, 1, "Школа №447" },
                    { 26732, 1, "Школа №448" },
                    { 4734, 1, "Школа №449" },
                    { 9694, 1, "Школа №450" },
                    { 5341, 1, "Школа №451" },
                    { 31631, 1, "Школа №452" },
                    { 16760, 1, "Школа №453" },
                    { 34882, 1, "Школа №454" },
                    { 1775965, 1, "Школа №455" },
                    { 8988, 1, "Школа №456" },
                    { 386098, 1, "Школа №483 (общеобразовательная)" },
                    { 76117, 1, "Школа №483 (для лиц с нарушенями слуха)" },
                    { 55650, 1, "Лицей №483 (автомобилестроения)" },
                    { 12554, 1, "Школа №484" },
                    { 4192, 1, "Школа №513" },
                    { 8426, 1, "Школа №514" },
                    { 7822, 1, "Школа №515" },
                    { 8910, 1, "Школа №516" },
                    { 4084, 1, "Школа №517" },
                    { 5873, 1, "Школа №518" },
                    { 15700, 1, "Школа «Спектр» (бывш. шк. 519)" },
                    { 1682, 1, "Школа №520" },
                    { 3401, 1, "Школа №521" },
                    { 14835, 1, "Школа №522" },
                    { 5231, 1, "Школа №523" },
                    { 18606, 1, "Школа №524" },
                    { 3898, 1, "Школа №525" },
                    { 360986, 1, "Школа №526" },
                    { 7726, 1, "Школа №527" },
                    { 8397, 1, "Школа №528" },
                    { 2509, 1, "Школа №529" },
                    { 1668255, 1, "Детский сад №529" },
                    { 1432, 1, "Школа №531" },
                    { 815146, 1, "Школа №532" },
                    { 5475, 1, "Школа №533" },
                    { 6067, 1, "Школа №534" },
                    { 17959, 1, "Школа №535" },
                    { 16415, 1, "Школа №512" },
                    { 4202, 1, "Школа №434" },
                    { 1857, 1, "Школа №511" },
                    { 4606, 1, "Школа №509" },
                    { 2561, 1, "Школа №485" },
                    { 17521, 1, "Школа №487" },
                    { 681, 1, "Школа №488" },
                    { 1511, 1, "Школа №489" },
                    { 2209, 1, "Школа №490" },
                    { 4496, 1, "Гимназия №491 «Марьино» (бывш. шк. 491, ЦО 491)" },
                    { 1315, 1, "Школа №492" },
                    { 25830, 1, "Школа №493" },
                    { 7915, 1, "Школа №494" },
                    { 9873, 1, "Школа №495" },
                    { 9575, 1, "Школа №496" },
                    { 70107, 1, "Центр образования №497" },
                    { 12324, 1, "Школа №498" },
                    { 7840, 1, "Школа №500" },
                    { 10211, 1, "Школа №501" },
                    { 26773, 1, "Школа №502" },
                    { 5680, 1, "Школа №503" },
                    { 23845, 1, "Школа №504" },
                    { 1761782, 1, "Лицей №504" },
                    { 3904, 1, "Школа №505" },
                    { 5889, 1, "Школа №506" },
                    { 5855, 1, "Лицей №507" },
                    { 6141, 1, "Школа №508" },
                    { 3468, 1, "Школа №510" },
                    { 3465, 1, "Школа №433" },
                    { 501854, 1, "Школа №432" },
                    { 11235, 1, "Школа №431" },
                    { 8187, 1, "Школа №355" },
                    { 17714, 1, "Школа №356" },
                    { 44810, 1, "Школа современных танцев «Лаборатория современных танцевальных искусств Model-357»" },
                    { 8475, 1, "Школа №357" },
                    { 9658, 1, "Школа №358" },
                    { 672366, 1, "Школа №359" },
                    { 13408, 1, "Школа №360" },
                    { 8851, 1, "Школа №361" },
                    { 28012, 1, "Школа №362" },
                    { 3006, 1, "Школа №363" },
                    { 8930, 1, "Школа №364" },
                    { 9330, 1, "Школа №365" },
                    { 439866, 1, "Школа №366" },
                    { 406005, 1, "Школа №367" },
                    { 48781, 1, "Школа №368" },
                    { 3133, 1, "Музыкальная школа №368" },
                    { 25759, 1, "Школа №369" },
                    { 902488, 1, "Школа №370" },
                    { 425856, 1, "Школа №371" },
                    { 56169, 1, "Школа №372" },
                    { 4182, 1, "Школа №373" },
                    { 16793, 1, "Школа №374" },
                    { 8513, 1, "Школа №375" },
                    { 12517, 1, "Школа №354 им. Д. М. Карбышева" },
                    { 1057, 1, "Школа №376" },
                    { 2364, 1, "Школа №353 им. А. С. Пушкина" },
                    { 1661173, 1, "Детский сад №351" },
                    { 15387, 1, "Профессиональный автомобильный лицей №335" },
                    { 22523, 1, "Школа №336" },
                    { 705420, 1, "Профессиональный лицей промышленного менеджмента №336" },
                    { 465182, 1, "Школа №337" },
                    { 9335, 1, "Государственной службы колледж №337" },
                    { 4745, 1, "Школа №338" },
                    { 54783, 1, "Лицей №338" },
                    { 15513, 1, "Школа №339" },
                    { 1043587, 1, "Профессиональный экономико-технологический лицей №339" },
                    { 335336, 1, "Лицей №340" },
                    { 335337, 1, "Профессиональный лицей №340" },
                    { 1503, 1, "Школа №341 (ныне шк. 1010)" },
                    { 32452, 1, "Профессиональный лицей моды №341" },
                    { 15653, 1, "Школа №343" },
                    { 242104, 1, "Лицей №343" },
                    { 15886, 1, "Школа №344" },
                    { 1925, 1, "Школа №345" },
                    { 16537, 1, "Учебно-воспитательный комплекс №345 (сад-школа)" },
                    { 2629, 1, "Школа №346" },
                    { 1779054, 1, "Школа №347" },
                    { 9316, 1, "Школа №349" },
                    { 1906, 1, "Школа №350" },
                    { 4353, 1, "Школа №351" },
                    { 1374, 1, "Школа №352" },
                    { 5633, 1, "Школа №536" },
                    { 11662, 1, "Школа №377" },
                    { 28736, 1, "Школа №379" },
                    { 3710, 1, "Школа №407" },
                    { 3464, 1, "Школа №408" },
                    { 10105, 1, "Школа №409" },
                    { 13980, 1, "Школа №410" },
                    { 1343, 1, "Школа №411" },
                    { 8861, 1, "Школа №412" },
                    { 4613, 1, "Школа №414" },
                    { 13454, 1, "Школа №415" },
                    { 9650, 1, "Школа №416" },
                    { 8350, 1, "Школа №417" },
                    { 42322, 1, "Школа №418" },
                    { 3631, 1, "Гимназия №419" },
                    { 5534, 1, "Школа №420" },
                    { 25329, 1, "Школа №421" },
                    { 12965, 1, "Школа №422" },
                    { 53002, 1, "Школа №423" },
                    { 2173, 1, "Школа №424" },
                    { 4165, 1, "Школа №425" },
                    { 18776, 1, "Школа №426" },
                    { 997, 1, "Школа №427" },
                    { 1688020, 1, "Детский сад №427" },
                    { 6957, 1, "Школа №428" },
                    { 4039, 1, "Лицей №429 «Соколиная гора»" },
                    { 7261, 1, "Школа №405" },
                    { 6827, 1, "Школа №378" },
                    { 36741, 1, "Школа №404" },
                    { 1776529, 1, "Гимназия №402 им. Алии Молдагуловой – Школьное отделение №1" },
                    { 26676, 1, "Школа №380" },
                    { 43135, 1, "Школа №381" },
                    { 7245, 1, "Школа №382" },
                    { 24715, 1, "Школа №383" },
                    { 22778, 1, "Школа №384" },
                    { 1064676, 1, "Школа №385" },
                    { 24610, 1, "Школа №386" },
                    { 11059, 1, "Детско-юношеская спортивная школа №387" },
                    { 26393, 1, "Школа №388" },
                    { 4376, 1, "Школа №390" },
                    { 20552, 1, "Школа №391" },
                    { 22479, 1, "Школа №392" },
                    { 677, 1, "Школа №393" },
                    { 13021, 1, "Школа №394" },
                    { 7417, 1, "Школа №395" },
                    { 7060, 1, "Школа №396" },
                    { 1721, 1, "Школа №397" },
                    { 171, 1, "Школа №398" },
                    { 18580, 1, "Школа №399" },
                    { 2339, 1, "Школа №400" },
                    { 3113, 1, "Школа №401" },
                    { 1547, 1, "Школа №402" },
                    { 1776528, 1, "Гимназия №402 им. Алии Молдагуловой – Школьное отделение №2" },
                    { 4053, 1, "Школа №403" },
                    { 1778741, 1, "Языковая школа Bene-Dictus" },
                    { 7181, 1, "Школа №537" },
                    { 4038, 1, "Школа №539" },
                    { 1827, 1, "Школа №680" },
                    { 13955, 1, "Школа №681" },
                    { 4264, 1, "Школа №682" },
                    { 5766, 1, "Школа №683" },
                    { 3642, 1, "Школа №684" },
                    { 24511, 1, "Школа №685" },
                    { 43288, 1, "Центр образования №686 «Класс- Центр»" },
                    { 2843, 1, "Школа №687" },
                    { 9073, 1, "Школа №688" },
                    { 3935, 1, "Школа №689" },
                    { 1090, 1, "Школа №679" },
                    { 6112, 1, "Школа №690" },
                    { 1323, 1, "Школа №692" },
                    { 3188, 1, "Школа №693" },
                    { 25489, 1, "Школа №694" },
                    { 17787, 1, "Школа №695" },
                    { 11987, 1, "Школа №696" },
                    { 8453, 1, "Школа №697" },
                    { 2294, 1, "Школа №698" },
                    { 1044578, 1, "Школа №699" },
                    { 9429, 1, "Школа №700" },
                    { 2593, 1, "Школа №702" },
                    { 1998, 1, "Школа №691" },
                    { 28128, 1, "Школа №678" },
                    { 1712959, 1, "Школа №678 (восьмилетняя)" },
                    { 8199, 1, "Школа №677" },
                    { 19617, 1, "Гимназия №653" },
                    { 1767393, 1, "Центр образования №654 им. А. Д. Фридмана" },
                    { 9883, 1, "Лицей №654" },
                    { 2472, 1, "Школа №655" },
                    { 20097, 1, "Школа №656 им. А. С. Макаренко" },
                    { 6781, 1, "Школа №657" },
                    { 16978, 1, "Школа №658" },
                    { 17414, 1, "Школа №659" },
                    { 1893, 1, "Школа №661" },
                    { 1306, 1, "Школа №662" },
                    { 46174, 1, "Школа №663" },
                    { 22898, 1, "Школа №664" },
                    { 1244, 1, "Школа №666" },
                    { 17404, 1, "Школа-интернат №666" },
                    { 40025, 1, "Детско-юношеская спортивная школа №666" },
                    { 9251, 1, "Школа №667" },
                    { 1162, 1, "Школа №668" },
                    { 59252, 1, "Школа №669" },
                    { 254982, 1, "Школа №670" },
                    { 17910, 1, "Школа №671" },
                    { 3999, 1, "Школа №672" },
                    { 621304, 1, "Школа №673" },
                    { 18898, 1, "Школа №674" },
                    { 3515, 1, "Школа №703" },
                    { 293021, 1, "Детский сад №703" },
                    { 818, 1, "Школа №704" },
                    { 957, 1, "Школа №705" },
                    { 11706, 1, "Школа №735" },
                    { 8317, 1, "Школа №737" },
                    { 5115, 1, "Школа №738" },
                    { 4471, 1, "Школа №739" },
                    { 27551, 1, "Школа №740" },
                    { 31147, 1, "Школа №741" },
                    { 22131, 1, "Школа №742" },
                    { 4648, 1, "Школа №743" },
                    { 36417, 1, "Школа №744" },
                    { 4823, 1, "Школа №745" },
                    { 5161, 1, "Школа №747" },
                    { 1672056, 1, "Детский сад №747" },
                    { 4748, 1, "Школа №748" },
                    { 4791, 1, "Школа №749" },
                    { 1322, 1, "Школа №750" },
                    { 4184, 1, "Школа №751" },
                    { 1746, 1, "Школа №752" },
                    { 3647, 1, "Школа №753" },
                    { 10042, 1, "Школа №754" },
                    { 23340, 1, "Школа №755" },
                    { 5595, 1, "Школа №756" },
                    { 2800, 1, "Школа №757" },
                    { 8791, 1, "Школа №758" },
                    { 40180, 1, "Школа №734 «Школа самоопределения»" },
                    { 3261, 1, "Школа №652" },
                    { 1757, 1, "Школа №733" },
                    { 18438, 1, "Школа №731" },
                    { 11, 1, "Школа №706" },
                    { 13704, 1, "Школа №707" },
                    { 5233, 1, "Школа №708" },
                    { 10144, 1, "Школа №709" },
                    { 39620, 1, "Школа №710" },
                    { 888, 1, "Гимназия №710" },
                    { 1013, 1, "Школа №711" },
                    { 16977, 1, "Школа №712" },
                    { 56755, 1, "Школа №713" },
                    { 4649, 1, "Школа №714" },
                    { 1203, 1, "Школа №715" },
                    { 21793, 1, "Школа №716" },
                    { 3400, 1, "Школа №717" },
                    { 4064, 1, "Школа №720" },
                    { 9467, 1, "Школа №721" },
                    { 49278, 1, "Школа №722" },
                    { 2187, 1, "Школа №723" },
                    { 2916, 1, "Школа №725" },
                    { 3909, 1, "Школа №726" },
                    { 18829, 1, "Школа №727" },
                    { 6649, 1, "Школа №728" },
                    { 4277, 1, "Школа №729" },
                    { 3077, 1, "Школа №730" },
                    { 5110, 1, "Школа №732" },
                    { 3393, 1, "Школа №651" },
                    { 23243, 1, "Школа №650" },
                    { 9643, 1, "Школа №649" },
                    { 16224, 1, "Школа №566" },
                    { 414291, 1, "Школа №567" },
                    { 24354, 1, "Школа №568" },
                    { 12940, 1, "Школа №569" },
                    { 414871, 1, "Школа №570" },
                    { 1679352, 1, "Школа №571" },
                    { 3096, 1, "Школа №572" },
                    { 37063, 1, "Школа №573" },
                    { 36936, 1, "Школа №574" },
                    { 8130, 1, "Школа №575" },
                    { 8509, 1, "Школа №576" },
                    { 831, 1, "Школа №577" },
                    { 51798, 1, "Музыкальная школа №577" },
                    { 595, 1, "Школа №578" },
                    { 38636, 1, "Школа №579" },
                    { 91593, 1, "Школа №580" },
                    { 4173, 1, "Школа №581" },
                    { 20180, 1, "Школа №582" },
                    { 3487, 1, "Школа №583" },
                    { 5300, 1, "Школа №584" },
                    { 8820, 1, "Школа №585" },
                    { 132499, 1, "Школа №586" },
                    { 1314, 1, "Школа №587" },
                    { 1089, 1, "Школа №565" },
                    { 14954, 1, "Школа №588" },
                    { 1679, 1, "Школа №564" },
                    { 4769, 1, "Школа №562" },
                    { 50734, 1, "Школа №540" },
                    { 6435, 1, "Школа №541" },
                    { 21172, 1, "Лицей №542" },
                    { 8623, 1, "Школа №543" },
                    { 1908, 1, "Школа №544" },
                    { 39898, 1, "Школа №545" },
                    { 10715, 1, "Школа №546" },
                    { 4453, 1, "Школа №547" },
                    { 12904, 1, "Центр образования №548 «Царицыно»" },
                    { 1770009, 1, "Художественная школа №548" },
                    { 3670, 1, "Школа №549" },
                    { 2720, 1, "Школа №550" },
                    { 6051, 1, "Школа №551" },
                    { 17837, 1, "Школа №552" },
                    { 1194, 1, "Школа №553" },
                    { 4779, 1, "Школа №554" },
                    { 8636, 1, "Школа №555" },
                    { 19867, 1, "Школа №556 (бывш. УВК 556, ЦО 556)" },
                    { 4068, 1, "Школа №557" },
                    { 46900, 1, "Школа №558" },
                    { 1673, 1, "Школа №559" },
                    { 27811, 1, "Школа №560" },
                    { 19114, 1, "Школа №561" },
                    { 5230, 1, "Школа №563" },
                    { 4273, 1, "Школа №538" },
                    { 14898, 1, "Школа №589" },
                    { 5884, 1, "Школа №593" },
                    { 6756, 1, "Школа №625" },
                    { 46456, 1, "Гимназия №625" },
                    { 16337, 1, "Школа №626 им. Н. И. Сац" },
                    { 8813, 1, "Школа №627" },
                    { 61920, 1, "Школа №628" },
                    { 4197, 1, "Школа №629" },
                    { 1680, 1, "Школа №630" },
                    { 908597, 1, "Школа №631" },
                    { 2560, 1, "Школа №632" },
                    { 7978, 1, "Школа №633" },
                    { 9012, 1, "Школа №634" },
                    { 1339, 1, "Школа №635" },
                    { 295907, 1, "Школа №636" },
                    { 11532, 1, "Школа №639" },
                    { 7740, 1, "Школа №640" },
                    { 9351, 1, "Школа №641" },
                    { 56891, 1, "Школа №642" },
                    { 13601, 1, "Школа №643" },
                    { 10457, 1, "Школа №644" },
                    { 7986, 1, "Школа №645" },
                    { 6369, 1, "Школа №646" },
                    { 44995, 1, "Школа №647" },
                    { 8425, 1, "Школа №648" },
                    { 4189, 1, "Школа №624" },
                    { 7919, 1, "Школа №590" },
                    { 5526, 1, "Школа №623" },
                    { 4188, 1, "Школа №622" },
                    { 21996, 1, "Школа №594" },
                    { 37246, 1, "Школа №595" },
                    { 4781, 1, "Школа №596" },
                    { 4287, 1, "Школа №597" },
                    { 837, 1, "Школа №598" },
                    { 11002, 1, "Школа №599" },
                    { 7353, 1, "Школа №600" },
                    { 59581, 1, "Школа №601" },
                    { 40106, 1, "Школа №602" },
                    { 360894, 1, "Школа №604" },
                    { 24527, 1, "Школа №606" },
                    { 2683, 1, "Школа №607" },
                    { 294197, 1, "Художественная школа №608" },
                    { 2656, 1, "Школа №611" },
                    { 13844, 1, "Школа №612" },
                    { 7024, 1, "Школа №613" },
                    { 1702055, 1, "Школа №614" },
                    { 129674, 1, "Школа №615" },
                    { 1344432, 1, "Детский сад №615" },
                    { 36121, 1, "Школа №616" },
                    { 9577, 1, "Школа №619" },
                    { 19492, 1, "Школа №620" },
                    { 4190, 1, "Школа №621" },
                    { 56783, 1, "Музыкальная школа №622" },
                    { 42586, 1, "Языковая школа «Carl Duisberg Centren»" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 719);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1092);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1096);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1109);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1688);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1726);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1872);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2209);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2917);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3096);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3218);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3665);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3708);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3710);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3872);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4053);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4068);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4826);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4988);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5083);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6067);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7047);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7058);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7069);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7726);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8901);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8988);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9250);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9389);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9478);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10209);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10701);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12043);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12122);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12554);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12917);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13554);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13891);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14690);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15043);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15209);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15571);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16108);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17219);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19167);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20096);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20801);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20816);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26343);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26816);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30733);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30797);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31292);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31774);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35891);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36511);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36941);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37874);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38354);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40665);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42221);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42752);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44629);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47295);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49402);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50267);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50626);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50917);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51421);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52146);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52554);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52928);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53262);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53719);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54122);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54297);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54756);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56532);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56757);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56891);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57048);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57538);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58206);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58397);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59058);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59146);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59252);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59485);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70107);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 102805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127765);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144554);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146485);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226887);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247445);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 286998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287060);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287230);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287321);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316605);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317926);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 322440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 322792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 323738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 324539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 328551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 331079);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 336243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 336244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 360986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 362738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 363574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 369770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 369806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 373548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 376702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 377557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 378088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 384400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 384406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 386098);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 403449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 405987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 406005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 406404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 406409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 407106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 411347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 412229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 413501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 414291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 414871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 416430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 425856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 429307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 429317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 429348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 431923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 436204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 438241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 438257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 439866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 439877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 439882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 446415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 451211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454548);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 454742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 455015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 455021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 455036);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 457539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 457540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 457541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465182);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465225);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 465528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 474675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 475335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 477913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 480390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 483512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 485245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 491396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 497599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 501086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 501089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 501854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 504355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 505172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 506075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 506529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 506907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 507164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 509435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 510382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 516154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 518309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 518806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 518962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 521150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 523278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 525349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 526363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 526439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 527898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 528540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 532457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 532974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 533746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 533747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 534813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 537183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 538488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 540963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 541894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 545091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 545092);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 560690);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 560693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 565443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 572488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 579785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 579788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 621304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 625201);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 626073);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 626135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 627204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 627296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 627810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 639686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 639687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 658124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 661566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 672366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 674090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 684039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 685619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 685647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 686404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 696986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 697760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 698376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 699466);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 699877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 700465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 700705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 701572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 705420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 716499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 716501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 720541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 721681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 733858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 735588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 738937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 744311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 746582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 747168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 749435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 757929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 758095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 758181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 763194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 780604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 784633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 784637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 786195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 786198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 786743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 789304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 789305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 791310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 791970);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 794448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 794673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 801490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 801491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 801529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 802610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 804152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 805202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 805904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 805905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 815146);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 819334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 825273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 825274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 853110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 854156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 855857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 861338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 868528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 880181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 884799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 884829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 884843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 887715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 894651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 894942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 895312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 895753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 899382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 899501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 899820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 900446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 901152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 901794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 901796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 902488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 904800);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 905518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 907527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 908530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 908597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 909764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 909773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 910238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 938646);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 948195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960807);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 967317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 973241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 976960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 983018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 988228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 989205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 989210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1006556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1036075);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1037082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1043587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1043588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1044578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1046248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1046249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1048467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1048953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1050567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1058258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1061040);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1064129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1064676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1067574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1069006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1072484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1075660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1075661);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1075662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1076824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1080642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1093842);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1096282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1096283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1098080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1098084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1176212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1176236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1269413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1269415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1269773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1270246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1270322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1270323);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1271037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1280884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1283667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1284240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1284817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1291509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1291516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1305308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1305475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1318976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1318980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1321327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1334428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1341715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1342023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1344431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1344432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1349849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1349855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1402337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1402338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1405961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1412227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1412228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1412268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1423172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1447879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1478590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1478597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1480713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1491338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1501595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1507019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1507020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1513890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1516899);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1519689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1519698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1523539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1534486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1535502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1539339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1541358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1544649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1547152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1556464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1563321);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1563751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1564528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1593505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1594059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1596763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1597353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1598423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1600082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1600255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1608918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1620488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1624263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1627968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1627973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1628435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1628436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1632258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1632259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1632260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1636814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1642380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1642381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1647517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1647518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1650916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1652664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1652670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1652671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1652672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1653450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656322);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1657427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1657440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1658184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1658185);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1658754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659027);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659571);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660761);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660830);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662102);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663042);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663990);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1666778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1669882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1669885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670559);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1671740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672254);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1672315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1673185);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1674550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1674574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1676683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1676697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677634);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1680604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1680840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1681120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1682126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1684837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1685515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1685740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1686481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1687981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1688011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1688020);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1689499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1691894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1691898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1691905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1691918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698816);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1699095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1699148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1701203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1701204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1701255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1702030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1702055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1703849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705108);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1706632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1706864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1707133);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1710208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1711373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1711374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1711439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712348);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1712959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1713229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715623);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1716669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1716702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1719006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1719845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1721409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1721836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722112);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1722872);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723102);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1724839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1724862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1727462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1729551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1732415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1732834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733748);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1734232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1734512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1734936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1737609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1737743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1737992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1738414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1738975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1738982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1740016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1740790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1740852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1740902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742191);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1742909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744213);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744269);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744699);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744708);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744913);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745587);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1747256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1747268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1747389);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1747876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1748641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1750467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751469);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756923);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759498);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1760467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761087);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761267);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761782);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762138);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763379);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763782);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764327);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765045);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766544);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767305);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767836);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769445);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769640);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1770951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771870);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772014);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772067);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772922);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773262);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773826);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774477);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775152);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776047);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776478);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777166);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777791);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778349);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778677);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778787);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779871);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780329);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780680);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780685);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780869);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781583);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781652);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781690);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781696);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1782159);
        }
    }
}
