using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class EkatirenburgSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 83547, 49, "Учебно-производственный комбинат (УПК) №1" },
                    { 1774751, 49, "Академия «Грант»" },
                    { 129952, 49, "Академия ГПС МЧС РФ (филиал)" },
                    { 218998, 49, "Академия информационных технологий (УрАИТ)" },
                    { 278309, 49, "Академия кинобизнеса" },
                    { 1781629, 49, "Академия красоты и здоровья" },
                    { 293804, 49, "Академия красоты и имиджа" },
                    { 1775584, 49, "Академия парикмахерского искусства «Studio Best»" },
                    { 1705460, 49, "Армянская этно-культурная школа" },
                    { 1758456, 49, "Бизнес-школа «Высшая экономическая школа»" },
                    { 1741628, 49, "Высшая школа имиджа и стиля" },
                    { 311687, 49, "Гидрометеорологическая школа (ГМШ)" },
                    { 277038, 49, "Гимназия «Арт-Этюд»" },
                    { 93686, 49, "Гимназия «Гармония»" },
                    { 146739, 49, "Гимназия «Индра»" },
                    { 127063, 49, "Гимназия «Менталитет»" },
                    { 121586, 49, "Гимназия «Ор-Авнер»" },
                    { 131946, 49, "Гимназия им. Кусто" },
                    { 188110, 49, "Аграрный колледж (УрГАК при УрГСХА)" },
                    { 279947, 49, "Гимназия при УПУ" },
                    { 245768, 49, "Агопромышленное областное училище" },
                    { 241103, 49, "Автошкола СТК «ОСТО»" },
                    { 1759032, 49, "Автошкола «Вираж»" },
                    { 261794, 49, "Автошкола «Дебют»" },
                    { 169536, 49, "Автошкола «Клаксон»" },
                    { 263351, 49, "Автошкола «Лада»" },
                    { 234898, 49, "Автошкола «Пегас-авто»" },
                    { 960919, 49, "Автошкола «Прайм-Авто»" },
                    { 1761789, 49, "Автошкола «Свердловский ЦППК»" },
                    { 1334427, 49, "Автошкола «СТК Уралмаш»" },
                    { 273076, 49, "Автошкола «Урал-Драйв»" },
                    { 1611914, 49, "Автошкола «Центавр»" },
                    { 313884, 49, "Автошкола «Центр АВС»" },
                    { 291662, 49, "Автошкола «ЭКСПО-М»" },
                    { 363653, 49, "Автошкола ВОА" },
                    { 246029, 49, "Автошкола ЕАДК" },
                    { 226156, 49, "Автошкола на Онежской" },
                    { 213450, 49, "Автошкола при УГК им. И. И. Ползунова" },
                    { 122697, 49, "Автошкола РОСТО-ДОСААФ" },
                    { 791670, 49, "Автошкола УГТУ-УПИ" },
                    { 59464, 49, "Горная школа" },
                    { 275811, 49, "Горнометаллургический техникум" },
                    { 224827, 49, "Гуманитарно-экологический лицей (ГЭЛ)" },
                    { 1709114, 49, "Индивидуальный курс фотографии Олега Туринского" },
                    { 144449, 49, "Институт имиджелогии" },
                    { 1774400, 49, "Институт опережающего образования" },
                    { 142376, 49, "Институт подготовки и повышения квалификации кадров лесного комплекса (УИППК КЛК)" },
                    { 1777443, 49, "Институт социально-экономического образования (ИСЭО)" },
                    { 62188, 49, "Институт танца" },
                    { 1767465, 49, "Информационно-методический центр «Екатеринбургский Дом Учителя»" },
                    { 165900, 49, "Итальянский высший колледж «Леонардо»" },
                    { 210282, 49, "Колледж бизнеса, управления и технологии красоты (УКБУиТК)" },
                    { 101235, 49, "Колледж железнодорожного транспорта (КЖТ УрГУПС, бывш. СПО УрГУПС)" },
                    { 221840, 49, "Колледж им. Леонардо да Винчи при УрГУ" },
                    { 211026, 49, "Колледж индустрии красоты (УрКИК)" },
                    { 207969, 49, "Колледж Института международных связей" },
                    { 192943, 49, "Колледж искусств и культуры (СКИиК, бывш. СОУИиК)" },
                    { 156698, 49, "Колледж недвижимости и управления (УКНиУ)" },
                    { 167556, 49, "Колледж предпринимательства и социального управления (КПиСУ)" },
                    { 123635, 49, "Колледж при УГГУ" },
                    { 179089, 49, "Железнодорожная музыкальная школа" },
                    { 62293, 49, "Екатеринбургский кадетский корпус (бывш. Лицей милиции ГУВД Свердловской области)" },
                    { 263979, 49, "Дом детства и юношества Кировского района" },
                    { 83137, 49, "Дом детского творчества Ленинского района" },
                    { 200373, 49, "Гуманитарный колледж" },
                    { 260777, 49, "Дворец спорта" },
                    { 621158, 49, "Дворец творчества учащихся" },
                    { 136705, 49, "Детская филармония (СГДФ)" },
                    { 247256, 49, "Детский сад «Малышок»" },
                    { 271411, 49, "Детско-юношеская спортивная школа «Динамо»" },
                    { 240516, 49, "Детско-юношеская спортивная школа «Калининец»" },
                    { 59687, 49, "Детско-юношеская спортивная школа «Кристалл»" },
                    { 254962, 49, "Автошкола «Базис»" },
                    { 99286, 49, "Детско-юношеская спортивная школа «Локомотив»" },
                    { 248729, 49, "Детско-юношеская спортивная школа «Ритм»" },
                    { 219545, 49, "Детско-юношеская спортивная школа «Уралмаш»" },
                    { 163985, 49, "Детско-юношеская спортивная школа олимпийского резерва «Виктория»" },
                    { 162352, 49, "Детско-юношеская спортивная школа олимпийского резерва «Спартаковец»" },
                    { 130636, 49, "Детско-юношеская спортивная школа олимпийского резерва «Юность»" },
                    { 151700, 49, "Детско-юношеская спортивная школа олимпийского резерва горных видов спорта" },
                    { 144804, 49, "Детско-юношеская спортивная школа СК «Урал»" },
                    { 157547, 49, "Дневное подготовительное отделение при УрГСХА" },
                    { 94324, 49, "Детско-юношеская спортивная школа «Малахитовый гонг»" },
                    { 116717, 49, "Автошкола «Автопилот»" },
                    { 178195, 49, "Автошкола «Автолюкс»" },
                    { 1611916, 49, "Автошкола «Авто-Профи»" },
                    { 218529, 49, "Школа №201 «Согласие»" },
                    { 20919, 49, "Гимназия №201" },
                    { 16689, 49, "Гимназия №202 «Менталитет»" },
                    { 53534, 49, "Школа №203 «Родники»" },
                    { 9598, 49, "Школа №204" },
                    { 241453, 49, "Школа №205" },
                    { 162161, 49, "Гимназия №205 «Театр»" },
                    { 63251, 49, "Школа №206" },
                    { 53516, 49, "Гимназия №207 «Оптимум»" },
                    { 205808, 49, "Школа №208" },
                    { 155141, 49, "Лицей №209" },
                    { 41356, 49, "Гимназия №210 «Корифей»" },
                    { 123498, 49, "Школа №211" },
                    { 7110, 49, "Гимназия №211" },
                    { 152284, 49, "Гимназия №212" },
                    { 57084, 49, "Школа №213 «Континент»" },
                    { 76996, 49, "Школа №214" },
                    { 272104, 49, "Художественная школа №200 (до 1997 г.)" },
                    { 38857, 49, "Школа №200" },
                    { 174802, 49, "Школа №199" },
                    { 63729, 49, "Школа №198" },
                    { 121233, 49, "Лицей №180 «Полифорум»" },
                    { 25490, 49, "Школа №181" },
                    { 207158, 49, "Центр образования №182" },
                    { 169844, 49, "Школа №182" },
                    { 122123, 49, "Школа №183 «Лик»" },
                    { 9095, 49, "Школа №184 «Новая школа»" },
                    { 34111, 49, "Школа №184" },
                    { 144771, 49, "Школа №185" },
                    { 125279, 49, "Школа №215 «Перспектива»" },
                    { 288534, 49, "Школа №186" },
                    { 56155, 49, "Школа №188" },
                    { 80484, 49, "Школа №189" },
                    { 238300, 49, "Школа №190" },
                    { 114172, 49, "Школа №191" },
                    { 279668, 49, "Школа №192" },
                    { 202852, 49, "Школа №193" },
                    { 135927, 49, "Школа №196" },
                    { 259205, 49, "Школа №197" },
                    { 65257, 49, "Школа №187" },
                    { 88911, 49, "Колледж связи и информатики (УрКСИ)" },
                    { 49567, 49, "Школа №216 «Альтернатива»" },
                    { 777396, 49, "Школа №219 «Лад»" },
                    { 203187, 49, "Школа №639" },
                    { 295265, 49, "Школа №656" },
                    { 140022, 49, "Школа №666" },
                    { 211122, 49, "Лицей №777" },
                    { 203651, 49, "Школа №789" },
                    { 272927, 49, "Школа №790" },
                    { 189200, 49, "Школа №800" },
                    { 84440, 49, "Школа №1234" },
                    { 258439, 49, "Школа №1349" },
                    { 121741, 49, "Школа №1411" },
                    { 131070, 49, "Школа №1488" },
                    { 177200, 49, "Гимназия №2002" },
                    { 88977, 49, "Правовой лицей им. Кастеля (до 2008 г.)" },
                    { 1743116, 49, "Cisco Networking Academy" },
                    { 81925, 49, "Автомобильно-дорожный колледж (ЕАДК)" },
                    { 277672, 49, "Автошкола «Авто-Максимум»" },
                    { 1661576, 49, "Автошкола «Авто-Мастер»" },
                    { 314846, 49, "Школа №569" },
                    { 653992, 49, "Детский сад №556" },
                    { 237041, 49, "Школа №501" },
                    { 189084, 49, "Школа №500" },
                    { 206479, 49, "Школа №222" },
                    { 188168, 49, "Центр образования №222" },
                    { 288811, 49, "Профессиональное училище №222" },
                    { 37776, 49, "Школа №224" },
                    { 152499, 49, "Центр образования №224" },
                    { 190638, 49, "Лицей №229" },
                    { 284728, 49, "Школа №232" },
                    { 194104, 49, "Лицей №233" },
                    { 272061, 49, "Школа №217" },
                    { 48777, 49, "Школа №238" },
                    { 174599, 49, "Лицей №277" },
                    { 219920, 49, "Школа №299" },
                    { 270996, 49, "Школа №311" },
                    { 254624, 49, "Детский сад №324" },
                    { 1668212, 49, "Детский сад №397" },
                    { 219837, 49, "Школа №445" },
                    { 279272, 49, "Школа №481" },
                    { 57755, 49, "Гимназия №487" },
                    { 144441, 49, "Школа №255" },
                    { 179197, 49, "Колледж строительства, архитектуры и предпринимательства (УКСАП, УГМКСАиП, УАСК)" },
                    { 171352, 49, "Колледж транспортного строительства (ЕКТС, ССТТС)" },
                    { 137124, 49, "Колледж УГГУ" },
                    { 1750789, 49, "Учебно-производственный центр ЕМУП «ТТУ»" },
                    { 260285, 49, "Учебно-тренировочный центр «ОСТО»" },
                    { 1776449, 49, "Учебный центр «Аэроскул»" },
                    { 1291515, 49, "Учебный центр «Директор»" },
                    { 295128, 49, "Училище прикладного искусства (УУПИ)" },
                    { 133183, 49, "Факультет СПО при УрГЮУ" },
                    { 1698483, 49, "Факультет СПО УГЛТУ" },
                    { 199783, 49, "Факультет СПО УрГУ" },
                    { 88721, 49, "Финансовая банковская школа (УФБШ)" },
                    { 186825, 49, "Финансовая школа (УФШ)" },
                    { 190214, 49, "Химико-механический техникум (ЕХМТ)" },
                    { 79683, 49, "Хореографический ансамбль танца «Детство»" },
                    { 59368, 49, "Хореографический ансамбль танца «Радость» ДК «Урал»" },
                    { 216578, 49, "Хореографический ансамбль танца «Танц-Ателье Этуаль»" },
                    { 128253, 49, "Художественная школа «Совушка»" },
                    { 313396, 49, "Художественная школа им. Хожателева" },
                    { 203053, 49, "Художественное училище (ЕХУ) им. И. Д. Шадра" },
                    { 1764662, 49, "Уральский финансово-юридический колледж" },
                    { 1654143, 49, "Уральский техникум экономики и права (УТЭиП)" },
                    { 213695, 49, "Уральский техникум «Рифей» (бывш. Уральское профессиональное училище «Рифей»)" },
                    { 231796, 49, "Уральский политехникум" },
                    { 200236, 49, "Техникум дизайна и сервиса (ОТДиС)" },
                    { 260140, 49, "Техникум железнодорожного транспорта (УТЖТ)" },
                    { 174803, 49, "Техникум отраслевых технологий и сервиса (ЕТОТС, бывш. учил. Парикмахерского искусства)" },
                    { 227845, 49, "Техникум пищевой промышленности им. Горького" },
                    { 238625, 49, "Техникум ремесленников-предпринимателей (УТРП, ПЛРП)" },
                    { 257716, 49, "Техникум советской торговли" },
                    { 104937, 49, "Техникум химического машиностроения (ЕТХМ)" },
                    { 211186, 49, "Техническое училище «Турбо»" },
                    { 163949, 49, "Центр «Одаренность и технологии» (ЦОТ)" },
                    { 238104, 49, "Технологический колледж (УрТК)" },
                    { 205760, 49, "Уральская школа бизнеса (УШБ)" },
                    { 312947, 49, "Уральская школа тенниса (УШТ)" },
                    { 1758419, 49, "Уральская школа флористики и дизайна" },
                    { 213353, 49, "Уральский государственный колледж (УГК) им. И. И. Ползунова" },
                    { 1779417, 49, "Уральский институт фитнеса" },
                    { 1667438, 49, "Уральский колледж технологий и предпринимательства (УКТП)" },
                    { 225780, 49, "Уральский лесотехникум" },
                    { 1743524, 49, "Уральский пожарно-спасательный учебный центр (УрПСУЦ)" },
                    { 225408, 49, "Торгово-экономический техникум (ЕТЭТ)" },
                    { 167437, 49, "Техникум «Автоматика»" },
                    { 1744041, 49, "Центр «Потенциал»" },
                    { 312691, 49, "Центр сертификации «Академия Велеса»" },
                    { 224630, 49, "Школа народной культуры (ШНК)" },
                    { 198309, 49, "Школа самбо «Уралмаш»" },
                    { 59139, 49, "Школа современного танца Екатеринбургского центра современного искусства" },
                    { 40144, 49, "Школа страстотерпца царевича Алексея" },
                    { 192536, 49, "Школа танцев «Энергия+»" },
                    { 200763, 49, "Школа УГТУ-УПИ" },
                    { 246841, 49, "Школа физической культуры (ШФК)" },
                    { 273077, 49, "Школа хореографии" },
                    { 76094, 49, "Школа юного архитектора (при УРГАХА)" },
                    { 220089, 49, "Школа-интернат спортивного профиля" },
                    { 142848, 49, "Школа-колледж «Лэндинг»" },
                    { 167392, 49, "Экономико-технологический колледж (ЕЭТК)" },
                    { 166581, 49, "Экономический колледж (УЭК)" },
                    { 156110, 49, "Экономический колледж при УПИ" },
                    { 83856, 49, "Электромеханический колледж (ЕЭМК)" },
                    { 186493, 49, "Электротехникум связи" },
                    { 131462, 49, "Элитарная школа" },
                    { 763313, 49, "Школа ландшафтного дизайна" },
                    { 1763568, 49, "Школа консультантов по семейным отношениям от Ирины Удиловой" },
                    { 1758845, 49, "Школа кино Свердловской киностудии" },
                    { 156982, 49, "Школа бокса при УрГЮА" },
                    { 169255, 49, "Центр эстетического развития детей (ЦЭТИ)" },
                    { 153868, 49, "Церковно-приходская школа Прихода во имя Всех Святых" },
                    { 173769, 49, "Частная гимназия" },
                    { 155457, 49, "Шахматная школа" },
                    { 22940, 49, "Школа «Гелиос»" },
                    { 149574, 49, "Школа «Импульс»" },
                    { 83190, 49, "Школа «Источник»" },
                    { 185280, 49, "Школа «Крона»" },
                    { 1758362, 49, "Центр культуры «Урал»" },
                    { 241739, 49, "Школа «Надежда»" },
                    { 48105, 49, "Школа «Сирин»" },
                    { 132980, 49, "Школа «Согласие»" },
                    { 181126, 49, "Школа «Талисман»" },
                    { 64035, 49, "Школа «Творчество»" },
                    { 175178, 49, "Школа «Эврика-дизайн»" },
                    { 26117, 49, "Школа «Юность»" },
                    { 53408, 49, "Школа архитектурно-художественного творчества (ШАХТ)" },
                    { 239315, 49, "Школа бального танца «Лето»" },
                    { 73209, 49, "Школа «Перспектива»" },
                    { 9627, 49, "Школа №180" },
                    { 810946, 49, "Театральное училище (СТУ)" },
                    { 185100, 49, "Суворовское военное училище (ЕкСВУ, бывш. СвСВУ)" },
                    { 73977, 49, "Малая академия наук (МАН) при УрГУ" },
                    { 139713, 49, "Малая лесная академия (МЛА) УГЛТУ" },
                    { 239366, 49, "Машиностроительный колледж (ЕМК)" },
                    { 158040, 49, "Медицинский колледж УрГУПС" },
                    { 108172, 49, "Медицинский областной колледж (СОМК)" },
                    { 212331, 49, "Медицинское училище Свердловской железной дороги" },
                    { 138533, 49, "Международная открытая школа (МОШ) ЮНЕСКО" },
                    { 1665458, 49, "Межрегиональный колледж безопасности (УМКБ)" },
                    { 310391, 49, "Металлургический техникум (ПМТ)" },
                    { 231573, 49, "Механико-технологический колледж (ЕМТК)" },
                    { 170610, 49, "Механический техникум (ЕМТ)" },
                    { 242598, 49, "Монтажный колледж (ЕМК)" },
                    { 1763611, 49, "МотоАкадемия" },
                    { 139909, 49, "Мужской хоровой лицей (МХЛ)" },
                    { 149385, 49, "Музыкальная школа «Рондо»" },
                    { 137067, 49, "Музыкальная школа при ДДТ" },
                    { 50447, 49, "Музыкальная школа при МУ им. Чайковского" },
                    { 144785, 49, "Лицей при Уральском институте туризма (УМИТ)" },
                    { 63212, 49, "Лицей при УГК им. И. И. Ползунова" },
                    { 74473, 49, "Лицей при СвердНИИхиммаш" },
                    { 58195, 49, "Лицей отечественной культуры" },
                    { 1343821, 49, "Колледж управления и сервиса «Стиль»" },
                    { 177802, 49, "Колледж УрАИТ" },
                    { 57272, 49, "Колледж УрГЭУ" },
                    { 248929, 49, "Колледж физики (ЕКФ)" },
                    { 253212, 49, "Колледж физической культуры (ЕКФК)" },
                    { 190781, 49, "Колледж экономики и права" },
                    { 243205, 49, "Колледж экономики, управления и права" },
                    { 188423, 49, "Колледж экономики, управления и финансов" },
                    { 208556, 49, "Музыкальная школа при ЦДТ" },
                    { 1766343, 49, "Колледж электроэнергетики и машиностроения (КЭМ)" },
                    { 77943, 49, "Кооперативный техникум (СКТ)" },
                    { 259626, 49, "Культурно-просветительское училище" },
                    { 122586, 49, "Культурологический лицей" },
                    { 150784, 49, "Лицей «Гейзер»" },
                    { 89396, 49, "Лицей «Закройщик»" },
                    { 205044, 49, "Лицей «Лад»" },
                    { 65796, 49, "Лицей «Милосердие»" },
                    { 154309, 49, "Лицей новых информационных технологий" },
                    { 177362, 49, "Компьютерная школа при УГТУ-УПИ (УКШ)" },
                    { 243754, 49, "Театральная школа (ДТШ)" },
                    { 289592, 49, "Музыкально-педагогическое училище" },
                    { 270059, 49, "Музыкально-эстетический колледж (СОМЭПК)" },
                    { 188172, 49, "Профессиональное училище по подготовке работников торговли" },
                    { 185975, 49, "Профессиональный лицей «Мода»" },
                    { 1055727, 49, "Профессиональный лицей «Строитель»" },
                    { 287147, 49, "Радиотехническая школа (ЕРШ)" },
                    { 163032, 49, "Радиотехнический колледж (УРТК, бывш. УРТТ, ЕРТТ) им. А. С. Попова" },
                    { 1780671, 49, "Санкт-Петербургская школа красоты Эколь" },
                    { 1728445, 49, "Санкт-Петербургская школа телевидения (филиал)" },
                    { 147841, 49, "Свердловский областной педагогический колледж (СОПК, бывш. им. Горького)" },
                    { 165261, 49, "Свердловский областной фармацевтический колледж (СОФК)" },
                    { 157564, 49, "Свято-Алексеевская православная школа" },
                    { 1775513, 49, "Свято-Симеоновская гимназия" },
                    { 1669898, 49, "Семейный центр образования и развития «Чудо-ребёнок»" },
                    { 121895, 49, "Славянская школа" },
                    { 200745, 49, "Специализированный учебно-научный центр (СУНЦ) УрФУ" },
                    { 158804, 49, "Средняя специальная школа-лицей (СПМШЛ) при УГК им. Мусоргского" },
                    { 200741, 49, "Строительный техникум" },
                    { 1666132, 49, "Студия «Стиль-Дизайн»" },
                    { 148552, 49, "Профессиональное училище «Кулинар»" },
                    { 292504, 49, "Профессионально-педагогический колледж технологии красоты" },
                    { 232682, 49, "Профессионально-педагогический колледж" },
                    { 1739184, 49, "Промышленно-экономический техникум (УрПЭТ)" },
                    { 87180, 49, "Музыкальное училище им. П. И. Чайковского." },
                    { 38086, 49, "Музыкальный колледж при УГК им. Мусоргского" },
                    { 101974, 49, "Муниципальный театр балета «Щелкунчик»" },
                    { 129796, 49, "Наша школа" },
                    { 201081, 49, "Областная школа-интернат" },
                    { 1758418, 49, "Образовательный центр «Arena Multimedia»" },
                    { 1743529, 49, "Открытая юридическая школа Института юстиции УрГЮУ" },
                    { 120792, 49, "Очно-заочная школа при ИММ УрО РАН" },
                    { 50608, 49, "Музыкально-хоровой колледж (ЕМХК)" },
                    { 23277, 49, "Парк-школа" },
                    { 211772, 49, "Педагогическое училище железнодорожного транспорта (УПУЖТ)" },
                    { 257319, 49, "Пожарно-техническое училище (ЕПТУ)" },
                    { 262192, 49, "Политехникум" },
                    { 222618, 49, "Политехническая гимназия" },
                    { 210118, 49, "Политехнический колледж (УрПК)" },
                    { 295332, 49, "Православная гимназия" },
                    { 219293, 49, "Промышленно-технологический техникум (ЕПТТ) им. В. М. Курочкина" },
                    { 241671, 49, "Промышленно-экономический колледж (ЕПЭК)" },
                    { 210689, 49, "Педагогический колледж (ЕПК)" },
                    { 251076, 49, "Энергетический техникум (ЕЭТ)" },
                    { 1675203, 49, "Школа №179" },
                    { 197340, 49, "Музыкально-хоровое отделение гимназии №177" },
                    { 67967, 49, "Школа №20" },
                    { 272217, 49, "Школа-интернат №20" },
                    { 95885, 49, "Профессиональный лицей №20 «Стиль»" },
                    { 245644, 49, "Профессионально-техническое училище №20" },
                    { 267366, 49, "Профессиональное училище №20" },
                    { 64068, 49, "Школа №21" },
                    { 263119, 49, "Лицей №21" },
                    { 191573, 49, "Школа №22" },
                    { 85527, 49, "Школа №23" },
                    { 37799, 49, "Лицей №23" },
                    { 216888, 49, "Профессионально-техническое училище №23" },
                    { 143977, 49, "Профессиональное училище №23" },
                    { 21799, 49, "Школа №24" },
                    { 203487, 49, "Профессионально-техническое училище №24" },
                    { 255029, 49, "Профессиональное училище №24" },
                    { 82924, 49, "Школа №25" },
                    { 73556, 49, "Гимназия №25" },
                    { 296381, 49, "Детско-юношеская спортивная школа олимпийского резерва №19" },
                    { 208704, 49, "Школа №26" },
                    { 32389, 49, "Музыкальная школа №19" },
                    { 1778082, 49, "Школа №19 (ул. Павла Шаманова)" },
                    { 215598, 49, "Школа-интернат №14" },
                    { 113811, 49, "Музыкальная школа №14" },
                    { 52875, 49, "Школа №15" },
                    { 230409, 49, "Музыкальная школа №15" },
                    { 295405, 49, "Детско-юношеская спортивная школа №15" },
                    { 138063, 49, "Школа №16" },
                    { 197795, 49, "Школа-интернат №16" },
                    { 68645, 49, "Музыкальная школа №16" },
                    { 15803, 49, "Школа №17" },
                    { 123227, 49, "Гимназия №17" },
                    { 217384, 49, "Школа-интернат №17" },
                    { 76944, 49, "Музыкальная школа №17" },
                    { 211711, 49, "Детско-юношеская спортивная школа олимпийского резерва №17" },
                    { 97736, 49, "Школа №18" },
                    { 171911, 49, "Гимназия №18" },
                    { 185750, 49, "Музыкальная школа №18" },
                    { 146580, 49, "Детско-юношеская спортивная школа олимпийского резерва №18" },
                    { 8968, 49, "Школа №19 «Гармония»" },
                    { 206704, 49, "Школа №27" },
                    { 211684, 49, "Школа №28" },
                    { 14031, 49, "Школа-интернат №28" },
                    { 23723, 49, "Школа №41" },
                    { 241431, 49, "Школа №42" },
                    { 63400, 49, "Художественно-профессиональное училише (ХПУ) №42" },
                    { 259067, 49, "Профессиональное училище №42" },
                    { 293294, 49, "Школа №43" },
                    { 15264, 49, "Школа №44" },
                    { 15969, 49, "Школа №45" },
                    { 171835, 49, "Гимназия №45" },
                    { 36362, 49, "Школа №46" },
                    { 245987, 49, "Школа №47" },
                    { 35664, 49, "Гимназия №47" },
                    { 30236, 49, "Школа №48" },
                    { 2342, 49, "Школа №49" },
                    { 1666037, 49, "Детский сад №49" },
                    { 314929, 49, "Школа №50" },
                    { 21438, 49, "Школа №51" },
                    { 21942, 49, "Школа №52" },
                    { 54710, 49, "Лицей №40" },
                    { 9410, 49, "Гимназия №40" },
                    { 186492, 49, "Школа №40" },
                    { 310802, 49, "Детский сад №39" },
                    { 204542, 49, "Школа рабочей молодежи (ШРМ) №29" },
                    { 33897, 49, "Школа №29" },
                    { 32388, 49, "Школа №30" },
                    { 83121, 49, "Школа №31" },
                    { 85312, 49, "Школа-интернат «Эверест» (№31)" },
                    { 28580, 49, "Школа №32" },
                    { 9207, 49, "Художественная школа №32" },
                    { 77545, 49, "Школа №33" },
                    { 46367, 49, "Школа №14" },
                    { 170979, 49, "Школа №34" },
                    { 2095, 49, "Гимназия №35" },
                    { 18790, 49, "Школа №36" },
                    { 242785, 49, "Вечерняя школа №36" },
                    { 4333, 49, "Гимназия №37" },
                    { 122492, 49, "Музыкальная школа №37" },
                    { 896, 49, "Школа №38" },
                    { 274571, 49, "Школа №39" },
                    { 4235, 49, "Гимназия №39" },
                    { 147089, 49, "Школа №35" },
                    { 1717519, 49, "Детский сад №13" },
                    { 65998, 49, "Музыкальная школа №13  им. И. О. Дунаевского" },
                    { 200243, 49, "Школа-интернат №13" },
                    { 147987, 49, "Музыкальная школа №2 им. Глинки" },
                    { 154296, 49, "Хоровая школа №2" },
                    { 50979, 49, "Художественная школа №2" },
                    { 250863, 49, "Городской медицинский колледж (ГМК) №2" },
                    { 172536, 49, "Школа искусств №2" },
                    { 236968, 49, "Школа №3" },
                    { 278449, 49, "Гимназия №3" },
                    { 87214, 49, "Лицей №3" },
                    { 20408, 49, "Музыкальная школа №3" },
                    { 121147, 49, "Детско-юношеская спортивная школа олимпийского резерва №3" },
                    { 71258, 49, "Художественная школа №3" },
                    { 125747, 49, "Школа искусств №3" },
                    { 1721769, 49, "Профессиональное училище №3" },
                    { 114614, 49, "Школа №4" },
                    { 142751, 49, "Музыкальная школа №4" },
                    { 38865, 49, "Художественная школа №4" },
                    { 66367, 49, "Школа искусств №4" },
                    { 58214, 49, "Лицей №2" },
                    { 5226, 49, "Гимназия №2" },
                    { 156363, 49, "Школа №2" },
                    { 1752251, 49, "Свердловский учебный центр профессиональной квалификации (ОАО РЖД), Филиал №2" },
                    { 49644, 49, "Школа №1" },
                    { 163952, 49, "Учебно-тренировочный центр «Омега-1»" },
                    { 33261, 49, "Учебно-тренировочный центр №1" },
                    { 1749802, 49, "Учебный центр №1 Свердловской железной дороги-филиала ОАО «РЖД»" },
                    { 74275, 49, "Гимназия №1" },
                    { 125130, 49, "Лицей №1" },
                    { 131431, 49, "Музыкальная школа №1" },
                    { 177759, 49, "Детско-юношеская спортивная школа олимпийского резерва №1" },
                    { 124203, 49, "Школа №5" },
                    { 291343, 49, "Детско-юношеская спортивная школа №1" },
                    { 140684, 49, "Профессионально-техническое училище №1" },
                    { 234553, 49, "Училище олимпийского резерва №1 (УОР)" },
                    { 314072, 49, "Профессиональное училище №1" },
                    { 314081, 49, "Школа искусств №1" },
                    { 146560, 49, "Детский сад №1" },
                    { 163692, 49, "Профессиональное училище №1 им. Курочкина" },
                    { 192594, 49, "Автошкола «СТК-1»" },
                    { 78308, 49, "Школа народных искусств №2" },
                    { 46809, 49, "Художественная школа №1" },
                    { 52850, 49, "Школа №53" },
                    { 94510, 49, "Гимназия №5" },
                    { 43008, 49, "Художественная школа №5" },
                    { 194168, 49, "Школа-интернат №9" },
                    { 34135, 49, "Музыкальная школа №9" },
                    { 66274, 49, "Школа искусств №9" },
                    { 7924, 49, "Школа №10" },
                    { 210509, 49, "Гимназия №10" },
                    { 56788, 49, "Музыкальная школа №10" },
                    { 193662, 49, "Школа искусств №10" },
                    { 1046247, 49, "Школа №11 ВВС" },
                    { 10515, 49, "Школа №11" },
                    { 282778, 49, "Школа-интернат №11" },
                    { 23527, 49, "Музыкальная школа №11" },
                    { 240339, 49, "Профессионально-техническое училище №11 «Уралобувь»" },
                    { 11076, 49, "Школа №12" },
                    { 118727, 49, "Лицей №12" },
                    { 156131, 49, "Музыкальная школа №12 им. С. С. Прокофьева" },
                    { 152176, 49, "Школа №13" },
                    { 10659, 49, "Гимназия №13" },
                    { 73632, 49, "Гимназия №9" },
                    { 54709, 49, "Художественная школа №8" },
                    { 201799, 49, "Детско-юношеская спортивная школа олимпийского резерва №8" },
                    { 263205, 49, "Музыкальная школа №8" },
                    { 67644, 49, "Школа искусств №5" },
                    { 96969, 49, "Профессиональное училище №5" },
                    { 239965, 49, "Школа №6" },
                    { 851422, 49, "Школа-интернат №6" },
                    { 36909, 49, "Музыкальная школа №6" },
                    { 127056, 49, "Детско-юношеская спортивная школа олимпийского резерва №6" },
                    { 113454, 49, "Школа искусств №6" },
                    { 233441, 49, "Детский сад №6" },
                    { 235240, 49, "Музыкальная школа №5 им. В. В. Знаменского" },
                    { 83163, 49, "Школа №7" },
                    { 101479, 49, "Лицей №7" },
                    { 148114, 49, "Музыкальная школа №7 им. С. В. Рахманинова" },
                    { 134558, 49, "Детско-юношеская спортивная школа олимпийского резерва №7" },
                    { 149865, 49, "Школа №8" },
                    { 20407, 49, "Гимназия №8" },
                    { 171256, 49, "Лицей №8 им. Дягилева" },
                    { 239837, 49, "Школа-интернат №8" },
                    { 140419, 49, "Вечерняя школа №8" },
                    { 281281, 49, "Гимназия №7" },
                    { 15459, 49, "Школа-интернат №53" },
                    { 88457, 49, "Школа №54" },
                    { 51779, 49, "Школа №55" },
                    { 150968, 49, "Лицей №130" },
                    { 99573, 49, "Музыкальная школа №130" },
                    { 21168, 49, "Школа №131" },
                    { 35890, 49, "Школа №132" },
                    { 193531, 49, "Школа №133" },
                    { 4687, 49, "Школа №134" },
                    { 130383, 49, "Школа №135" },
                    { 20488, 49, "Лицей №135" },
                    { 975070, 49, "Детский сад №135 «Радуга»" },
                    { 21171, 49, "Школа №136" },
                    { 1659495, 49, "Школа №137" },
                    { 10973, 49, "Школа №138" },
                    { 57050, 49, "Школа №139" },
                    { 85697, 49, "Школа №140" },
                    { 22867, 49, "Школа №141" },
                    { 38202, 49, "Школа №143" },
                    { 160413, 49, "Школа №144" },
                    { 171997, 49, "Школа №130" },
                    { 56666, 49, "Школа №129" },
                    { 209967, 49, "Школа №128" },
                    { 71033, 49, "Школа №127" },
                    { 26004, 49, "Школа №115" },
                    { 266314, 49, "Школа №116" },
                    { 222101, 49, "Гимназия №116" },
                    { 257526, 49, "Музыкальная школа №116" },
                    { 71189, 49, "Школа №117" },
                    { 232529, 49, "Детский сад №117" },
                    { 244293, 49, "Школа №118" },
                    { 50456, 49, "Школа №119" },
                    { 11109, 49, "Гимназия №144" },
                    { 65476, 49, "Школа №120" },
                    { 12644, 49, "Школа №121" },
                    { 174954, 49, "Гимназия №121" },
                    { 38645, 49, "Школа №122" },
                    { 201199, 49, "Техникум автомобильного транспорта и сервиса (УрТАТиС, бывш. ПУ №122)" },
                    { 113264, 49, "Школа №123" },
                    { 176177, 49, "Профессиональное училище №124" },
                    { 186849, 49, "Школа №125" },
                    { 50190, 49, "Школа-интернат №126" },
                    { 8576, 49, "Гимназия №120" },
                    { 172286, 49, "Школа №114" },
                    { 1343820, 49, "Детский сад №144" },
                    { 14552, 49, "Гимназия №145" },
                    { 193933, 49, "Школа №165" },
                    { 58837, 49, "Школа №166" },
                    { 4746, 49, "Гимназия №166" },
                    { 1280853, 49, "Детский сад №166" },
                    { 46553, 49, "Школа №167" },
                    { 214366, 49, "Школа №168" },
                    { 200597, 49, "Школа №170" },
                    { 42773, 49, "Школа №171" },
                    { 281360, 49, "Школа №173" },
                    { 198782, 49, "Лицей №173" },
                    { 266159, 49, "Школа №174" },
                    { 14950, 49, "Гимназия №174" },
                    { 29880, 49, "Школа №175" },
                    { 211833, 49, "Школа №176" },
                    { 288570, 49, "Гимназия №176" },
                    { 220426, 49, "Школа №177" },
                    { 6035, 49, "Гимназия №177" },
                    { 4480, 49, "Школа №164" },
                    { 214955, 49, "Школа №163" },
                    { 25454, 49, "Школа №162" },
                    { 174678, 49, "Гимназия №161" },
                    { 185854, 49, "Школа №146" },
                    { 124940, 49, "Музыкальная школа №146" },
                    { 12549, 49, "Школа №147" },
                    { 32370, 49, "Школа №148" },
                    { 51162, 49, "Школа №149" },
                    { 27482, 49, "Школа №150" },
                    { 198771, 49, "Школа №151" },
                    { 41674, 49, "Школа №152" },
                    { 129395, 49, "Школа №145" },
                    { 39505, 49, "Музыкальная школа №153" },
                    { 218454, 49, "Школа №155" },
                    { 24072, 49, "Гимназия №155" },
                    { 975069, 49, "Детский сад №155 «Улыбка»" },
                    { 33742, 49, "Школа №156" },
                    { 141028, 49, "Школа №157" },
                    { 1668256, 49, "Школа №158" },
                    { 234568, 49, "Школа №159" },
                    { 33008, 49, "Лицей №159" },
                    { 14824, 49, "Школа №154" },
                    { 292231, 49, "Школа №178" },
                    { 32411, 49, "Школа №113" },
                    { 130501, 49, "Вечерняя школа №111" },
                    { 2739, 49, "Гимназия №70" },
                    { 149456, 49, "Детско-юношеская спортивная школа №70 МРУЦ" },
                    { 40253, 49, "Школа №71" },
                    { 1681738, 49, "Профессиональное училище №71" },
                    { 44664, 49, "Школа №72" },
                    { 109358, 49, "Школа №73" },
                    { 33670, 49, "Школа №74" },
                    { 12505, 49, "Школа №75" },
                    { 185239, 49, "Гимназия №75" },
                    { 153527, 49, "Школа №76" },
                    { 20957, 49, "Школа №77" },
                    { 151386, 49, "Школа №78" },
                    { 2341, 49, "Школа-интернат №78" },
                    { 10568, 49, "Школа №79" },
                    { 216464, 49, "Профессионально-техническое училище №79" },
                    { 44284, 49, "Школа №80" },
                    { 196092, 49, "Гимназия №80" },
                    { 175126, 49, "Школа №70" },
                    { 10255, 49, "Школа №69" },
                    { 275378, 49, "Школа искусств №68" },
                    { 139239, 49, "Профессиональный лицей №68" },
                    { 202270, 49, "Школа №56" },
                    { 168638, 49, "Школа-интернат №56" },
                    { 24041, 49, "Школа №57" },
                    { 121660, 49, "Школа №58" },
                    { 45268, 49, "Школа №59" },
                    { 292452, 49, "Средняя школа им. 60 лет Казахстана" },
                    { 42300, 49, "Школа №60" },
                    { 288498, 49, "Школа №61" },
                    { 83857, 49, "Школа №81" },
                    { 204300, 49, "Уральский железнодорожный техникум (бывш. УрЖЛ, ПТУ №61)" },
                    { 26819, 49, "Школа №63" },
                    { 1016, 49, "Школа №64" },
                    { 52786, 49, "Школа №65" },
                    { 26371, 49, "Школа №66" },
                    { 232515, 49, "Детский сад №66" },
                    { 164796, 49, "Профессиональное училище №66" },
                    { 33207, 49, "Школа №67" },
                    { 9300, 49, "Школа №68" },
                    { 2096, 49, "Школа №62" },
                    { 52745, 49, "Школа №112" },
                    { 173778, 49, "Профессионально-техническое училище №81" },
                    { 3612, 49, "Школа №83" },
                    { 10364, 49, "Школа №100" },
                    { 282857, 49, "Лицей №100" },
                    { 282573, 49, "Школа №101" },
                    { 69651, 49, "Школа №102" },
                    { 44085, 49, "Школа №103" },
                    { 227024, 49, "Школа №104" },
                    { 21347, 49, "Гимназия №104" },
                    { 8825, 49, "Школа №105" },
                    { 51192, 49, "Школа №106" },
                    { 49608, 49, "Школа №107" },
                    { 143730, 49, "Школа №108" },
                    { 26540, 49, "Гимназия №108" },
                    { 207147, 49, "Музыкальная школа №108" },
                    { 39197, 49, "Школа №109" },
                    { 255753, 49, "Лицей №109" },
                    { 15435, 49, "Лицей №110" },
                    { 176376, 49, "Школа №111" },
                    { 6935, 49, "Гимназия №99" },
                    { 50720, 49, "Школа №98" },
                    { 21792, 49, "Школа №97" },
                    { 14332, 49, "Школа №96" },
                    { 106518, 49, "Школа №84" },
                    { 28270, 49, "Школа №85" },
                    { 19832, 49, "Школа №86" },
                    { 220126, 49, "Гимназия №86" },
                    { 10393, 49, "Школа №87" },
                    { 13719, 49, "Школа №88" },
                    { 121180, 49, "Лицей №88" },
                    { 219287, 49, "Школа-интернат №89 для глухих детей" },
                    { 380, 49, "Школа №82" },
                    { 157331, 49, "Школа №90" },
                    { 229390, 49, "Профессиональное училище №91" },
                    { 25706, 49, "Школа №92" },
                    { 23907, 49, "Школа №93" },
                    { 236918, 49, "Школа №94" },
                    { 2366, 49, "Гимназия №94" },
                    { 50177, 49, "Музыкальная школа №94" },
                    { 235875, 49, "Профессионально-техническое училище №94" },
                    { 9018, 49, "Школа №95" },
                    { 23792, 49, "Школа №91" },
                    { 235910, 49, "Юридический колледж при УрГЮА" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 896);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2096);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4480);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5226);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9018);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9095);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10659);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11109);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12549);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13719);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15435);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15803);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21171);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22867);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25490);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26004);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26819);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27482);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32388);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32389);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33897);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40144);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44664);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51162);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51779);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54710);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56155);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64068);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66367);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73209);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74275);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74473);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79683);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82924);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83190);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 94324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 94510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106518);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 121895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122123);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123498);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127056);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129395);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129952);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136705);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137067);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138533);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 146739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151700);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152284);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155457);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156363);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158040);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162161);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163949);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163952);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166581);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174803);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175178);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176177);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185100);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185239);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188110);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188423);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190638);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192536);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192943);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196092);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198782);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200236);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200741);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200745);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 201799);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203053);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203187);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207969);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208556);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210118);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210282);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210509);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211026);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211122);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211684);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214955);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 217384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219920);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222618);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227024);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 229390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236918);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239315);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241103);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241453);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244293);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248729);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255753);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257319);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259067);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259626);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260140);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263119);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 271411);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272104);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272927);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274571);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279272);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279668);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288498);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 289592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291343);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292504);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293294);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295265);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 296381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 310391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 310802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311687);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312691);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 312947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313884);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314072);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 363653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 621158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 653992);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 763313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 777396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 791670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 810946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 851422);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 960919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 975069);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 975070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1046247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1055727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1280853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1291515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1334427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1343821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1611914);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1611916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1654143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1659495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1665458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1666037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1666132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667438);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1668256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1669898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1675203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1681738);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698483);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1709114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1721769);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728445);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1739184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1741628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1743529);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1744041);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1749802);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1750789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758362);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758418);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758419);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1758845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761789);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766343);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767465);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775584);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1776449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777443);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778082);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781629);
        }
    }
}
