using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class AddRostov : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 53101, 119, "Школа №1" },
                    { 346051, 119, "Детский сад «Солнышко»" },
                    { 429335, 119, "Детский сад «Золотая рыбка»" },
                    { 294694, 119, "Детский сад «Зайчик»" },
                    { 137188, 119, "Дворец творчества детей и молодежи" },
                    { 207001, 119, "Гимназия ЮРГУЭС" },
                    { 135270, 119, "Гимназия юных исследователей (бывш. Лицей юных исследователей)" },
                    { 232721, 119, "Гимназия им. А. С. Пушкина" },
                    { 1471662, 119, "Гимназия ДГТУ" },
                    { 130810, 119, "Гимназия «Эстус»" },
                    { 332296, 119, "Детский сад «Соловушки»" },
                    { 334296, 119, "Гимназия «Эрудит»" },
                    { 254358, 119, "Гимназия «Ор-Авнер»" },
                    { 66994, 119, "Гимназия «Долина тишины»" },
                    { 97883, 119, "Гидрометеорологический техникум (РГМТ)" },
                    { 167848, 119, "Воскресная школа" },
                    { 170009, 119, "Военно-технический лицей (РГВТЛ) при РВИРВ им. маршала Неделина" },
                    { 1764049, 119, "Академия стиля Mozart Art House" },
                    { 1757034, 119, "Академия «Индустрия красоты»" },
                    { 1705599, 119, "Автошкола ДОСААФ" },
                    { 103908, 119, "Автотранспортный колледж (РАТК, бывш. РАТТ)" },
                    { 222306, 119, "Гимназия «Развитие»" },
                    { 111853, 119, "Автодорожный колледж (РАДК)" },
                    { 271333, 119, "Детско-юношеская спортивная школа «Юность России»" },
                    { 1678906, 119, "Донская духовная семинария (ДДС)" },
                    { 169264, 119, "Колледж радиоэлектронного приборостроения (РКРП)" },
                    { 325589, 119, "Колледж радиотехники, информационных и промышленных технологий (РКРИПТ, бывш. РРТТ)" },
                    { 1777426, 119, "Колледж противопожарной и спасательной служб" },
                    { 153350, 119, "Колледж при РГЭУ РИНХ" },
                    { 97957, 119, "Колледж права и социальной безопасности РИЗП (бывш. Правовой)" },
                    { 131192, 119, "Колледж МЭСИ" },
                    { 67406, 119, "Колледж культуры (РКК)" },
                    { 120393, 119, "Колледж ИУБиП" },
                    { 346681, 119, "Колледж искусств (РКИ, бывш. РУИ, РОГУИ)" },
                    { 184501, 119, "Детско-юношеская спортивная школа олимпийского резерва «Радуга»" },
                    { 238973, 119, "Колледж информатизации и управления (РКИУ)" },
                    { 188621, 119, "Казачья гимназия им. Я. П. Бакланова" },
                    { 166246, 119, "Кадетская школа спасателей (РКШС)" },
                    { 658585, 119, "Информационно-технологический лицей (ИТЛ)" },
                    { 152643, 119, "Инженерно-педагогический комплекс (ИПК)" },
                    { 67410, 119, "Донской педагогический колледж" },
                    { 97243, 119, "Донской областной гуманитарный лицей" },
                    { 103553, 119, "Донской кадетский корпус им. Николая II" },
                    { 342392, 119, "Донской банковский техникум (бывш. Банк-лицей)" },
                    { 339195, 119, "Донская реальная гимназия (ДРГ)" },
                    { 154002, 119, "Колледж автоматизации и технологии" },
                    { 489433, 119, "Колледж Российской академии правосудия" },
                    { 341266, 119, "Авиационный колледж ДГТУ (РАК)" },
                    { 339510, 119, "Детский сад №288 «Звёздный»" },
                    { 204932, 119, "Школа №110" },
                    { 22127, 119, "Школа №109" },
                    { 214635, 119, "Школа №107" },
                    { 173158, 119, "Школа №106" },
                    { 51462, 119, "Школа №105" },
                    { 17946, 119, "Школа №104" },
                    { 239734, 119, "Лицей №103" },
                    { 17268, 119, "Школа №103" },
                    { 5462, 119, "Лицей №102 (бывш. Школа)" },
                    { 178739, 119, "Школа №111" },
                    { 250439, 119, "Профессиональный лицей №101" },
                    { 23843, 119, "Школа №100" },
                    { 1572, 119, "Школа №99" },
                    { 73569, 119, "Школа №98" },
                    { 1641585, 119, "Детский сад №97" },
                    { 191676, 119, "Школа №97" },
                    { 41202, 119, "Школа «Эврика-Развитие» им. М. В. Нагибина (бывш. школа №96)" },
                    { 321224, 119, "Школа №95" },
                    { 320268, 119, "Школа №94" },
                    { 15736, 119, "Школа №93" },
                    { 15507, 119, "Школа №101" },
                    { 1539276, 119, "Детский сад №321" },
                    { 7474, 119, "Школа №112" },
                    { 30834, 119, "Школа №114" },
                    { 786200, 119, "Детский сад №273 «Нептун»" },
                    { 1757987, 119, "Детский сад №251 «Колосок»" },
                    { 291406, 119, "Детский сад №237 «Колокольчик»" },
                    { 267387, 119, "Детский сад №233 «Дельфинёнок»" },
                    { 1682199, 119, "Детский сад №227 «Снегирёк»" },
                    { 277827, 119, "Детский сад №211" },
                    { 1661358, 119, "Детский сад №173 «Берёзка»" },
                    { 267016, 119, "Детский сад №164 «Улыбка»" },
                    { 1664499, 119, "Детский сад №142 «Тополёк»" },
                    { 37734, 119, "Школа №113" },
                    { 785821, 119, "Детский сад №136" },
                    { 1732545, 119, "Детский сад №130 «Тюльпанчик»" },
                    { 221204, 119, "Школа №123" },
                    { 884831, 119, "Детский сад №122" },
                    { 1777391, 119, "Детский сад №118 «Ручеек»" },
                    { 16280, 119, "Гимназия №118 им. В. Н. Цыганова" },
                    { 346383, 119, "Гимназия №117" },
                    { 338813, 119, "Школа №117" },
                    { 80318, 119, "Школа №116" },
                    { 113055, 119, "Школа №115" },
                    { 103894, 119, "Школа №133" },
                    { 41097, 119, "Школа №92" },
                    { 197163, 119, "Колледж связи и информатики (РКСИ, бывш. РПС)" },
                    { 197734, 119, "Колледж экономики и управления (КЭУ) при СКАГС" },
                    { 1127008, 119, "Учебный центр Госкомстата России" },
                    { 245385, 119, "Учебный центр «Ростовский РУПК»" },
                    { 1678260, 119, "Учебный центр «Альтернатива»" },
                    { 76120, 119, "Торгово-экономический колледж (РТЭК)" },
                    { 71825, 119, "Технический лицей при ДГТУ" },
                    { 188153, 119, "Технический колледж водного транспорта (РТКВТ)" },
                    { 1780487, 119, "Техникум РГУПС" },
                    { 317798, 119, "Техникум парикмахерского искусства и эстетики" },
                    { 132159, 119, "Техникум кино и телевидения (РТКиТ)" },
                    { 207223, 119, "Финансово-экономический колледж (РФЭК)" },
                    { 236505, 119, "Техникум индустрии моды, экономики и сервиса (РТИМЭС, бывш. РТТЛП)" },
                    { 249506, 119, "Суворовское военное училище (СВУ)" },
                    { 258198, 119, "Строительный колледж (РСК)" },
                    { 181813, 119, "Специальная музыкальная школа при РГК им. Рахманинова" },
                    { 204334, 119, "Святогеоргиевская православная классическая гимназия" },
                    { 122085, 119, "Саноторно-лесная школа" },
                    { 177929, 119, "Санаторная областная школа-интернат" },
                    { 337944, 119, "Ростовское областное училище (колледж) олимпийского резерва (РОУОР)" },
                    { 1781462, 119, "Ростовский-на-Дону железнодорожный техникум" },
                    { 1778535, 119, "Ростовский технологический техникум сервиса" },
                    { 220478, 119, "Техникум железнодорожного транспорта (РТЖТ)" },
                    { 208882, 119, "Ростовский базовый медицинский колледж (РБМК)" },
                    { 1689590, 119, "Фотошкола «Make Moments»" },
                    { 166364, 119, "Художественная школа им. Чиненовых" },
                    { 1656994, 119, "Юридическая гимназия им. М. М. Сперанского" },
                    { 55081, 119, "Электротехнический колледж (РЭТК)" },
                    { 157537, 119, "Экспериментальная музыкальная школа при РУИ" },
                    { 17985, 119, "Экономический лицей (РГЭЛ)" },
                    { 1541359, 119, "Экономический колледж ЮФУ" },
                    { 261480, 119, "Экономический колледж ИЭ и ВЭС" },
                    { 187078, 119, "Экономико-правовой колледж (ЭПК) при РГПУ" },
                    { 373550, 119, "Школа парикмахерского искусства «Россиянка»" },
                    { 1719636, 119, "Школа ногтевого дизайна Екатерины Мирошниченко" },
                    { 316996, 119, "Хореографическое училище" },
                    { 178089, 119, "Школа искусств им. Глинки" },
                    { 41876, 119, "Школа «Финист»" },
                    { 143017, 119, "Школа «Ор-Менахем»" },
                    { 43416, 119, "Школа «Ликей»" },
                    { 114690, 119, "Школа «Источник»" },
                    { 144835, 119, "Школа «Знание»" },
                    { 122331, 119, "Школа «Азъ Буки Веди»" },
                    { 1486431, 119, "Школа «Азбука»" },
                    { 264849, 119, "Художественное училище (РХУ) им. М. Б. Грекова" },
                    { 148911, 119, "Художественная школа при РГПУ" },
                    { 1486430, 119, "Школа английского языка «English First»" },
                    { 140468, 119, "Колледж управления и финансов (КУФ ЮФУ)" },
                    { 1769205, 119, "Ростовская школа служебно-розыскного собаководства МВД России" },
                    { 222094, 119, "Педагогическое училище" },
                    { 18290, 119, "Лицей при РКСИ" },
                    { 215609, 119, "Лицей при РГУПС" },
                    { 258555, 119, "Лицей при РГСУ" },
                    { 72773, 119, "Лицей при РГМУ" },
                    { 77408, 119, "Лицей при РГК им. С. В. Рахманинова" },
                    { 215448, 119, "Лицей при ИМБ" },
                    { 43608, 119, "Лицей при ДГТУ" },
                    { 62826, 119, "Лицей Международного факультета ДГТУ" },
                    { 138607, 119, "Лицей математики и менеджмента (МиМ)" },
                    { 1765235, 119, "Лицей ЮФУ" },
                    { 1759696, 119, "Лицей КЭО" },
                    { 129092, 119, "Лицей информационных технологий (ЛИТ) при РВИРВСН" },
                    { 340449, 119, "Лицей «Экономика»" },
                    { 61123, 119, "Лицей «Новая школа»" },
                    { 147635, 119, "Лицей «Кораблик»" },
                    { 173505, 119, "Лицей «Данко» (при РГЭУ)" },
                    { 71849, 119, "Лицей «XXI век»" },
                    { 109526, 119, "Кооперативный техникум (РКТ)" },
                    { 222307, 119, "Коммерческий лицей" },
                    { 137410, 119, "Колледж экономики, управления и права (ЭУП) ДГТУ" },
                    { 1767200, 119, "Лицей классического элитарного образования (Лицей КЭО)" },
                    { 161636, 119, "Речное училище (РРУ)" },
                    { 133534, 119, "Машиностроительный колледж (РМК)" },
                    { 403084, 119, "Медицинское училище (РМУ) СКЖД" },
                    { 239019, 119, "Педагогический лицей" },
                    { 1522454, 119, "Областной центр образования неслышащих учащихся (РОЦОНУ)" },
                    { 1764316, 119, "Областной центр дополнительного образования детей (ОЦДОД)" },
                    { 79562, 119, "Музыкальная школа при ДТМ" },
                    { 79405, 119, "Музыкальная школа при ДДТ" },
                    { 131052, 119, "Музыкальная школа им. Чайковского" },
                    { 280369, 119, "Музыкальная школа им. Римского-Корсакова" },
                    { 147882, 119, "Музыкальная школа им. Прокофьева" },
                    { 313979, 119, "Музыкальная школа им. Назаретова" },
                    { 595428, 119, "Медицинский колледж при РГМУ" },
                    { 38781, 119, "Музыкальная школа им. Ипполитова-Иванова" },
                    { 294980, 119, "Музыкальная школа им. Артамонова" },
                    { 98031, 119, "Мужская казачья гимназия" },
                    { 66675, 119, "Морской колледж (РМК) им. Г. Я. Седова" },
                    { 620359, 119, "Мореходное училище МРХ (РМУ)" },
                    { 166063, 119, "Многопрофильный лицей" },
                    { 1539117, 119, "Миссионерское духовное училище (РДМУ)" },
                    { 1775873, 119, "Межшкольный учебный комбинат Ворошиловского района" },
                    { 1708582, 119, "Межрегиональный центр подготовки специалистов" },
                    { 91639, 119, "Международная школа «Алла Прима»" },
                    { 58956, 119, "Музыкальная школа им. Гнесина" },
                    { 185344, 119, "Юридический колледж (РЮК) СКАГС" },
                    { 178330, 119, "Школа №91" },
                    { 1280437, 119, "Профессиональный лицей №89" },
                    { 292860, 119, "Лицей №13" },
                    { 338373, 119, "Профессиональное училище №12" },
                    { 156934, 119, "Вечерняя школа №12" },
                    { 184552, 119, "Гимназия «Гармония-12»" },
                    { 147065, 119, "Гимназия №12" },
                    { 218676, 119, "Школа №12" },
                    { 200467, 119, "Вечерняя школа №11" },
                    { 25701, 119, "Лицей №11" },
                    { 68317, 119, "Школа №11" },
                    { 1708846, 119, "Вечерняя школа №13" },
                    { 48243, 119, "Строительно-художественный техникум (РСХТ, бывш. ПЛ №10)" },
                    { 250637, 119, "Детско-юношеская спортивная школа олимпийского резерва №10" },
                    { 254337, 119, "Музыкальная школа №10 им. Рахманинова" },
                    { 60202, 119, "Вечерняя школа №10" },
                    { 203205, 119, "Школа-интернат №10" },
                    { 88608, 119, "Школа №10" },
                    { 344011, 119, "Школа искусств №9" },
                    { 344021, 119, "Профессиональное училище №9" },
                    { 44099, 119, "Школа №9" },
                    { 276966, 119, "Школа искусств №8" },
                    { 46228, 119, "Детско-юношеская спортивная школа №10" },
                    { 193011, 119, "Детско-юношеская спортивная школа олимпийского резерва №8" },
                    { 245833, 119, "Профессиональное училище №13" },
                    { 52317, 119, "Гимназия №14" },
                    { 119837, 119, "Профессионально-техническое училище №20" },
                    { 17524, 119, "Лицей №20 (Школа №20)" },
                    { 794287, 119, "Детский сад №19" },
                    { 330755, 119, "Профессиональный лицей №19 «Банк-лицей»" },
                    { 169158, 119, "Детско-юношеская спортивная школа олимпийского резерва №19" },
                    { 194420, 119, "Лицей №19" },
                    { 199446, 119, "Гимназия №19" },
                    { 52909, 119, "Школа №19" },
                    { 251823, 119, "Профессионально-техническое училище №18" },
                    { 234772, 119, "Школа №14" },
                    { 4195, 119, "Школа №18" },
                    { 1436468, 119, "Колледж рекламы, сервиса и туризма «Сократ» (бывш. ПЛ №17)" },
                    { 54632, 119, "Школа №17" },
                    { 254740, 119, "Профессиональное училище №16" },
                    { 47656, 119, "Школа №16" },
                    { 155314, 119, "Профессиональное училище №15" },
                    { 175116, 119, "Гимназия №15" },
                    { 41488, 119, "Школа №15" },
                    { 1737671, 119, "Колледж водного транспорта (РКВТ, бывш. ПЛВТ №14)" },
                    { 142502, 119, "Лицей №14" },
                    { 144382, 119, "Профессионально-техническое училище №17" },
                    { 193732, 119, "Школа №21" },
                    { 157017, 119, "Музыкальная школа №8" },
                    { 18585, 119, "Школа №8" },
                    { 169484, 119, "Детско-юношеская спортивная школа №3" },
                    { 164810, 119, "Музыкальная школа №3 им. М. И. Глинки" },
                    { 330221, 119, "Вечерняя школа №3" },
                    { 248480, 119, "Лицей №3" },
                    { 243850, 119, "Гимназия №3" },
                    { 41111, 119, "Школа №3" },
                    { 150331, 119, "Профессиональное училище №2" },
                    { 804145, 119, "Детский сад №2 «Ивушка»" },
                    { 336520, 119, "Промышленно-экономическое училище №2 (РПЭУ)" },
                    { 178099, 119, "Профессиональный лицей №3" },
                    { 316998, 119, "Художественная школа №2" },
                    { 174653, 119, "Школа №2" },
                    { 242974, 119, "Детский сад №1" },
                    { 58035, 119, "Школа искусств №1" },
                    { 262628, 119, "Художественная школа №1" },
                    { 988229, 119, "Детско-юношеская спортивная школа олимпийского резерва №1" },
                    { 133031, 119, "Музыкальная школа №1" },
                    { 119810, 119, "Лицей №1 при РГУ" },
                    { 266657, 119, "Гимназия №1" },
                    { 327015, 119, "Колледж металлообработки и автосервиса (РКМиА, бывш. Профессиональный лицей №1)" },
                    { 204993, 119, "Гимназия №2" },
                    { 213936, 119, "Вечерняя школа №8" },
                    { 202408, 119, "Школа №4" },
                    { 135716, 119, "Детско-юношеская спортивная школа №4" },
                    { 248434, 119, "Донской промышленно-технический колледж (Профессиональное училище №8)" },
                    { 225111, 119, "Профессионально-техническое училище №7" },
                    { 76995, 119, "Детско-юношеская спортивная школа олимпийского резерва №7" },
                    { 157366, 119, "Детско-юношеская спортивная школа №7" },
                    { 57722, 119, "Музыкальная школа №7" },
                    { 52535, 119, "Лицей №7" },
                    { 11360, 119, "Школа №7" },
                    { 250681, 119, "Профессиональный лицей №6" },
                    { 184864, 119, "Детско-юношеская спортивная школа олимпийского резерва №6" },
                    { 99845, 119, "Лицей №4" },
                    { 15663, 119, "Музыкальная школа №6 им. Г. В. Свиридова" },
                    { 340093, 119, "Лицей №6" },
                    { 205827, 119, "Гимназия №6" },
                    { 10505, 119, "Школа №6" },
                    { 218121, 119, "Профессионально-техническое училище №5" },
                    { 130519, 119, "Детско-юношеская спортивная школа олимпийского резерва №5" },
                    { 321386, 119, "Детско-юношеская спортивная школа №5" },
                    { 49834, 119, "Вечерняя школа №5" },
                    { 268939, 119, "Гимназия №5" },
                    { 334127, 119, "Школа №5" },
                    { 318320, 119, "Вечерняя школа №6" },
                    { 24666, 119, "Школа №90" },
                    { 88228, 119, "Профессиональный лицей №21 (ПЛМО)" },
                    { 67409, 119, "Школа №23" },
                    { 16505, 119, "Школа №67" },
                    { 111193, 119, "Профессиональное училище №66" },
                    { 75156, 119, "Школа №66" },
                    { 271245, 119, "Школа №65" },
                    { 76516, 119, "Профессионально-техническое училище №64" },
                    { 166433, 119, "Школа №64" },
                    { 95709, 119, "Школа-интернат музыкантских воспитанников №63" },
                    { 34382, 119, "Школа №63" },
                    { 40859, 119, "Школа №62" },
                    { 28759, 119, "Школа №68" },
                    { 6451, 119, "Школа №61" },
                    { 78289, 119, "Школа №59" },
                    { 212246, 119, "Школа №58" },
                    { 1291522, 119, "Лицей №57" },
                    { 5257, 119, "Школа №57" },
                    { 92569, 119, "Школа №56" },
                    { 254540, 119, "Гимназия №55" },
                    { 28724, 119, "Школа №55" },
                    { 8893, 119, "Школа №54" },
                    { 193494, 119, "Школа №53" },
                    { 144229, 119, "Школа №60" },
                    { 341795, 119, "Школа искусств №52" },
                    { 19985, 119, "Школа №69" },
                    { 54560, 119, "Школа №70" },
                    { 110758, 119, "Школа №88" },
                    { 18547, 119, "Школа №87" },
                    { 25973, 119, "Школа №86" },
                    { 119264, 119, "Школа №85" },
                    { 165831, 119, "Школа №84" },
                    { 42010, 119, "Школа №83" },
                    { 59447, 119, "Школа №82" },
                    { 173159, 119, "Школа №81" },
                    { 26094, 119, "Школа №80 им. Героя Советского Союза Р. Зорге" },
                    { 313413, 119, "Профессионально-техническое училище №69" },
                    { 243982, 119, "Донской техникум кулинарного искусства и бизнеса (бывш. Профессиональный лицей №79, ПЛКИБ)" },
                    { 119838, 119, "Профессионально-техническое училище №78" },
                    { 27974, 119, "Школа №78" },
                    { 18960, 119, "Школа №77" },
                    { 343271, 119, "Гимназия №76 (бывш. школа №76)" },
                    { 13134, 119, "Школа №75" },
                    { 85494, 119, "Школа №74" },
                    { 59971, 119, "Школа №73" },
                    { 218835, 119, "Школа №72" },
                    { 37709, 119, "Школа №71" },
                    { 247399, 119, "Школа №79" },
                    { 268956, 119, "Школа №22" },
                    { 210501, 119, "Профессиональное училище №52" },
                    { 29031, 119, "Лицей №51 им. Б. В. Капустина (бывш. школа №51)" },
                    { 313667, 119, "Школа №36" },
                    { 277720, 119, "Гимназия №35" },
                    { 16210, 119, "Школа №35" },
                    { 222319, 119, "Гимназия №34" },
                    { 1332, 119, "Школа №34" },
                    { 9953, 119, "Лицей №33" },
                    { 188811, 119, "Школа №33" },
                    { 326545, 119, "Школа №32" },
                    { 33400, 119, "Школа №31" },
                    { 16436, 119, "Гимназия №36" },
                    { 22116, 119, "Школа №30" },
                    { 318850, 119, "Школа-интернат №28" },
                    { 200617, 119, "Школа №28" },
                    { 335840, 119, "Лицей №27 им. А. В. Суворова" },
                    { 17253, 119, "Школа №27" },
                    { 247114, 119, "Школа №26" },
                    { 232859, 119, "Гимназия №25" },
                    { 15425, 119, "Школа №25" },
                    { 20314, 119, "Школа №24" },
                    { 1667759, 119, "Вечерняя школа №23" },
                    { 60606, 119, "Школа №29" },
                    { 3255, 119, "Гимназия №52 им. А. А. Печерского (бывш. школа №52)" },
                    { 245863, 119, "Школа №37" },
                    { 113424, 119, "Школа №38" },
                    { 806820, 119, "Профессиональное училище №50" },
                    { 23818, 119, "Школа №50" },
                    { 332701, 119, "Школа №49" },
                    { 238597, 119, "Детский сад №48 «Светлячок»" },
                    { 165572, 119, "Школа-интернат №48" },
                    { 24549, 119, "Школа №47" },
                    { 15662, 119, "Гимназия №46" },
                    { 2474, 119, "Гимназия №45" },
                    { 240415, 119, "Школа №45" },
                    { 220212, 119, "Лицей №37" },
                    { 8892, 119, "Школа №44" },
                    { 266341, 119, "Лицей №43" },
                    { 174256, 119, "Школа №43" },
                    { 132220, 119, "Школа №42" },
                    { 184603, 119, "Школа №41" },
                    { 106012, 119, "Лицей №40" },
                    { 250129, 119, "Школа №40" },
                    { 17903, 119, "Школа №39" },
                    { 264954, 119, "Музыкальная школа №38" },
                    { 53971, 119, "Школа-интернат №38" },
                    { 178514, 119, "Профессиональный лицей №43" },
                    { 163214, 119, "Юридический лицей при РГУ" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1332);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5257);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6451);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7474);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8892);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9953);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16436);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17253);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17524);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17903);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18960);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24549);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25701);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43416);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47656);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49834);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52909);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58035);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59971);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60606);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61123);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62826);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67409);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68317);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76516);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76995);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 79562);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80318);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88608);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92569);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 97957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99845);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103553);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 106012);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114690);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129092);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131192);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133534);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137410);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144382);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157017);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166063);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166364);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173158);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178089);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184603);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188621);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204334);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 208882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 214635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 218835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220212);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220478);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222094);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222306);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222307);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222319);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 236505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239019);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243982);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245833);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245863);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247114);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 247399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248480);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249506);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250129);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250439);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251823);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254540);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258555);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261480);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262628);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266657);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 271245);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 271333);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277720);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277827);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292860);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313667);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 313979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 316998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 317798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 321386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 325589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 326545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 327015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 330221);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 330755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 332296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 332701);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334296);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335840);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 336520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 337944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 338373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 338813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339195);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 340093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 340449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 342392);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 343271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344011);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 344021);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 346051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 346383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 346681);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 373550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 403084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 429335);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489433);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 595428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 620359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 658585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 785821);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 786200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 794287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 804145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 806820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 884831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 988229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1127008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1280437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1291522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1436468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1471662);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1486431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1522454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1539117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1539276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1541359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1641585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656994);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1664499);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1678260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1678906);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1682199);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1689590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1708582);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1708846);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1719636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1732545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1737671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759696);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1765235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775873);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781462);
        }
    }
}
