using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class PermSchools : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 148456, 110, "Школа искусств №1" },
                    { 198259, 110, "Школа №140" },
                    { 52758, 110, "Гимназия №139" },
                    { 6859, 110, "Школа №138" },
                    { 215059, 110, "Школа №137" },
                    { 64851, 110, "Школа №136" },
                    { 91102, 110, "Школа №135" },
                    { 9029, 110, "Школа №134" },
                    { 20852, 110, "Школа №133" },
                    { 38530, 110, "Школа №132" },
                    { 60989, 110, "Школа №131" },
                    { 125724, 110, "Школа №130" },
                    { 64393, 110, "Школа №129" },
                    { 73231, 110, "Школа №128" },
                    { 351287, 110, "Школа №127" },
                    { 51999, 110, "Школа №125" },
                    { 8574, 110, "Школа №124" },
                    { 199660, 110, "Школа №123" },
                    { 207711, 110, "Школа №122" },
                    { 31768, 110, "Школа №121" },
                    { 21949, 110, "Школа №120" },
                    { 13084, 110, "Школа №119" },
                    { 194763, 110, "Школа №141" },
                    { 110669, 110, "Школа №142" },
                    { 57426, 110, "Школа №143" },
                    { 172165, 110, "Школа №144" },
                    { 491031, 110, "Детский сад №415" },
                    { 1662859, 110, "Детский сад №395" },
                    { 1282143, 110, "Детский сад №365" },
                    { 120283, 110, "Школа №363" },
                    { 785824, 110, "Детский сад №357" },
                    { 743713, 110, "Детский сад №329" },
                    { 334900, 110, "Детский сад №295" },
                    { 354945, 110, "Детский сад №287" },
                    { 1501589, 110, "Детский сад №227" },
                    { 743714, 110, "Детский сад №186" },
                    { 38377, 110, "Школа №118" },
                    { 1496526, 110, "Детский сад №173" },
                    { 80781, 110, "Школа №155" },
                    { 27313, 110, "Школа №154" },
                    { 16650, 110, "Школа №153" },
                    { 1714948, 110, "Школа №152" },
                    { 26610, 110, "Школа №151" },
                    { 46396, 110, "Школа №149" },
                    { 115304, 110, "Школа №148" },
                    { 164172, 110, "Школа №147" },
                    { 174243, 110, "Школа №146" },
                    { 12393, 110, "Школа №145" },
                    { 184375, 110, "Школа №156" },
                    { 48280, 110, "Школа №117" },
                    { 16050, 110, "Школа №116" },
                    { 27266, 110, "Школа №115" },
                    { 275592, 110, "Школа №95" },
                    { 16033, 110, "Школа №94" },
                    { 252907, 110, "Школа №93" },
                    { 359421, 110, "Школа №92" },
                    { 15455, 110, "Школа №91" },
                    { 224766, 110, "Гимназия №90" },
                    { 51945, 110, "Школа №90" },
                    { 15393, 110, "Школа №89" },
                    { 52855, 110, "Школа №88" },
                    { 151080, 110, "Профессиональное училище №88" },
                    { 9944, 110, "Школа №96" },
                    { 241722, 110, "Училище №87" },
                    { 32908, 110, "Школа №86" },
                    { 352977, 110, "Школа-интернат №85" },
                    { 41609, 110, "Школа №85" },
                    { 283675, 110, "Профессиональное училище №85" },
                    { 168326, 110, "Школа №84" },
                    { 205850, 110, "Школа №83" },
                    { 245772, 110, "Школа №82" },
                    { 21039, 110, "Школа №81" },
                    { 8573, 110, "Школа №80" },
                    { 101763, 110, "Школа №79" },
                    { 45049, 110, "Школа №87" },
                    { 1656251, 110, "Детский сад №418" },
                    { 40732, 110, "Школа №97" },
                    { 63365, 110, "Школа №99" },
                    { 58233, 110, "Школа №114" },
                    { 329862, 110, "Лицей №113" },
                    { 288229, 110, "Школа №112 «Город дорог»" },
                    { 36427, 110, "Школа №111" },
                    { 1715785, 110, "Детский сад №111" },
                    { 46517, 110, "Школа №110" },
                    { 242815, 110, "Профессионально-техническое училище №110" },
                    { 26650, 110, "Школа №109" },
                    { 138198, 110, "Музыкальная школа при шк. №109" },
                    { 39085, 110, "Школа №108" },
                    { 87514, 110, "Школа №98" },
                    { 54980, 110, "Школа №107" },
                    { 352193, 110, "Колледж транспорта и сервиса (бывш. Профессионально-техническое училище №106)" },
                    { 50108, 110, "Школа №105" },
                    { 111545, 110, "Музыкальная школа №105" },
                    { 8570, 110, "Школа №104" },
                    { 98173, 110, "Школа №103 (суворовская)" },
                    { 965337, 110, "Детский сад №103" },
                    { 10111, 110, "Школа №102" },
                    { 28368, 110, "Школа №101" },
                    { 351641, 110, "Детский сад №100" },
                    { 37378, 110, "Школа №100" },
                    { 171889, 110, "Школа №106" },
                    { 57758, 110, "Гимназия №79" },
                    { 235585, 110, "Авиационный техникум (ПАТ) им. А. Д. Швецова" },
                    { 1705598, 110, "Автошкола ДОСААФ" },
                    { 134372, 110, "Торгово-технологический колледж (ПГТТК)" },
                    { 152259, 110, "Технологический колледж (ПГТК)" },
                    { 1781857, 110, "Техно-Школа им. В. П. Савиных" },
                    { 179575, 110, "Техникум советской торговли (ПТСТ)" },
                    { 270444, 110, "Техникум профессиональных технологий и дизайна (ПТПТиД)" },
                    { 123929, 110, "Строительный колледж (ПСК)" },
                    { 350686, 110, "Специальная школа Минюста РФ (ПССШ)" },
                    { 90743, 110, "Специализированная гуманитарная школа (ПСГШ)" },
                    { 1777704, 110, "СинТез" },
                    { 70985, 110, "Речное училище (ПРУ, ПФ ВГУВТ)" },
                    { 147832, 110, "Радиотехнический колледж (ПРК)" },
                    { 1735237, 110, "Профессиональное училище «Уральское подворье»" },
                    { 89241, 110, "Профессионально-педагогический колледж (ПГППК)" },
                    { 120510, 110, "Прикамский современный социально-гуманитарный колледж (ПССГК)" },
                    { 489238, 110, "Православная классическая гимназия (ППКГ)" },
                    { 137175, 110, "Политехнический колледж им. Славянова (ППК)" },
                    { 167097, 110, "Пермский машиностроительный колледж (бывш. Промышленно-коммерческий колледж)" },
                    { 209964, 110, "Пермский институт железнодорожного транспорта УрГУПС (бывш. ПТЖТ)" },
                    { 1761986, 110, "Пермский институт (филиал) РЭУ им. Плеханова (СПО)" },
                    { 1759877, 110, "Палата налоговых консультантов" },
                    { 186229, 110, "Областная гимназия" },
                    { 119074, 110, "Торгово-экономический техникум (ПТЭТ)" },
                    { 1759647, 110, "Учебно-курсовой комбинат «Меркурий»" },
                    { 1667979, 110, "Учебный аттестационный центр" },
                    { 1767510, 110, "Учебный комбинат потребительской кооперации" },
                    { 93500, 110, "Экономический колледж при ПГУ" },
                    { 104744, 110, "Экологическая гимназия" },
                    { 1679261, 110, "Школа-интернат для незрячих и слабовидящих детей" },
                    { 1779440, 110, "Школа-интернат для детей с нарушением слуха и речи" },
                    { 1771679, 110, "Школа развития личности" },
                    { 89980, 110, "Школа журналистики при ПГУ" },
                    { 1660809, 110, "Школа допрофессиональной милицейской подготовки" },
                    { 1766739, 110, "Школа дизайна «Точка»" },
                    { 80523, 110, "Школа «София»" },
                    { 164251, 110, "Школа «Ор Авнер»" },
                    { 1771563, 110, "Нью-Йоркский Институт Фотографии (NYIP) Distance Education Russia" },
                    { 13773, 110, "Школа «Мозаика»" },
                    { 118147, 110, "Школа «Инако»" },
                    { 78531, 110, "Центр образования" },
                    { 139071, 110, "Художественная школа «Март»" },
                    { 65154, 110, "Хоровая капелла мальчиков и юношей" },
                    { 206125, 110, "Хореографическое училище (ПГХУ)" },
                    { 110861, 110, "Химико-технологический техникум (ПХТТ)" },
                    { 1766124, 110, "Фотошкола Laboratory" },
                    { 194184, 110, "Финансово-экономический колледж (ПФЭК)" },
                    { 1734766, 110, "Финансово-экономический колледж (НОУ СПО ФЭК)" },
                    { 178281, 110, "Физико-математическая заочная школа (ОЗФМШ)" },
                    { 1764491, 110, "Школа «Мастерград»" },
                    { 88106, 110, "Нефтяной колледж (ПНК)" },
                    { 203786, 110, "Музыкальное училище (ПМУ)" },
                    { 129081, 110, "Музыкально-педагогическое училище (ПМПУ)" },
                    { 1316749, 110, "Колледж «Оникс»" },
                    { 111649, 110, "Колледж «Альтер»" },
                    { 1725228, 110, "Кадетский корпус ПФО им. Ф. Кузьмина" },
                    { 287386, 110, "Кадетский корпус (ПКК) им. А. В. Суворова" },
                    { 207693, 110, "Кадетская школа (ПКШ)" },
                    { 1757378, 110, "Исламский колледж" },
                    { 1766715, 110, "Институт развития образования Пермского края" },
                    { 1663693, 110, "Западно-Уральский горный техникум (бывш. ПГТ)" },
                    { 13771, 110, "Европейская школа «Ex Professo»" },
                    { 1037086, 110, "Духовное училище (ПДУ)" },
                    { 224947, 110, "Колледж «Стандарт»" },
                    { 288839, 110, "Джазовый техникум (ПДТ)" },
                    { 111070, 110, "Детско-юношеская спортивная школа олимпийского резерва «Орленок»" },
                    { 68336, 110, "Детско-юношеская спортивная школа олимпийского резерва «Звезда»" },
                    { 206612, 110, "Детско-юношеская спортивная школа «Урал Грейт Юниор»" },
                    { 135441, 110, "Детско-юношеская спортивная школа «Олимпиец»" },
                    { 242615, 110, "Гуманитарный колледж при АПУ (ПФ)" },
                    { 192318, 110, "Гуманитарная заочная школа (ОЗГШ)" },
                    { 6713, 110, "Гимназия «Ювента»" },
                    { 108868, 110, "Гимназия «Via Elenae»" },
                    { 73865, 110, "Военное авиационно-техническое училище (ВАТУ)" },
                    { 154824, 110, "Академическая школа информационных технологий (бывш. КИТ) при ПГУ" },
                    { 1750875, 110, "Детско-юношеский центр «Рифей»" },
                    { 209981, 110, "Автотранспортный колледж (ПГАК)" },
                    { 161798, 110, "Колледж Гуманитарно-технологического института (ПГТИ)" },
                    { 122880, 110, "Колледж при  ПИ (ф) РГТЭУ" },
                    { 145413, 110, "Музыкальная школа при ПМУ" },
                    { 1666258, 110, "Музыкальная школа при ПКДНТ" },
                    { 408520, 110, "Музыкальная школа при ДТЮ" },
                    { 704577, 110, "Медицинское училище (ПМУ)" },
                    { 177788, 110, "Медицинский лицей  при ПБМК" },
                    { 98224, 110, "Медицинский колледж (ПБМК)" },
                    { 196243, 110, "Медико-фармацевтическое училище (ПМФУ)" },
                    { 174134, 110, "Лицей при СИМОР" },
                    { 28369, 110, "Лицей при ППКК" },
                    { 311704, 110, "Лицей полиции им. Ф. Кузьмина (ППМ)" },
                    { 228115, 110, "Колледж искусств и культуры (ПККИК)" },
                    { 278493, 110, "Лицей бухгалтерского учета и статистики" },
                    { 1069005, 110, "Краевой колледж предпринимательства (ККП)" },
                    { 1751460, 110, "Краевой индустриальный техникум" },
                    { 273390, 110, "Кооперативный техникум (ПКТ)" },
                    { 1752360, 110, "Компьютерная школа ПГУ" },
                    { 296383, 110, "Коммерческий колледж (ПКК)" },
                    { 345939, 110, "Колледж экономики, статистики и информатики (ПКЭСИ, ПФ МЭСИ)" },
                    { 258175, 110, "Колледж экономики и управления (ПКЭУ)" },
                    { 720547, 110, "Колледж Федеральной службы исполнения наказаний (ПК ФСИН РФ)" },
                    { 268977, 110, "Колледж спортивной подготовки Пермского края (КСП ПК, бывш. Педагогический физической культуры и спорта, ППКФКиС)" },
                    { 1764320, 110, "Колледж профессионального образования ПГНИУ" },
                    { 199974, 110, "Лицей «Синтон»" },
                    { 166203, 110, "Электромеханический техникум" },
                    { 357600, 110, "Школа искусств №79" },
                    { 205408, 110, "Агропромышленный техникум (ПАПТ, бывш. ПЛ №77)" },
                    { 223961, 110, "Школа искусств №9" },
                    { 339044, 110, "Училище №9" },
                    { 29121, 110, "Лицей №9" },
                    { 74412, 110, "Музыкальная школа №9" },
                    { 27612, 110, "Лицей №8" },
                    { 143674, 110, "Гимназия №8" },
                    { 86061, 110, "Музыкальная школа №8" },
                    { 290151, 110, "Школа №8" },
                    { 135346, 110, "Школа-интернат №8" },
                    { 89500, 110, "Школа №7" },
                    { 282561, 110, "Музыкальная школа №7" },
                    { 225951, 110, "Художественная школа №7" },
                    { 337566, 110, "Школа искусств №7" },
                    { 168431, 110, "Вечерняя школа №7" },
                    { 54805, 110, "Лицей №7" },
                    { 6742, 110, "Гимназия №7" },
                    { 185184, 110, "Детско-юношеская спортивная школа олимпийского резерва №7" },
                    { 352910, 110, "Лицей №6" },
                    { 350886, 110, "Гимназия №6" },
                    { 75316, 110, "Музыкальная школа №6" },
                    { 276566, 110, "Школа-интернат №6" },
                    { 180563, 110, "Школа №9" },
                    { 318765, 110, "Гимназия №10" },
                    { 288956, 110, "Школа №10" },
                    { 209862, 110, "Музыкальная школа №10" },
                    { 339635, 110, "Профессиональный лицей №15" },
                    { 138682, 110, "Школа №15" },
                    { 55515, 110, "Музыкальная школа №15" },
                    { 896391, 110, "Школа искусств №14" },
                    { 145113, 110, "Школа №14" },
                    { 61298, 110, "Музыкальная школа №14" },
                    { 147902, 110, "Профессиональный лицей №14" },
                    { 88038, 110, "Лицей №14" },
                    { 85670, 110, "Музыкальная школа №13" },
                    { 127825, 110, "Школа №13" },
                    { 126297, 110, "Школа №6" },
                    { 101958, 110, "Художественная школа №13" },
                    { 87588, 110, "Лицей №12" },
                    { 3057, 110, "Школа №12" },
                    { 158817, 110, "Краевой многопрофильный техникум (бывш. ПЛ 12)" },
                    { 1728415, 110, "Школа-интернат №12 VIII вида" },
                    { 1728414, 110, "Школа-интернат №12 ОАО «РЖД»" },
                    { 335942, 110, "Гимназия №11 им. Дягилева" },
                    { 148721, 110, "Школа №11" },
                    { 1715786, 110, "Детский сад №11" },
                    { 179831, 110, "Музыкальная школа №11" },
                    { 61088, 110, "Лицей №10 при ГУ-ВШЭ" },
                    { 329259, 110, "Школа искусств №13" },
                    { 295486, 110, "Лицей №5" },
                    { 157597, 110, "Школа-интернат №5" },
                    { 103259, 110, "Вечерняя школа №5" },
                    { 54237, 110, "Школа №2" },
                    { 113480, 110, "Лицей №2 при ПГУ" },
                    { 76248, 110, "Музыкальная школа №2" },
                    { 233492, 110, "Школа-интернат №2" },
                    { 144471, 110, "Детско-юношеская спортивная школа №2" },
                    { 130174, 110, "Художественная школа №2" },
                    { 337304, 110, "Школа искусств №2" },
                    { 96452, 110, "Вечерняя школа №2" },
                    { 136372, 110, "Детско-юношеская спортивная школа №1" },
                    { 77881, 110, "Колледж №1" },
                    { 52214, 110, "Гимназия №2" },
                    { 260895, 110, "Лицей №1 при ПГТУ" },
                    { 352703, 110, "Художественная школа №1" },
                    { 685347, 110, "Вечерняя школа №1" },
                    { 359172, 110, "Гимназия №1" },
                    { 249964, 110, "Техникум промышленных и информационных технологий (ПТПИТ, бывш. ПЛ 1)" },
                    { 185868, 110, "Школа №1" },
                    { 113205, 110, "Художественный колледж №1" },
                    { 104770, 110, "Музыкальная школа №1" },
                    { 142505, 110, "Детско-юношеская спортивная школа олимпийского резерва №1" },
                    { 145007, 110, "Профессионально-техническое училище №1" },
                    { 178708, 110, "Педагогический колледж №1 (ППК)" },
                    { 320496, 110, "Школа-интернат №1" },
                    { 150299, 110, "Школа искусств №15" },
                    { 235963, 110, "Гимназия №3" },
                    { 229091, 110, "Вечерняя школа №3" },
                    { 341879, 110, "Школа искусств №5" },
                    { 66061, 110, "Школа №5" },
                    { 295503, 110, "Профессиональный лицей №5" },
                    { 345164, 110, "Гимназия №5" },
                    { 93740, 110, "Музыкальная школа №5" },
                    { 110352, 110, "Профессионально-техническое училище №5" },
                    { 1718612, 110, "Школа №4 им. Ф. М. Бобкова" },
                    { 231488, 110, "Школа-интернат №4" },
                    { 351795, 110, "Гимназия №4 им. Каменских" },
                    { 330989, 110, "Профессионально-техническое училище №4" },
                    { 48925, 110, "Школа-интернат №3" },
                    { 184301, 110, "Детско-юношеская спортивная школа №4" },
                    { 51263, 110, "Лицей №4" },
                    { 54512, 110, "Школа №4 (Дзержинского района)" },
                    { 69950, 110, "Музыкальная школа №4" },
                    { 210818, 110, "Лицей №3" },
                    { 325828, 110, "Профессионально-техническое училище №3" },
                    { 54776, 110, "Музыкальная школа №3" },
                    { 153811, 110, "Педагогический колледж №3 (ППК)" },
                    { 156651, 110, "Профессиональный лицей №3 им. П. М. Непряхина" },
                    { 210730, 110, "Училище №3" },
                    { 219931, 110, "Школа №3" },
                    { 177013, 110, "Педагогический колледж №4 (ППК, ППУ)" },
                    { 154302, 110, "Школа №78" },
                    { 31485, 110, "Лицей №15" },
                    { 134780, 110, "Школа бизнеса на базе лиц. №15" },
                    { 219622, 110, "Лицей №55" },
                    { 241311, 110, "Школа №55" },
                    { 345046, 110, "Профессиональный лицей №54" },
                    { 331057, 110, "Школа №53" },
                    { 165539, 110, "Профессиональное училище №52" },
                    { 29145, 110, "Школа №52" },
                    { 200563, 110, "Школа №51" },
                    { 293384, 110, "Школа №50" },
                    { 314777, 110, "Профессиональное училище №50" },
                    { 22009, 110, "Школа №49" },
                    { 40070, 110, "Школа №48" },
                    { 10015, 110, "Школа №47" },
                    { 277653, 110, "Гимназия №47" },
                    { 39822, 110, "Школа №46" },
                    { 62635, 110, "Школа №45" },
                    { 10448, 110, "Школа №44" },
                    { 130055, 110, "Музыкальная школа №44" },
                    { 141716, 110, "Профессиональный лицей №43" },
                    { 6300, 110, "Школа №43" },
                    { 95968, 110, "Лицей №43" },
                    { 13770, 110, "Школа №42" },
                    { 164613, 110, "Школа №56" },
                    { 122261, 110, "Школа №57" },
                    { 167126, 110, "Школа №58" },
                    { 26424, 110, "Школа №59" },
                    { 78592, 110, "Школа №77" },
                    { 32494, 110, "Школа №76" },
                    { 20987, 110, "Школа №75" },
                    { 50308, 110, "Школа №74" },
                    { 75401, 110, "Школа №73" },
                    { 339526, 110, "Школа №72" },
                    { 57141, 110, "Школа №71" },
                    { 173373, 110, "Школа №70" },
                    { 196244, 110, "Школа №69" },
                    { 35851, 110, "Гимназия №69" },
                    { 36091, 110, "Школа №41" },
                    { 39878, 110, "Школа №68" },
                    { 91057, 110, "Школа №66" },
                    { 124489, 110, "Профессиональное училище №65" },
                    { 47126, 110, "Школа №65" },
                    { 203635, 110, "Школа №64" },
                    { 13521, 110, "Школа №63" },
                    { 258176, 110, "Детский сад №63" },
                    { 107288, 110, "Школа №62" },
                    { 5179, 110, "Школа №61" },
                    { 34231, 110, "Школа №60" },
                    { 237002, 110, "Училище №59" },
                    { 80615, 110, "Школа №67" },
                    { 288291, 110, "Училище №41" },
                    { 8247, 110, "Школа №40 («Мультипарк»)" },
                    { 743712, 110, "Детский сад №40" },
                    { 231599, 110, "Профессиональное училище №26" },
                    { 342645, 110, "Школа искусств №25" },
                    { 255808, 110, "Профессиональное училище №25" },
                    { 29778, 110, "Школа №25" },
                    { 34358, 110, "Школа №24" },
                    { 272649, 110, "Школа №23" },
                    { 1601, 110, "Школа №22" },
                    { 85184, 110, "Лицей №21" },
                    { 6723, 110, "Школа №21" },
                    { 230448, 110, "Школа №20" },
                    { 187784, 110, "Лицей №26" },
                    { 212338, 110, "Профессиональное училище №19" },
                    { 130120, 110, "Школа №18" },
                    { 190514, 110, "Детско-юношеская спортивная школа олимпийского резерва №18" },
                    { 341076, 110, "Школа №17" },
                    { 107426, 110, "Гимназия №17" },
                    { 143850, 110, "Профессиональное училище №16" },
                    { 8155, 110, "Школа №16" },
                    { 185793, 110, "Вечерняя школа №16" },
                    { 69879, 110, "Колледж №16" },
                    { 343398, 110, "Школа искусств №16" },
                    { 339627, 110, "Училище №15" },
                    { 41693, 110, "Школа №19" },
                    { 147277, 110, "Художественная школа №15" },
                    { 311365, 110, "Училище №26" },
                    { 200251, 110, "Профессиональное училище №27 (до 2009 г.)" },
                    { 143299, 110, "Отраслевых технологий техникум (ПТОТ, бывш. ПУ 39)" },
                    { 112398, 110, "Лицей №39" },
                    { 53721, 110, "Школа №38" },
                    { 29269, 110, "Школа №37" },
                    { 256580, 110, "Гимназия №36" },
                    { 15366, 110, "Школа №36" },
                    { 239595, 110, "Профессионально-техническое училище №36" },
                    { 55577, 110, "Школа №35" },
                    { 41619, 110, "Школа №34" },
                    { 19141, 110, "Школа №33" },
                    { 10449, 110, "Школа №26" },
                    { 138889, 110, "Гимназия №33" },
                    { 289055, 110, "Профессиональный лицей №32" },
                    { 15454, 110, "Гимназия №31" },
                    { 273878, 110, "Профессиональный лицей №30" },
                    { 9028, 110, "Школа №30" },
                    { 128832, 110, "Лицей №30" },
                    { 329287, 110, "Училище №30" },
                    { 221930, 110, "Школа №29" },
                    { 17342, 110, "Школа №28" },
                    { 108983, 110, "Лицей №27" },
                    { 63153, 110, "Школа №27" },
                    { 197002, 110, "Школа №32" },
                    { 281168, 110, "Юридический колледж при ПГУ" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1601);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5179);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6300);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8155);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8247);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9028);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9029);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10015);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10449);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13521);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13773);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15455);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17342);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20852);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21949);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26424);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 26650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27266);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29121);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29145);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29269);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29778);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31485);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31768);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32494);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34358);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36427);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38377);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38530);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40732);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 41693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 45049);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46396);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 46517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 47126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50108);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51263);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51999);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52855);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54805);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55515);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57758);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58233);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 62635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63153);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64393);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64851);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68336);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73865);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74412);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75316);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76248);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80523);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80781);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85670);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88106);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89241);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 89980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 90743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91102);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93500);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 93740);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96452);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104744);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 104770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110352);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110861);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111070);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111545);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 111649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113205);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113480);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120283);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122880);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123929);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125724);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126297);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127825);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129081);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130174);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134780);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135346);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136372);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 137175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138682);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139071);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141716);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143674);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144471);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145007);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145113);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147902);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148456);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148721);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150299);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 153811);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158817);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 161798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166203);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167097);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 171889);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172165);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177013);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178708);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179575);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184375);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185868);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 187784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 192318);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194184);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196243);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 196244);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199660);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199974);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205408);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 205850);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206125);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207711);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209981);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210730);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212338);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219931);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221930);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 223961);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224947);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225951);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 228115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 229091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 231599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233492);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235963);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 237002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241722);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 242815);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255808);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256580);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258175);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258176);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260895);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270444);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 272649);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273878);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 275592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 276566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277653);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 278493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 282561);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 283675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 287386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288229);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288839);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 289055);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 290151);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293384);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 295503);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 296383);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311365);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 311704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 314777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 318765);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 320496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 325828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 329259);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 329287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 329862);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 330989);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 331057);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 334900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 335942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 337304);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 337566);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339044);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339627);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 339635);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341076);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 341879);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 342645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 343398);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 345046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 345164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 345939);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 350686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 350886);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 351287);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 351641);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 351795);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 352193);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 352703);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 352910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 352977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 354945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 357600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 359172);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 359421);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 408520);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 489238);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 491031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 685347);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 704577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 720547);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743712);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 743714);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 785824);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 896391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 965337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1037086);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1069005);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1282143);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1316749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1496526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1501589);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1656251);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1660809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662859);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1663693);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1666258);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1667979);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1679261);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705598);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1714948);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1715786);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1718612);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728414);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1728415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1734766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1735237);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1750875);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1751460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759647);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1761986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766715);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766739);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1767510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771563);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771679);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1777704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781857);
        }
    }
}
