using Microsoft.EntityFrameworkCore.Migrations;

namespace Knigosha.Persistence.Migrations
{
    public partial class AddNovosibirsk : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Schools",
                columns: new[] { "Id", "CityId", "Title" },
                values: new object[,]
                {
                    { 133484, 99, "Прогимназия №1" },
                    { 147916, 99, "Высшее военное командное училище" },
                    { 96211, 99, "Высший колледж информатики (ВКИ) НГУ" },
                    { 113198, 99, "Гимназия «Варенька»" },
                    { 20527, 99, "Гимназия «Журавушка»" },
                    { 20613, 99, "Гимназия «Таланъ»" },
                    { 1652673, 99, "Гуманитарная школа при ГФ НГУ" },
                    { 178736, 99, "Дворец культуры им. Горького" },
                    { 260508, 99, "Детский сад «Золотой ключик»" },
                    { 293417, 99, "Детский сад «Лесок»" },
                    { 126600, 99, "Детский сад «Настенька»" },
                    { 266150, 99, "Детский сад «Незабудка»" },
                    { 268051, 99, "Детский сад МФК" },
                    { 20280, 99, "Детско-юношеская спортивная школа «Заря»" },
                    { 139907, 99, "Детско-юношеская спортивная школа «Изумруд»" },
                    { 95904, 99, "Детско-юношеская спортивная школа «Локомотив»" },
                    { 257669, 99, "Детско-юношеская спортивная школа «Чкаловец»" },
                    { 185356, 99, "Детско-юношеская спортивная школа олимпийского резерва «Спартак»" },
                    { 101159, 99, "Высшая национальная школа телевидения (МГУКИ)" },
                    { 116636, 99, "Воскресная церковно-приходская школа" },
                    { 115285, 99, "Бизнес-колледж при НГУЭиУ" },
                    { 109866, 99, "Аэрокосмический лицей (АКЛ) им. Ю. В. Кондратюка" },
                    { 122915, 99, "Автошкола «Светофор»" },
                    { 138099, 99, "Автошкола «СибАвто»" },
                    { 198470, 99, "Автошкола «Сигнал»" },
                    { 867731, 99, "Автошкола «Фаворит»" },
                    { 241980, 99, "Автошкола «Шумахер»" },
                    { 1662774, 99, "Автошкола «Ягуар»" },
                    { 246188, 99, "Автошкола в Гвардейском" },
                    { 249949, 99, "Автошкола ВОА" },
                    { 273535, 99, "Детско-юношеская спортивная школа олимпийского резерва по восточным единоборствам" },
                    { 160495, 99, "Автошкола ГУ ССЗН «Соцтехсервис»" },
                    { 91291, 99, "Автошкола НГТУ" },
                    { 215911, 99, "Аграрный колледж" },
                    { 1733651, 99, "Академия дизайна и программирования (НАДиП)" },
                    { 241289, 99, "Академия иностранных языков" },
                    { 87742, 99, "Академия иностранных языков «Language Academy»" },
                    { 1730343, 99, "Академия стиля и моды «Персонель»" },
                    { 184149, 99, "Архитектурно-дизайнерская школа «Творчество»" },
                    { 101755, 99, "Архитектурный лицей" },
                    { 1705596, 99, "Автошкола ДОСААФ" },
                    { 261037, 99, "Детско-юношеская спортивная школа олимпийского резерва по конному спорту" },
                    { 244481, 99, "Детско-юношеская спортивная школа олимпийского резерва по сноуборду" },
                    { 136311, 99, "Дом детского творчества им. А. И. Ефремова" },
                    { 162514, 99, "Колледж СИПК" },
                    { 227832, 99, "Колледж телекоммуникаций и информатики (НКТИ)" },
                    { 215386, 99, "Колледж физической культуры (НКФК)" },
                    { 255784, 99, "Колледж экономики и права (НКЭиП) при НИЭМ" },
                    { 230550, 99, "Колледж электроники и вычислительной техники (бывш. НТЭиВТ)" },
                    { 156197, 99, "Командное речное училище им. С. И. Дежнева" },
                    { 262302, 99, "Компьютерная академия (НКА)" },
                    { 150235, 99, "Компьютерный колледж" },
                    { 167298, 99, "Колледж связи НКТИ СибГУТИ" },
                    { 177749, 99, "Кооперативный техникум (НКТ) им. А. Н. Косыгина Новосибирского Облпотребсоюза" },
                    { 78148, 99, "Лаборатория экологического воспитания (бывш. СЮН)" },
                    { 234446, 99, "Летняя школа информатики и программирования (ЛШИП ВКИ НГУ)" },
                    { 87593, 99, "Летняя школа СУНЦ НГУ (ФМШ)" },
                    { 270022, 99, "Летняя школа юных программистов (ЛШЮП)" },
                    { 1766843, 99, "Лингвистический центр «Universe Language»" },
                    { 206061, 99, "Лицей «Ор-Авнер»" },
                    { 168242, 99, "Лицей информационных технологий (ЛИТ)" },
                    { 116698, 99, "Лицей международных отношений при СИМОР" },
                    { 127697, 99, "Кремлевская школа" },
                    { 215437, 99, "Автошкола «РОСТО»" },
                    { 144798, 99, "Колледж при САФБД" },
                    { 285709, 99, "Колледж культуры и искусств (НОККиИ)" },
                    { 120222, 99, "Дом детского творчества им. Володи Дубинина" },
                    { 128501, 99, "Дом детского творчества им. Гайдара" },
                    { 203194, 99, "Дом культуры им. Клары Цеткин" },
                    { 76400, 99, "Дом культуры им. Пичугина" },
                    { 159522, 99, "Женская классическая гимназия (ЖКГ)" },
                    { 274137, 99, "Заочная конфирмационная школа" },
                    { 639607, 99, "Заочная школа СУНЦ НГУ (ЗФМШ)" },
                    { 547415, 99, "Заочная экономическая школа (ЗЭШ) при НГУ" },
                    { 179962, 99, "Колледж печати и информационных технологий (СГТПИТ, бывш. НГТП)" },
                    { 65156, 99, "Изостудия ДК «Строитель»" },
                    { 126586, 99, "Инженерный лицей НГТУ" },
                    { 1781790, 99, "Институт дополнительного профессионального образования «Госзаказ»" },
                    { 1752006, 99, "Институт профессиональных контрактных управляющих" },
                    { 113838, 99, "Информационно-экономический лицей (ИЭЛ)" },
                    { 167558, 99, "Католическая школа" },
                    { 119448, 99, "Книготорговый техникум" },
                    { 100051, 99, "Колледж «Ракушка»" },
                    { 135835, 99, "Колледж иностранных языков «Класс +»" },
                    { 159274, 99, "Израильский культурный центр" },
                    { 184728, 99, "Лицей при НГМУ" },
                    { 212726, 99, "Автошкола «Перекресток»" },
                    { 292921, 99, "Автошкола «Клаксон»" },
                    { 35893, 99, "Школа №196" },
                    { 51324, 99, "Школа №197" },
                    { 63487, 99, "Школа №198" },
                    { 2783, 99, "Школа №199" },
                    { 176403, 99, "Лицей №200" },
                    { 167003, 99, "Школа №201" },
                    { 793, 99, "Школа №202" },
                    { 180277, 99, "Школа №203" },
                    { 7658, 99, "Школа №204" },
                    { 6054, 99, "Школа №205" },
                    { 222371, 99, "Профессионально-техническое училище №205" },
                    { 16052, 99, "Школа №206" },
                    { 16371, 99, "Школа №207" },
                    { 176210, 99, "Школа №208" },
                    { 1771919, 99, "Специальная коррекционная школа №209" },
                    { 50088, 99, "Школа №210" },
                    { 1719985, 99, "Школа №211" },
                    { 14328, 99, "Школа №195" },
                    { 6632, 99, "Школа №194" },
                    { 6588, 99, "Школа №193" },
                    { 37009, 99, "Школа №192" },
                    { 11958, 99, "Школа №175" },
                    { 3844, 99, "Школа №176" },
                    { 273204, 99, "Лицей №176" },
                    { 24351, 99, "Школа №177" },
                    { 9915, 99, "Школа №178" },
                    { 4560, 99, "Школа №179" },
                    { 39479, 99, "Школа №180" },
                    { 267103, 99, "Школа №181" },
                    { 1772747, 99, "Школа №212" },
                    { 23502, 99, "Школа №182" },
                    { 10215, 99, "Школа №184" },
                    { 11139, 99, "Лицей №185 (бывш. Школа)" },
                    { 38154, 99, "Школа №186" },
                    { 27804, 99, "Школа №187" },
                    { 7101, 99, "Школа №188" },
                    { 16051, 99, "Школа №189" },
                    { 3637, 99, "Школа №190" },
                    { 50975, 99, "Школа №191" },
                    { 280, 99, "Школа №183" },
                    { 1773577, 99, "Школа №213 «Открытие»" },
                    { 1778370, 99, "Школа №214" },
                    { 646912, 99, "Детский сад №215 «Родничок»" },
                    { 1633406, 99, "Детский сад №408" },
                    { 129882, 99, "Школа №409" },
                    { 72360, 99, "Школа №434" },
                    { 886496, 99, "Детский сад №449" },
                    { 1757571, 99, "Детский сад №478 «Белоснежка»" },
                    { 250090, 99, "Авиационный техникум (НАТ)" },
                    { 159278, 99, "Авиационный технический колледж (НАТК)" },
                    { 141470, 99, "Авиационный учебный центр им. А. И. Покрышкина (НУАЦ)" },
                    { 1661777, 99, "Школа №401" },
                    { 28002, 99, "Автолицей" },
                    { 1564487, 99, "Автошкола «Автолада»" },
                    { 1110164, 99, "Автошкола «Автолайн»" },
                    { 1745977, 99, "Автошкола «АвтоЛИДЕР»" },
                    { 257062, 99, "Автошкола «Автолюкс»" },
                    { 294956, 99, "Автошкола «АкБарс»" },
                    { 1034798, 99, "Автошкола «Вираж»" },
                    { 1677631, 99, "Автошкола «Зелёная волна»" },
                    { 131486, 99, "Автошкола «Ирис-плюс»" },
                    { 74996, 99, "Автотранспортный колледж (бывш. НАТТ)" },
                    { 168736, 99, "Автошкола «Нооген»" },
                    { 478479, 99, "Детский сад №388" },
                    { 274599, 99, "Детский сад №376 «Дельфиненок»" },
                    { 147812, 99, "Школа №223" },
                    { 134476, 99, "Школа французского языка «Alliance française de Novossibirsk»" },
                    { 261968, 99, "Школа №241" },
                    { 246399, 99, "Школа №245" },
                    { 243249, 99, "Школа №251" },
                    { 265702, 99, "Школа №259" },
                    { 194180, 99, "Школа №262" },
                    { 252467, 99, "Школа №263" },
                    { 195084, 99, "Школа №383" },
                    { 280616, 99, "Детский сад №272 «Берёзка»" },
                    { 117123, 99, "Школа №281" },
                    { 135497, 99, "Профессиональное училище №292" },
                    { 202380, 99, "Школа №315" },
                    { 124420, 99, "Школа №324" },
                    { 224578, 99, "Школа №328" },
                    { 212326, 99, "Лицей №329" },
                    { 280009, 99, "Детский сад №345" },
                    { 881806, 99, "Детский сад №346" },
                    { 281763, 99, "Школа №273" },
                    { 87574, 99, "Лицей при СГГА" },
                    { 235510, 99, "Лицей Промышленно-экономического колледжа" },
                    { 1723213, 99, "Лютеранская богословская семинария" },
                    { 56046, 99, "Школа «Исток»" },
                    { 73686, 99, "Школа «Калейдоскоп»" },
                    { 238803, 99, "Школа «Кладезь»" },
                    { 130448, 99, "Школа «Логос»" },
                    { 61025, 99, "Школа «Медиа»" },
                    { 159116, 99, "Школа «Начало»" },
                    { 175163, 99, "Школа «Образ»" },
                    { 219885, 99, "Школа «Перспектива»" },
                    { 258531, 99, "Школа «Подсолнухи»" },
                    { 254353, 99, "Школа «Развитие»" },
                    { 251350, 99, "Школа «Самсон»" },
                    { 68810, 99, "Школа «Солнышко»" },
                    { 52975, 99, "Школа «София»" },
                    { 50959, 99, "Школа «Станислава»" },
                    { 57622, 99, "Школа «Ступени»" },
                    { 85301, 99, "Школа «Умка»" },
                    { 96038, 99, "Школа «Феникс»" },
                    { 235577, 99, "Школа «Искра»" },
                    { 1207, 99, "Школа «Инсайт»" },
                    { 83303, 99, "Школа «Зимородок»" },
                    { 38189, 99, "Школа «Диалог»" },
                    { 81967, 99, "Художественно-эстетическая школа искусств (ХЭШИ) «Весна»" },
                    { 37570, 99, "Художественное училище (НГХУ)" },
                    { 92590, 99, "Художественный лицей при ХГФ (НГПУ)" },
                    { 12111, 99, "Центр гармоничного развития детей (ЦГРД)" },
                    { 88565, 99, "Центр детского и юношеского творчества «Смайл»" },
                    { 127796, 99, "Центр довузовского образования (ЦДО) НИИЖТ-СГУПС" },
                    { 1764313, 99, "Центр интеллектуального развития IMA ABACUS" },
                    { 70735, 99, "Центр музыкального образования" },
                    { 98966, 99, "Школа «Эврика»" },
                    { 224058, 99, "Центр образования «Спарта»" },
                    { 117962, 99, "Центр развития дизайна «Арт»" },
                    { 173132, 99, "Центральный детский дом творчества" },
                    { 49934, 99, "Школа «Business School»" },
                    { 2831, 99, "Школа «Аврора»" },
                    { 71115, 99, "Школа «Агат»" },
                    { 135672, 99, "Школа «Алые Паруса»" },
                    { 101761, 99, "Школа «Веритас-М»" },
                    { 70632, 99, "Школа «Гармония»" },
                    { 1762838, 99, "Центр подготовки и сертификации авиационного персонала" },
                    { 174123, 99, "Школа «Эко-школа" },
                    { 92610, 99, "Школа «Экселенс»" },
                    { 119010, 99, "Школа «Юнион»" },
                    { 1717650, 99, "Школа профессионального макияжа «Make-up Atelier»" },
                    { 57475, 99, "Школа радиовещания" },
                    { 113080, 99, "Школа рекламы и маркетинга" },
                    { 1756168, 99, "Школа стиля Марии Липатниковой" },
                    { 57476, 99, "Школа телевизионного мастерства" },
                    { 129946, 99, "Школа-студия при ГТРК Новосибирск" },
                    { 131692, 99, "Экономико-юридический колледж" },
                    { 258470, 99, "Электромашиностроительный техникум (НЭМСТ)" },
                    { 86413, 99, "Школа при НКТИ" },
                    { 294633, 99, "Электромеханический колледж транспортного строительства (НЭМК ТС)" },
                    { 256268, 99, "Электротехникум связи (НЭТС)" },
                    { 284792, 99, "Языковая школа «Bestway»" },
                    { 118965, 99, "Языковая школа «J & S»" },
                    { 213694, 99, "Языковая школа «Present School»" },
                    { 184200, 99, "Языковая школа «Respect»" },
                    { 191368, 99, "Языковая школа «Аструм»" },
                    { 199084, 99, "Языковая школа «Евро-школа»" },
                    { 107080, 99, "Языковая школа «Инотекст»" },
                    { 240214, 99, "Электромеханический техникум (НЭМТ)" },
                    { 74032, 99, "Художественная школа «Семь слонов»" },
                    { 143313, 99, "Школа при Академии ФСО" },
                    { 136459, 99, "Школа милиции (НССШМ МВД РФ)" },
                    { 112366, 99, "Школа «Юниор»" },
                    { 293240, 99, "Школа «Юнисити»" },
                    { 189661, 99, "Школа «Юность»" },
                    { 1759704, 99, "Школа астропсихологии «Уран»" },
                    { 206447, 99, "Школа велоэкстрима" },
                    { 164832, 99, "Школа высшего спортивного мастерства (ШВСМ)" },
                    { 1456991, 99, "Школа дизайна Л. Прозоровой" },
                    { 190543, 99, "Школа журналистики" },
                    { 160552, 99, "Школа парных танцев «Импульс»" },
                    { 263250, 99, "Школа им. Горького" },
                    { 80023, 99, "Школа иностранных языков «Big Ben»" },
                    { 130446, 99, "Школа иностранных языков «Cambridge Centre»" },
                    { 103120, 99, "Школа иностранных языков «English First»" },
                    { 78772, 99, "Школа иностранных языков «UniCity»" },
                    { 1763487, 99, "Школа иностранных языков «Дискуссия»" },
                    { 151339, 99, "Школа информатики и программирования ВКИ НГУ" },
                    { 253858, 99, "Школа искусств при ДК «Энергия»" },
                    { 136142, 99, "Школа искусств с профильным оркестровым отделением" },
                    { 262881, 99, "Школа иностранных языков «Benedict School»" },
                    { 129777, 99, "Художественная школа «Бемби»" },
                    { 113156, 99, "Художественная студия им. Гарина-Михайловского" },
                    { 155289, 99, "Хоровая капелла мальчиков" },
                    { 1681136, 99, "Областной учебный центр (НОУЦ)" },
                    { 150940, 99, "Областной центр информационных технологий" },
                    { 246301, 99, "Областной центр образования (ОЦО)" },
                    { 244155, 99, "Образовательный комплекс «Наша школа»" },
                    { 1769127, 99, "Образовательный центр «Юниум»" },
                    { 1746975, 99, "Образовательный центр профессионального развития «Сфера»" },
                    { 141141, 99, "Оптический лицей" },
                    { 260405, 99, "Очно-заочная школа (НООЗШ) для детей с ОВЗ" },
                    { 67549, 99, "Областной колледж культуры и искусства (НОККиИ)" },
                    { 135848, 99, "Педагогический лицей им. А. С. Пушкина (НГПЛ)" },
                    { 108001, 99, "Политехнический колледж" },
                    { 5591, 99, "Православная гимназия во имя преп. Сергия Радонежского" },
                    { 117642, 99, "Православная гимназия во имя свв. равноапостольных Кирилла и Мефодия" },
                    { 73592, 99, "Православная школа им. преп. Серафима Саровского" },
                    { 185085, 99, "Приборостроительный техникум (НГПСТ)" },
                    { 170222, 99, "Промышленно-энергетический колледж (бывш. промышленно-экономический) (НПЭК)" },
                    { 198441, 99, "Промышленный колледж (бывш. Промышленный техникум)" },
                    { 75031, 99, "Профессионально-педагогический колледж (НГППК)" },
                    { 84940, 99, "Петровский колледж" },
                    { 874644, 99, "Профессиональное училище-интернат для инвалидов" },
                    { 99941, 99, "Областное фармацевтическое училище (ГНОФУ)" },
                    { 259644, 99, "Новосибирский технологический колледж питания (бывш. НТТП, НТТОП)" },
                    { 159595, 99, "Медицинский колледж (НМК, бывш. НБМК, НОБМУ)" },
                    { 248276, 99, "Медицинское училище (НММУ)" },
                    { 1673064, 99, "Международная академия парикмахерского искусства и эстетики «San Valero»" },
                    { 1779717, 99, "Международная школа флористов-дизайнеров «Центр флористического дизайна»" },
                    { 177309, 99, "Международный учебный центр «Интерленг»" },
                    { 1662567, 99, "Механический техникум" },
                    { 225695, 99, "Молодежная школа бизнеса" },
                    { 268735, 99, "Монтажно-строительный техникум (НМСТ)" },
                    { 1773078, 99, "Новосибирский центр медиации" },
                    { 65337, 99, "Монтажный техникум (НМТ)" },
                    { 1774223, 99, "Музыкальная школа «Rock Stars School»" },
                    { 150224, 99, "Музыкальная школа «Радуга»" },
                    { 204197, 99, "Музыкальная школа при НМК им. Мурова" },
                    { 132217, 99, "Музыкальный колледж (НМК) им. А. Ф. Мурова" },
                    { 88615, 99, "Музыкальный лицей НГК" },
                    { 1661512, 99, "Научно-образовательный центр «Восток-Запад»" },
                    { 132227, 99, "Немецкий центр им. Гете при НГТУ" },
                    { 1756242, 99, "Ново-Николаевский кадетский корпус спасателей (ННККС)" },
                    { 141777, 99, "Монтессори-центр" },
                    { 43519, 99, "Школа №174" },
                    { 239320, 99, "Радиотехнический колледж (НРТК, бывш. НРТТ)" },
                    { 220033, 99, "Республиканский колледж" },
                    { 209234, 99, "Техникум лёгкой промышленности и сервиса (НТЛПиС)" },
                    { 1720135, 99, "Техникум пищевой промышленности и переработки (НТППиП)" },
                    { 288186, 99, "Техникум финансов и банковского дела (НТФиБД)" },
                    { 290676, 99, "Технический лицей при СГГА" },
                    { 197448, 99, "Технический техникум речного флота (ТЛРФ)" },
                    { 185632, 99, "Торгово-экономический колледж (НТЭК)" },
                    { 147725, 99, "Учебно-производственный комбинат (УПК)" },
                    { 1768694, 99, "Учебный центр «Boston»" },
                    { 291208, 99, "Техникум железнодорожного транспорта (НТЖТ)" },
                    { 1661513, 99, "Учебный центр «Центр финансовых технологий»" },
                    { 290976, 99, "Училище олимпийского резерва (НУОР)" },
                    { 1683037, 99, "Факультет СПО СибУПК" },
                    { 248864, 99, "Физико-математическая школа имени М. А. Лаврентьева (СУНЦ НГУ)" },
                    { 1778058, 99, "Фотошкола Анны Масловой" },
                    { 1781208, 99, "Фотошкола Пикча" },
                    { 233454, 99, "Химико-технологический колледж (НХТК) им. Д. И. Менделеева" },
                    { 125374, 99, "Хореографическая школа" },
                    { 131998, 99, "Хореографический колледж (НГХК, НХУ)" },
                    { 1725109, 99, "Учебный центр информационных технологий «Информатика» НГТУ" },
                    { 1764495, 99, "Региональный учебный центр профсоюзов (РУЦП)" },
                    { 254573, 99, "Техникум геодезии и картографии (НТГиК)" },
                    { 151468, 99, "Танцевальная школа «Unidance»" },
                    { 133271, 99, "Речное училище" },
                    { 220390, 99, "Санаторно-лесная школа-интернат" },
                    { 1775576, 99, "Санкт-Петербургская школа красоты" },
                    { 60242, 99, "Сибирская школа" },
                    { 1708910, 99, "Сибирский авиационный кадетский корпус (САКК) им. А. И. Покрышкина" },
                    { 157458, 99, "Сибирский бизнес-колледж" },
                    { 248967, 99, "Сибирский геофизический колледж (бывш. Геологоразведочный техникум, НГРТ)" },
                    { 224607, 99, "Сибирский кадетский корпус" },
                    { 78546, 99, "Театральное училище" },
                    { 266579, 99, "Сибирский компьютерный колледж (СКК)" },
                    { 260173, 99, "Сибирский политехнический колледж (СПК)" },
                    { 85794, 99, "Специальная музыкальная школа при НГК им. Глинки" },
                    { 502986, 99, "Специальная музыкальная школа-колледж" },
                    { 227429, 99, "Спортивный комплекс «Прогресс»" },
                    { 154604, 99, "Станкостроительный колледж" },
                    { 1677493, 99, "Студия современного танца «Shake It»" },
                    { 145828, 99, "Танцевальная школа «Maxidance»" },
                    { 140147, 99, "Танцевальная школа «Todes»" },
                    { 290314, 99, "Сибирский образовательный центр" },
                    { 265689, 99, "Детский сад №173" },
                    { 48607, 99, "Школа №173" },
                    { 27115, 99, "Школа №172" },
                    { 105101, 99, "Лицей №19" },
                    { 204898, 99, "Вечерняя школа №19" },
                    { 60964, 99, "Музыкальная школа №19" },
                    { 257858, 99, "Профессиональный лицей №19" },
                    { 38232, 99, "Школа №20" },
                    { 172357, 99, "Школа искусств №20 «Муза»" },
                    { 69440, 99, "Школа №21" },
                    { 5578, 99, "Лицей №21 биотехнологический" },
                    { 211675, 99, "Вечерняя школа №21" },
                    { 252858, 99, "Профессионально-техническое училище №21" },
                    { 159160, 99, "Школа искусств №21" },
                    { 81420, 99, "Школа №22" },
                    { 279039, 99, "Гимназия №22" },
                    { 80759, 99, "Лицей №22 «Надежда Сибири»" },
                    { 183750, 99, "Детско-юношеская спортивная школа №22" },
                    { 142876, 99, "Профессионально-техническое училище №22" },
                    { 213479, 99, "Школа искусств №22" },
                    { 212387, 99, "Школа №19" },
                    { 20279, 99, "Школа искусств №18" },
                    { 134857, 99, "Профессионально-техническое училище №18" },
                    { 52957, 99, "Вечерняя школа №18" },
                    { 130591, 99, "Гимназия №14" },
                    { 220910, 99, "Профессионально-техническое училище №14" },
                    { 48066, 99, "Школа искусств №14" },
                    { 207617, 99, "Школа №15" },
                    { 116183, 99, "Гимназия №15" },
                    { 1352003, 99, "Вечерняя школа №15" },
                    { 24570, 99, "Музыкальная школа №15" },
                    { 35369, 99, "Школа №16" },
                    { 27310, 99, "Школа №23" },
                    { 1080666, 99, "Гимназия №16 французская" },
                    { 126537, 99, "Экспериментальная школа на базе шк. №17 и д. сада №460" },
                    { 33614, 99, "Школа №17" },
                    { 148442, 99, "Гимназия №17" },
                    { 147320, 99, "Вечерняя школа №17" },
                    { 220344, 99, "Музыкальная школа №17" },
                    { 149728, 99, "Профессионально-техническое училище №17" },
                    { 96893, 99, "Школа искусств №17" },
                    { 1271, 99, "Школа №18" },
                    { 167168, 99, "Школа искусств №16" },
                    { 59645, 99, "Музыкальная школа №23" },
                    { 193255, 99, "Школа искусств №23" },
                    { 14202, 99, "Школа №24" },
                    { 33246, 99, "Школа №32" },
                    { 148491, 99, "Вечерняя школа №32" },
                    { 200450, 99, "Профессиональное училище №32" },
                    { 168597, 99, "Школа №33" },
                    { 55937, 99, "Школа №34" },
                    { 110568, 99, "Школа №35" },
                    { 77905, 99, "Вечерняя школа №35" },
                    { 190432, 99, "Профессионально-техническое училище №35" },
                    { 230539, 99, "Школа №31" },
                    { 178630, 99, "Профессиональное училище №35" },
                    { 173541, 99, "Колледж №36" },
                    { 186344, 99, "Профессионально-техническое училище №36" },
                    { 212194, 99, "Профессиональное училище №36" },
                    { 241426, 99, "Школа №37" },
                    { 35883, 99, "Школа №38" },
                    { 232475, 99, "Профессиональный лицей №38" },
                    { 267164, 99, "Школа №39" },
                    { 164517, 99, "Школа-интернат №39" },
                    { 4718, 99, "Школа №36" },
                    { 281837, 99, "Гимназия №14 «Университетская» (бывш. №127)" },
                    { 165308, 99, "Профессиональное училище №30" },
                    { 185142, 99, "Музыкальная школа №30" },
                    { 32286, 99, "Музыкальная школа №24" },
                    { 163558, 99, "Школа искусств №24" },
                    { 7814, 99, "Школа №25" },
                    { 84905, 99, "Гимназия №25" },
                    { 23841, 99, "Музыкальная школа №25" },
                    { 179940, 99, "Школа искусств №25" },
                    { 9921, 99, "Школа №26" },
                    { 163080, 99, "Вечерняя школа №26" },
                    { 194131, 99, "Школа искусств №30" },
                    { 199124, 99, "Музыкальная школа №26" },
                    { 117723, 99, "Вечерняя школа №27" },
                    { 123624, 99, "Колледж питания и сервиса (бывш. ПУ №27)" },
                    { 141585, 99, "Школа искусств №27" },
                    { 18434, 99, "Лицей №28" },
                    { 1772602, 99, "Школа искусств №28" },
                    { 9997, 99, "Школа №29" },
                    { 54813, 99, "Школа искусств №29" },
                    { 34849, 99, "Школа №30" },
                    { 731, 99, "Школа №27" },
                    { 63170, 99, "Школа №14" },
                    { 107853, 99, "Школа искусств №13" },
                    { 48820, 99, "Музыкальная школа №13" },
                    { 221, 99, "Гимназия №3" },
                    { 166197, 99, "Лицей №3" },
                    { 68743, 99, "Музыкальная школа №3" },
                    { 256181, 99, "Детско-юношеская спортивная школа олимпийского резерва №3" },
                    { 227425, 99, "Детско-юношеская спортивная школа №3" },
                    { 54016, 99, "Художественная школа №3" },
                    { 213822, 99, "Педагогический колледж №3" },
                    { 72101, 99, "Медицинский колледж №3" },
                    { 172220, 99, "Школа №3" },
                    { 210936, 99, "Речной колледж (бывш. ПЛ №3, Техникум водного транспорта)" },
                    { 54594, 99, "Школа №4" },
                    { 2985, 99, "Гимназия №4" },
                    { 216273, 99, "Полиграфический лицей №4" },
                    { 113468, 99, "Музыкальная школа №4" },
                    { 172794, 99, "Медицинский колледж №4" },
                    { 135648, 99, "Педагогический колледж №4" },
                    { 158673, 99, "Профессиональный лицей №4" },
                    { 294671, 99, "Школа искусств №4" },
                    { 254464, 99, "Профессионально-техническое училище №3" },
                    { 178933, 99, "Школа №5" },
                    { 181406, 99, "Педагогический колледж №2" },
                    { 168847, 99, "Художественная школа №2" },
                    { 1780312, 99, "Новосибирский центр профессионального обучения №1" },
                    { 58888, 99, "Школа №1" },
                    { 290, 99, "Гимназия №1" },
                    { 165325, 99, "Школа-интернат №1" },
                    { 1698663, 99, "Вечерняя школа №1" },
                    { 43678, 99, "Музыкальная школа №1" },
                    { 265169, 99, "Детско-юношеская спортивная школа №1" },
                    { 33256, 99, "Детско-юношеская спортивная школа олимпийского резерва №1" },
                    { 140281, 99, "Технический колледж им. Покрышкина (НТК, бывш. НТМиМ, ПУ №2)" },
                    { 125737, 99, "Художественная школа №1" },
                    { 1764835, 99, "Авиастроительный лицей (бывш. ПУ-1)" },
                    { 136310, 99, "Школа искусств №1" },
                    { 56713, 99, "Школа №2" },
                    { 126216, 99, "Прогимназия №2" },
                    { 181207, 99, "Бизнес-школа «B2YOY»" },
                    { 841, 99, "Гимназия №2" },
                    { 113766, 99, "Музыкальная школа №2" },
                    { 141489, 99, "Детско-юношеская спортивная школа олимпийского резерва №2" },
                    { 169624, 99, "Педагогический колледж №1 им. А. С. Макаренко" },
                    { 65502, 99, "Вечерняя школа №39" },
                    { 222, 99, "Гимназия №5" },
                    { 37993, 99, "Музыкальная школа №5" },
                    { 126666, 99, "Музыкальная школа №9" },
                    { 226790, 99, "Профессиональное училище №9" },
                    { 156376, 99, "Школа №10" },
                    { 140366, 99, "Гимназия №10" },
                    { 1662611, 99, "Вечерняя школа №10" },
                    { 4428, 99, "Музыкальная школа №10" },
                    { 179727, 99, "Колледж транспортных технологий им. Н. А. Лунина (НКТТ, бывш. ПТУ №10)" },
                    { 230723, 99, "Профессиональное училище №10" },
                    { 50481, 99, "Лицей №9" },
                    { 57124, 99, "Школа №11" },
                    { 212718, 99, "Музыкальная школа №11" },
                    { 9922, 99, "Гимназия №12" },
                    { 58149, 99, "Лицей №12 (бывш. Школа)" },
                    { 224460, 99, "Музыкальная школа №12" },
                    { 233401, 99, "Колледж автосервиса и дорожного хозяйства (НКАиДХ, бывш. ПУ №12)" },
                    { 138491, 99, "Школа №13" },
                    { 3425, 99, "Гимназия №13" },
                    { 188706, 99, "Лицей №13" },
                    { 29255, 99, "Гимназия №11" },
                    { 265023, 99, "Школа-интернат №5" },
                    { 37526, 99, "Гимназия №9" },
                    { 148890, 99, "Музыкальная школа №8" },
                    { 123542, 99, "Профессионально-техническое училище №5" },
                    { 186472, 99, "Профессиональное училище №5" },
                    { 256101, 99, "Детский сад №5 «Ромашка»" },
                    { 58559, 99, "Школа №6" },
                    { 250431, 99, "Гимназия №6 «Горностай»" },
                    { 199360, 99, "Лицей №6" },
                    { 49117, 99, "Вечерняя школа №6" },
                    { 211973, 99, "Музыкальная школа №6" },
                    { 67828, 99, "Школа №9" },
                    { 169170, 99, "Электротехнический колледж (бывш. ПЛ №6, ПУ №61)" },
                    { 5572, 99, "Гимназия №7" },
                    { 255696, 99, "Лицей №7" },
                    { 124809, 99, "Музыкальная школа №7 им. А. П. Новикова" },
                    { 124919, 99, "Художественная школа №7" },
                    { 200344, 99, "Колледж №7" },
                    { 186764, 99, "Профессиональное училище №7" },
                    { 50373, 99, "Школа №8" },
                    { 788, 99, "Гимназия №8" },
                    { 54987, 99, "Школа №7" },
                    { 73430, 99, "Языковая школа «Лабатон-класс»" },
                    { 801854, 99, "Профессиональное училище №39" },
                    { 11942, 99, "Школа №41" },
                    { 15631, 99, "Школа №117" },
                    { 209232, 99, "Школа №118" },
                    { 3308, 99, "Школа №119" },
                    { 40856, 99, "Школа №120" },
                    { 6771, 99, "Школа №121" },
                    { 8625, 99, "Школа №122" },
                    { 59313, 99, "Школа №123" },
                    { 122519, 99, "Школа №124" },
                    { 4128, 99, "Школа №125" },
                    { 3752, 99, "Лицей № 126" },
                    { 2877, 99, "Школа №127" },
                    { 69510, 99, "Школа №128" },
                    { 1577, 99, "Лицей №128" },
                    { 24609, 99, "Школа №129" },
                    { 114126, 99, "Школа №130" },
                    { 264, 99, "Лицей №130" },
                    { 134900, 99, "Колледж №130" },
                    { 180337, 99, "Школа №116" },
                    { 178945, 99, "Школа №115" },
                    { 66639, 99, "Школа №114" },
                    { 174003, 99, "Лицей №113" },
                    { 29142, 99, "Школа №97" },
                    { 19925, 99, "Школа №98" },
                    { 4130, 99, "Школа №99" },
                    { 219935, 99, "Профессиональное училище №99" },
                    { 32065, 99, "Школа №100" },
                    { 255793, 99, "Школа №101" },
                    { 172312, 99, "Лицей №101" },
                    { 3630, 99, "Школа №102" },
                    { 23911, 99, "Школа №131" },
                    { 42421, 99, "Школа №103" },
                    { 33770, 99, "Школа №105" },
                    { 180718, 99, "Школа №106" },
                    { 3942, 99, "Школа №108" },
                    { 39309, 99, "Школа №109" },
                    { 43978, 99, "Школа №110" },
                    { 198276, 99, "Школа №111" },
                    { 37894, 99, "Школа №112" },
                    { 9394, 99, "Школа №113" },
                    { 32341, 99, "Школа №104" },
                    { 16514, 99, "Школа №132" },
                    { 21525, 99, "Школа №133" },
                    { 165134, 99, "Школа-интернат №133" },
                    { 49996, 99, "Школа №155" },
                    { 222763, 99, "Школа №156" },
                    { 91507, 99, "Школа №157" },
                    { 1394, 99, "Школа №158" },
                    { 3754, 99, "Лицей №159" },
                    { 7270, 99, "Школа №160" },
                    { 64707, 99, "Школа №161" },
                    { 1467797, 99, "Школа-интернат №161" },
                    { 108643, 99, "Школа №154" },
                    { 136775, 99, "Школа №162" },
                    { 160461, 99, "Школа №164" },
                    { 10775, 99, "Школа №165" },
                    { 11228, 99, "Школа №166" },
                    { 8345, 99, "Школа №167" },
                    { 6391, 99, "Школа №168" },
                    { 33936, 99, "Школа №169" },
                    { 16136, 99, "Школа №170" },
                    { 37695, 99, "Школа №171" },
                    { 796, 99, "Школа №163" },
                    { 213359, 99, "Школа №96" },
                    { 27997, 99, "Школа №153" },
                    { 3944, 99, "Школа №151" },
                    { 31620, 99, "Школа №134" },
                    { 71551, 99, "Школа №135" },
                    { 8639, 99, "Лицей №136" },
                    { 42157, 99, "Школа №137" },
                    { 100355, 99, "Школа №138" },
                    { 77932, 99, "Школа №139" },
                    { 36885, 99, "Школа №140" },
                    { 51130, 99, "Школа №141" },
                    { 139554, 99, "Школа-интернат №152" },
                    { 13403, 99, "Школа №142" },
                    { 55385, 99, "Школа №144" },
                    { 230232, 99, "Школа №145" },
                    { 8054, 99, "Школа №146" },
                    { 54231, 99, "Школа №147" },
                    { 164030, 99, "Школа №148" },
                    { 4215, 99, "Школа №149" },
                    { 126592, 99, "Школа-интернат №149" },
                    { 53074, 99, "Школа №150" },
                    { 16632, 99, "Школа №143" },
                    { 152196, 99, "Языковая школа «Тезаурус-96»" },
                    { 1316751, 99, "Школа-интернат №95" },
                    { 27517, 99, "Лицей №95 экономический" },
                    { 258723, 99, "Школа №53" },
                    { 19619, 99, "Школа №54" },
                    { 98003, 99, "Школа №55" },
                    { 127404, 99, "Профессионально-техническое училище №55" },
                    { 263910, 99, "Детский сад №55" },
                    { 254260, 99, "Профессиональное училище №55" },
                    { 25983, 99, "Школа №56" },
                    { 8557, 99, "Школа №57" },
                    { 10798, 99, "Школа №52" },
                    { 36130, 99, "Школа №58" },
                    { 31615, 99, "Школа №59" },
                    { 178663, 99, "Профессионально-техническое училище №59" },
                    { 215034, 99, "Профессиональное училище №59" },
                    { 53655, 99, "Школа №60" },
                    { 255573, 99, "Лицей №60" },
                    { 129431, 99, "Колледж парикмахерского искусства (бывш. Техникум бытового обслуживания, ПЛ №60)" },
                    { 331, 99, "Школа №61" },
                    { 165510, 99, "Школа №62" },
                    { 189488, 99, "Профессиональное училище №58" },
                    { 63077, 99, "Машиностроительный колледж (бывш. техникум, ПУ №62)" },
                    { 198164, 99, "Колледж почтовой связи и сервиса (бывш. ПЛ №51)" },
                    { 277954, 99, "Школа искусств №50" },
                    { 1670429, 99, "Вечерняя школа №41" },
                    { 245950, 99, "Профессиональный лицей №41" },
                    { 94008, 99, "Школа №42" },
                    { 292996, 99, "Детский сад №42" },
                    { 49639, 99, "Школа №43" },
                    { 211043, 99, "Техникум №43" },
                    { 69907, 99, "Школа №44" },
                    { 261059, 99, "Гимназия №44" },
                    { 37610, 99, "Школа №51" },
                    { 195091, 99, "Школа искусств №44" },
                    { 7701, 99, "Школа №46" },
                    { 7604, 99, "Школа №47" },
                    { 30541, 99, "Школа №48" },
                    { 44908, 99, "Школа №49" },
                    { 274330, 99, "Колледж легкой промышленности и сервиса (НКЛПиС, бывш. ПЛ №49, Техникум легкой промышленности)" },
                    { 24462, 99, "Школа №50" },
                    { 265519, 99, "Гимназия №50" },
                    { 792735, 99, "Архитектурно-строительный колледж (бывш. ПУ №50)" },
                    { 22371, 99, "Школа №45" },
                    { 50288, 99, "Школа №40" },
                    { 21381, 99, "Школа №63" },
                    { 197713, 99, "Школа №65" },
                    { 5505, 99, "Школа №81" },
                    { 234270, 99, "Лицей №81" },
                    { 12564, 99, "Школа №82" },
                    { 70746, 99, "Школа №83" },
                    { 103911, 99, "Школа №84" },
                    { 56975, 99, "Школа №85" },
                    { 22006, 99, "Школа №86" },
                    { 38644, 99, "Школа №87" },
                    { 11785, 99, "Школа №80" },
                    { 256984, 99, "Лицей №87" },
                    { 38271, 99, "Школа №88" },
                    { 33763, 99, "Школа №89" },
                    { 17818, 99, "Школа №90" },
                    { 25829, 99, "Школа №91" },
                    { 258736, 99, "Гимназия №91" },
                    { 13378, 99, "Школа №92" },
                    { 204050, 99, "Школа №93" },
                    { 82217, 99, "Школа №94" },
                    { 184776, 99, "Профессионально-техническое училище №87" },
                    { 31331, 99, "Школа №64" },
                    { 31310, 99, "Школа №79" },
                    { 17493, 99, "Школа №77" },
                    { 60093, 99, "Школа №66" },
                    { 211814, 99, "Лицей №66" },
                    { 132625, 99, "Лицей питания (бывш. ПЛ №66)" },
                    { 2734, 99, "Школа №67" },
                    { 190794, 99, "Профессионально-техническое училище №67" },
                    { 57428, 99, "Школа №68" },
                    { 1507023, 99, "Профессиональное училище №68" },
                    { 50528, 99, "Школа №69" },
                    { 16135, 99, "Школа №78" },
                    { 9510, 99, "Школа №70" },
                    { 149000, 99, "Профессиональное училище №70" },
                    { 36407, 99, "Школа №71" },
                    { 118701, 99, "Школа №72" },
                    { 267760, 99, "Школа искусств №72" },
                    { 3905, 99, "Школа №73" },
                    { 22340, 99, "Школа №74" },
                    { 7565, 99, "Школа №75" },
                    { 16328, 99, "Школа №76" },
                    { 52105, 99, "Гимназия №70" },
                    { 185077, 99, "Языковая школа «Я»" }
                });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 264);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 290);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 788);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2734);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2783);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2831);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2877);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 2985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3637);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3752);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3754);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3844);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 3944);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4128);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4560);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 4718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5505);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5572);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 5591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6391);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6588);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 6771);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7658);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7701);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 7814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8054);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8345);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8557);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 8639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9394);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9922);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 9997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10215);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10775);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 10798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11139);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11228);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11785);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11942);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 11958);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12111);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 12564);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13378);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 13403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14202);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 14328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 15631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16052);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16328);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 16632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 17818);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 18434);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19619);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 19925);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20279);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20280);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20527);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 20613);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21381);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 21525);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22340);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 22371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23841);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 23911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24351);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24462);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 24609);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25829);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 25983);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27804);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 27997);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 28002);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 29255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 30541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31331);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 31620);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32065);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32286);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 32341);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33246);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33256);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33614);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33770);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 33936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 34849);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35369);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35883);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 35893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36407);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 36885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37526);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37570);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37894);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 37993);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38154);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38189);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 38644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 39479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 40856);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42157);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 42421);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43678);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 43978);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 44908);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48066);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 48820);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49117);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49934);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 49996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50088);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50288);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50373);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50528);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50959);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 50975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51130);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 51324);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52105);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52957);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 52975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53074);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 53655);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54016);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54231);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54594);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54813);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 54987);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55385);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 55937);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56046);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 56975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57428);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 57622);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58559);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 58888);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 59645);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60093);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 60964);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 61025);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 63487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 64707);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 65502);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 66639);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67549);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 67828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68743);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 68810);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69440);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 69907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 70746);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71115);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 71551);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 72360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73430);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 73686);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74032);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 74996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 75031);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 76400);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 77932);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78148);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78546);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 78772);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 80759);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 81967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 82217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 83303);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84905);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 84940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 85794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 86413);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87574);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87593);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 87742);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88565);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 88615);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91291);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 91507);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92590);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 92610);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 94008);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 95904);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96038);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96211);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 96893);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 98966);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 99941);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 100355);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101159);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101755);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 101761);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103120);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 103911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 105101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 107853);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108001);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 108643);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 109866);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 110568);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 112366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113156);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113198);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113766);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 113838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 114126);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 115285);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116183);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116636);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 116698);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117123);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117642);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 117962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118701);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 118965);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119010);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 119448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 120222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 122915);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123542);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 123624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124420);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124809);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 124919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125374);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 125737);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126216);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126537);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126586);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126592);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126600);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 126666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127404);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127697);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 127796);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 128501);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129882);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 129946);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 130591);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131486);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131692);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 131998);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132217);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132227);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 132625);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133271);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 133484);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134476);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134857);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 134900);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135497);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135648);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135672);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 135848);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136310);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136311);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136459);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 136775);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138099);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 138491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139554);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 139907);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140147);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140281);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 140366);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141141);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141489);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141585);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 141777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 142876);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 143313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 144798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 145828);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147725);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147812);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 147916);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148442);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148491);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 148890);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149000);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 149728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150224);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150235);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 150940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151339);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 151468);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 152196);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 154604);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 155289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 156376);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 157458);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 158673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159116);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159160);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159274);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159278);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159522);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 159595);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160461);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 160552);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 162514);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163080);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 163558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164030);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164517);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 164832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165134);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165308);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165325);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 165510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 166197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167298);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 167558);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168597);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 168847);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169170);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 169624);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 170222);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172220);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172357);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 172794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173132);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 173541);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 174123);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 175163);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176210);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 176403);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177309);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 177749);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178630);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178933);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 178945);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179727);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179940);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 179962);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180277);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180337);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 180718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181207);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 181406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 183750);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184149);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184200);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184728);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 184776);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185077);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185085);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185142);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185356);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 185632);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186472);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 186764);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 188706);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189488);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 189661);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190432);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190543);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 190794);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 191368);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 193255);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194131);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 194180);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 195091);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197448);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 197713);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198441);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 198470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199084);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199124);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 199360);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 200450);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 202380);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 203194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204050);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204197);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 204898);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206061);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 206447);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 207617);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 209234);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 210936);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211043);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211675);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211814);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 211973);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212194);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212326);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212387);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212718);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 212726);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213359);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 213822);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215034);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215386);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215437);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 215911);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 216273);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219885);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 219935);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220033);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220344);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220390);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 220910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222371);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 222763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224058);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224460);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224578);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 224607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 225695);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 226790);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227425);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 227832);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230232);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230539);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230550);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 230723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 232475);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233401);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 233454);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234270);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 234446);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235510);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 235577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 238803);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 239320);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 240214);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241289);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241426);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 241980);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 243249);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244155);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 244481);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 245950);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246188);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246301);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 246399);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248276);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248864);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 248967);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 249949);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250090);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 250431);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 251350);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252467);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 252858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 253858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254260);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254353);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254464);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 254573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255573);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255696);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255784);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 255793);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256101);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256181);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256268);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 256984);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257062);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257669);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 257858);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258470);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258531);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258723);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 258736);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 259644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260173);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260405);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 260508);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261059);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 261968);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262302);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 262881);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263250);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 263910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265169);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265519);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265689);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 265702);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266150);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 266579);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267103);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 267760);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268051);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 268735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 270022);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273204);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 273535);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274137);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274330);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 274599);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 277954);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 279039);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280009);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 280616);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281763);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 281837);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 284792);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 285709);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 288186);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 290314);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 290676);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 290976);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 291208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292921);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 292996);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293240);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 293417);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294633);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294671);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 294956);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 478479);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 502986);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 547415);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 639607);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 646912);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 792735);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 801854);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 867731);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 874644);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 881806);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 886496);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1034798);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1080666);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1110164);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1316751);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1352003);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1456991);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1467797);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1507023);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1564487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1633406);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1652673);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661512);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661513);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1661777);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662567);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662611);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1662774);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1670429);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1673064);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677493);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1677631);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1681136);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1683037);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1698663);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1705596);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1708910);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1717650);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1719985);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1720135);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1723213);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1725109);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1730343);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1733651);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1745977);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1746975);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1752006);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756168);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1756242);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1757571);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1759704);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1762838);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1763487);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764313);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764495);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1764835);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1766843);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1768694);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1769127);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1771919);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772602);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1772747);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773078);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1773577);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1774223);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1775576);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778058);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1778370);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1779717);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1780312);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781208);

            migrationBuilder.DeleteData(
                table: "Schools",
                keyColumn: "Id",
                keyValue: 1781790);
        }
    }
}
